{"title": "Week 7/8", "season": 2020, "week": "7", "report": "<p>\r\n    Welcome back folks. It was a wild Week 7, with good games spanning\r\n    Thursday-Sunday, and then Jonah’s Bears helping us all get to bed earlier\r\n    on Monday. Except at the Jart Report where we burn the midnight oil to get\r\n    you exclusive scoops and your news quicker. With all that said, strap in\r\n    for our takeaways from Week 7, and a look ahead to an intriguing Week 8. As\r\n    always, thank you for your loyalty, support, and participation. We\r\n    literally could not do this without you.\r\n</p>\r\n    <h3>Biggest Takeaway</h3>\r\n<p>\r\n    This was the worst week in Fantasy Football history. Fantasy Football King\r\n    and Legend, Kenyan Drake, suffered an ankle injury. As tears rolled down\r\n    his face and I left the group chat, one could not help but think back to\r\n    the plethora of injuries this season that have plagued so many teams. You\r\n    were truly left asking yourself, “How does Bank complain about the few he’s\r\n    had, when he even traded for one of them while injured?”. Truly a head\r\n    scratcher if we at the Jart Report have ever seen one. As they say, “you\r\n    can pick your friends and you can pick your nose, but Michael Thomas is\r\n    still a waste of a roster spot”.\r\n\r\n    <h3>Other Notable Takeaways</h3>\r\n    ● <strong>Horses find consistency, but lack explosive play:</strong> Not\r\n    all 128.68 point outings are built the same, as we saw this week with Team\r\n    Horses. No one scored more than 19.3, but no one scored less than 8. While\r\n    this is an encouraging sign for team depth, Horses are likely going to need\r\n    some explosive performances to pull off the win this week, especially now\r\n    with Chris Godwin out. If there’s one person who believes in them though,\r\n    it’s me. Go Team Horses go Derrick Henry.\r\n</p>\r\n<p>\r\n    ● <strong>The injuries continue to rack up for Dmichs (and Aross):</strong>\r\n    Another week, another guy lost for the year for Dmichs as OBJ was lost for\r\n    the year. Coupled with Aaron Jones, Emmanuel Sanders, and Jamison Crowder\r\n    all being unable to play, it has been a rough year for a team that had\r\n    already lost Dak Prescott and Nick Chubb. Some remember the glory days of\r\n    Dmichs’ team- none more so than himself. “Weingarten is on a real tear,\r\n    seems like I’m the only person in the league who is (or was) capable of\r\n    beating him.” Dmichs does not seem to believe his injury situation will\r\n    improve anytime soon, as when asked if he would have more injuries than\r\n    Nooni scores points this week, he confirmed that that is his expectation.\r\n    This writer agrees.\r\n</p>\r\n<p>\r\n    Aross has also struggled in the injury department with the loss of\r\n    transcendent superstar Christian McCaffrey for most of the year, and\r\n    appears to be without both McCaffrey and Chris Carson this week in what is\r\n    likely a must win game for Aross to keep his playoff hopes a reality. When\r\n    asked, Aross said, “Honestly Cmac should sit out one more week. Whatever\r\n    happens happens. And it’s good. Good 🍊”.\r\n</p>\r\n<p>\r\n    ● <strong>Do you smell what the Big Oven is cooking?: </strong>A lost team\r\n    reignited by key trades with JL and Bank, the ovens are firing at full heat\r\n    currently, led by the return of AJB and explosion of Nooni’s favorite NFL\r\n    virgin Tyler Lockett. NN finds himself right in the thick of the playoffs,\r\n    and with a big matchup with Dognis this weekend, he has a chance to really\r\n    make a statement. Keep a close eye on if NN employs the 7 player method\r\n    like MW did to defeat Squeej Nation. When asked if Big Oven was cooking up\r\n    something not even the Horses could swallow, he replied, “🤫”.\r\n</p>\r\n<p>\r\n    ● <strong>Take that Top 6 finish to the Bank:</strong> Bank actually scored\r\n    some points, and won. It was weird. This writer hopes it doesn’t continue\r\n    next week, but if Joe Mixon and Michael Thomas are a go, a much maligned\r\n    team may be starting to hit its stride at just the right time. Consensus\r\n    seems to be that Bank has a solid team, but Brad points out, “Merrick’s\r\n    team isn’t that bad but he makes awful sit/start decisions each week. Needs\r\n    to be talked about more.” Big Oven dissents, stating, “Bank’s team is a\r\n    pretender”.\r\n</p>\r\n<p>\r\n    ● <strong>Can Nooni be relegated?: </strong>That’s really all. Just\r\n    curious. While Chase Edmonds will see a larger role coming off the\r\n    Cardinals Week 8 with Kenyan Drake potentially missing 1+ games, the\r\n    impending return to RB2 status for Mike Davis and well the rest of his\r\n    roster have Nooni on a quick path to last place. The hearts of The Family\r\n    at the Jart Report go out to Saquon Barkley. Get well soon.\r\n</p>\r\n<p>\r\n    ● <strong>Does corruption abound?:</strong> When asked for comment on if he\r\n    considers himself a corrupt commissioner, Jonah Lopas responded “I am not a\r\n    corrupt commissioner. I want a great league for everybody! I’d like the\r\n    readers to know I’m making a deep run this year and that’s a joe namath\r\n    guarantee!” However, when league member CJ Drogosch was asked, he had a\r\n    slightly different response. “Yes”. We’ll let the readers decide for\r\n    themselves.\r\n</p>\r\n<p>\r\n<hr />\r\n</p>\r\n\r\n    <h3>Jart’s Mailbag:</h3>\r\n<p>\r\n    <strong>\r\n        Loyal Fan and Reader Jart asked, “Is DK Metcalf the best WR in\r\n        history?”\r\n    </strong>\r\n</p>\r\n<p>\r\n    Thank you loyal fan and reader for this excellent question. The answer is\r\n    yes.\r\n</p>\r\n<p>\r\n    <strong>\r\n        League sweetheart CJ asked, “Why did mw have 2 empty spots and win?”\r\n    </strong>\r\n</p>\r\n<p>\r\n    Sometimes things don’t go the way you want. Sometimes you’re in a league\r\n    with a corrupt commissioner. For CJ, both of these things were true this\r\n    week. That’s how the cookie crumbles!\r\n</p>\r\n<p>\r\n    <strong>\r\n        League correspondent Adam Schefter asked, “Who was the leak in your\r\n        league?”\r\n    </strong>\r\n</p>\r\n<p>\r\n    Good question Adam. Dmichs.\r\n</p>\r\n<p>\r\n    <strong>\r\n        What player has surprised you the most with his play this season?\r\n    </strong>\r\n</p>\r\n<p>\r\n    James Robinson is the pretty easy pick here. An UDFA who became the starter\r\n    due to COVID and injuries, he is averaging 17.16 PPG, and is coming off his\r\n    best game yet going into the Jaguars bye. A revelation in an otherwise\r\n    atrocious year for the Jags, it will be interesting to see if the return of\r\n    Devine Ozigbo, the once presumed starter, has any impact at all. At this\r\n    point, signs suggest no.\r\n</p>\r\n<p>\r\n    <strong>\r\n        If you could change one of your draft picks to take a guy who went\r\n        within 5 picks after your pick, who would it be?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Taking Aaron Jones (15) over Kenyan Drake (12) is likely the obvious choice\r\n    here from a fantasy standpoint, but I could never not take Kenyan, so I\r\n    look elsewhere. Closely related though, in Round 12 I took the Chargers\r\n    D/ST, while #BigOvenNation took Chase Edmonds 3 picks later. I had never\r\n    planned on the Chargers D being anything more than a one week stream in\r\n    Burrow’s first game, and that paid off, but Chase Edmonds is obviously a\r\n    hot name right now. Overall I was actually pretty pleased with my draft.\r\n</p>\r\n\r\n    <hr />\r\n<p>\r\n    Now we look to the week ahead filled with enticing matchups across the\r\n    board, although none bigger on paper than the #1 and #2 teams currently, MW\r\n    and Horses, facing off in a battle to decide literally nothing at this\r\n    point! To get a pulse on how the league is feeling, we sat down with each\r\n    member.\r\n</p>\r\n<p>\r\n    <strong>Will MW or Horses win this week?</strong>\r\n</p>\r\n<p>\r\n    This was a question that split the league pretty evenly, however Horses\r\n    emerged in the league vote (excluding MW and Folbe) 6-3. Only 9 of the 10\r\n    other league members voted, as CJ replied, “don’t care. just know i’ll\r\n    win”.\r\n</p>\r\n<p>\r\n    <strong>Who is better, Derrick Henry or all of MW’s RB’s combined?</strong>\r\n</p>\r\n<p>\r\n    This author loves King Horse, and he appears to not be alone.\r\n</p>\r\n<p>\r\n    “Competition isn’t even close. Henry eats Merrick’s backs for breakfast” -\r\n    Head Jockey Garrett Folbe\r\n</p>\r\n<p>\r\n    “Derrick Henry could dead lift MW’s RB’s.” - Brad\r\n</p>\r\n<p>\r\n    “Derrick Henry is the perfect representation for Folbe’s penis. I know I\r\n    didn’t answer the question.” - Nooni\r\n</p>\r\n<p>\r\n    “Derrick Henry has a horse and is a horse. That should answer your\r\n    question” - Aross\r\n</p>\r\n<p>\r\n    “No comment. We’re focused on being better as a team and not listening to\r\n    the outside noise.” - MW\r\n</p>\r\n<p>\r\n    <strong>A Horse to Know?</strong>\r\n</p>\r\n<p>\r\n    League sources are reporting that Antonio Gibson is looking to become a\r\n    full-time horse. Last night, a trusted source informed me that, “Antonio\r\n    gibson is in the process of filling out his horse paperwork but hasn’t\r\n    completed his background check”. Be on the lookout for a new member on the\r\n    eve of a key matchup.\r\n</p>\r\n\r\n    <h3>Week 8 Picks:</h3>\r\n\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Folbe vs MW: The matchups are too much in favor of MW, with his players\r\n    facing some of the worst defenses in the league at defending their\r\n    respective positions. <strong>MW 138, Horses 127.</strong>\r\n</p>\r\n<p>\r\n    Bank vs Jart: Would be terrible luck for me to pick myself. Robby Anderson\r\n    vs DJ Moore on Thursday night will set the tone for this matchup. DJ was\r\n    the high scorer last week, will that continue, or will Robby Anderson\r\n    reclaim WR1 scoring? <strong>Bank 119, Jart 105.</strong>\r\n</p>\r\n<p>\r\n    Big Oven vs Dognis: Here we have consistency versus volatility. NN can beat\r\n    anyone, and lose to anyone. Following an explosive week, how do the boys\r\n    play? <strong>Dognis 125, NN 97.</strong>\r\n</p>\r\n<p>\r\n    Dmichs vs Jase: Two teams you’d love to each see get a win, but only one\r\n    can this week. The injuries have simply become too much for Dmichs this\r\n    season, and Jase, who is “feeling pretty defeated at this point in the\r\n    season”, needs a win badly to get back into playoff talk.\r\n</p>\r\n<p>\r\n    <strong>Jase 107, Dmichs 92.</strong>\r\n</p>\r\n<p>\r\n    Aross vs Brad: Rumors swirling that inconsistent QB Cam Newton will be cut,\r\n    with Matt Stafford elevated to full time QB1 for Brad. “My combo of Cam’s\r\n    (Akers and Newton) will be hitting the waivers so tell people to keep an\r\n    eye on it.” A matchup between two teams who really need a win, Aross will\r\nneed to overcome the aforementioned lack of McCaffrey and Carson.    <strong>Aross 102, Brad 88</strong>.\r\n</p>\r\n<p>\r\n    JL vs Noonskis: Does Miles Sanders play this week? This question likely has\r\n    bigger implications for JL than for Jart, given his ownership of Boston\r\n    Scott and lock of other RBs. Nooni’s team has really struggled, but would\r\n    still find itself in the thick of things with a win this week. Can he pull\r\n    the upset of the week/season? <strong>JL 110, Nooni 78</strong>.\r\n</p>\r\n\r\n    <h3>Top Fantasy Player this week at each position:</h3>\r\n\r\n<p>\r\n    QB: Aaron Rodgers\r\n</p>\r\n<p>\r\n    RB: Derrick Henry\r\n</p>\r\n<p>\r\n    WR: Davante Adams\r\n</p>\r\n<p>\r\n    TE: Travis Kelce\r\n</p>\r\n<p>\r\n    D/ST: Chiefs D/ST\r\n</p>\r\n<p>\r\n    K: Stephen Gostkowski<strong></strong>\r\n</p>\r\n<p>\r\n    *The Jart Report also notes that it was rattled to learn that Chandler\r\n    Jones is the younger brother of Jon Bones Jones, thanks Jase.*\r\n</p>\r\n<p>\r\n    Until next time, this has been Papa Jart with your weekly report.\r\n</p>\r\n"}