{"title": "JJetta-ing Into Week Two", "season": 2022, "week": "1", "report": "<p>\r\n    Welcome back to another Jart Report, after an enticing week one that I\r\n    believe has left us with more questions than answers. While some teams may\r\n    have risen to the top early while others have written off fantasy football\r\n    altogether (please still fix the website though), there is much football\r\n    left to be played. Yall don’t wanna read my ramblings up here though, so\r\n    let’s look back at how we kicked off the season.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Week One Recap\r\n</h3>\r\n<p>\r\n    <strong><em>Expand the IR vs United Nations: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: <em>Expand the IR by 10.2</em>\r\n</p>\r\n<p>\r\n    Reality: <em>United Nations by 20.68</em>\r\n</p>\r\n<p>\r\n    “MW is good. I’m bad. See you in the playoffs while I’m watching from the\r\n    couch” - Bank\r\n</p>\r\n<p>\r\n    “Always nice to start the season against an FCS team” - MW\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>Team ACL Tear vs Team Horses: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: <em>Team Horses by 6.4</em>\r\n</p>\r\n<p>\r\n    Reality: <em>Team ACL Tear by 9.48</em>\r\n</p>\r\n<p>\r\n    “Glad my defense stepped up to give us the W. Folbes team is rough this\r\n    year” - JL\r\n</p>\r\n<p>\r\n    “Fantasy is 99% luck and 1% skill. Already focused on 2023” - Folbe\r\n</p>\r\n<p>\r\n    <strong><em>Team Michaels vs Team Nooni: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: <em>Team Michaels by 12.4</em>\r\n</p>\r\n<p>\r\n    Reality: <em>Team Michaels by 2.66</em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    “Good game well played, Nooni. I appreciate you giving me a sweat, it’s no\r\n    fun playing someone in the 80’s-90’s, for that I thank you.” - Dmichs\r\n</p>\r\n<p>\r\n    “*Frick* me for moving Khunt out on Saturday. *Frick* NN for *crapping* on\r\n    my team all preseason, we’re here to play” - Nooni\r\n</p>\r\n<p>\r\n    <strong><em>Team Immunized vs Alyssa Robinson:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction:<strong><em> </em></strong><em>Team Immunized by 23.4</em>\r\n</p>\r\n<p>\r\n    Reality:<em> Alyssa Robinson by 0.6</em>\r\n</p>\r\n<p>\r\n    “Probably had the sweat of the year with Brad and it just went under the\r\n    radar. So many what ifs for both of our teams that could have changed the\r\n    outcome of that matchup. Excited to play him again later this year and get\r\n    my revenge.” - Jason\r\n</p>\r\n<p>\r\n    “Jason continues to be the unluckiest player in the league” - Brad\r\n</p>\r\n<p>\r\n    <strong><em>Team Levine vs Two Cooks in the Kitchen:</em></strong>\r\n</p>\r\n<p>\r\n    <em>Prediction:</em>\r\n    <em>Team Levine by 4.5</em>\r\n</p>\r\n<p>\r\n    <em>Reality: Team Levine by 3.16</em>\r\n</p>\r\n<p>\r\n    “Team Levine will be the scrappy type to just hang on this season. Offense\r\n    wins games but defense wins championships and as long as my opponents have\r\n    poor weeks against me then I’m poised for an underdog story. ARoss came up\r\n    short in the battle of atrocious QB’s and JJ was well worth the money with\r\n    the best half of football in week 1” - Levine\r\n</p>\r\n<p>\r\n    “Glad he won, some people don’t think he should be in the league. That will\r\n    shut them up for a week” - Aross\r\n</p>\r\n<p>\r\n    <strong><em>Step Burrow I’m Stuck vs The Report:</em></strong>\r\n</p>\r\n<p>\r\n    <em>Prediction: Step Burrow I’m Stuck by 12.4</em>\r\n</p>\r\n<p>\r\n    Reality: <em>Step Burrow I’m Stuck by 18.14</em>\r\n</p>\r\n<p>\r\n    “Great week 1, respect to my opponent for putting up a great fight” - NN\r\n</p>\r\n<p>\r\n    “What a fun matchup! So much excitement with that Bengals-Steelers game,\r\n    CEH’s hot start, seeing Saquon look fantastic, and some MNF fun. I did not\r\n    expect to win this week, but I am very pleased about what the future holds\r\n    for my team! Congratulations to my brother Big Oven Lebron In The Playoffs\r\n    on the victory” - Jart\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    The Him Larrañaga Award For Excellence\r\n</h3>\r\n<p>\r\n    Making its debut this week, this award seems rather self-explanatory. It\r\n    will be awarded weekly to the player who simply was him this week. It will\r\n    not always be the highest scoring player, although that does help. There is\r\n    really only one option for the recipient of this award, the titular man\r\n    this week for the Report, Justin Jefferson. Dominant from the get-go,\r\n    Jefferson showed that he is well on his way to dominating the league for\r\n    the 3rd straight season to start his career, and this writer wishes that\r\n    Levine had traded Jefferson to The Report! Racking in a whopping 66.4% of\r\n    Kirk Cousin’s yards on the day, Jefferson showed that his role may only be\r\n    growing in the offense as Thielen continues to age, and KJ Osborn is the\r\n    next threat to targets. When a team is out here trading for Jalen Reagor,\r\n    you know there is not much competition up top. Congratulations to Justin on\r\n    being Him Larrañaga this week!\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Who’s Back Of The Week?\r\n</h3>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Team: </strong>\r\n    MW. While I am still not sold on the model of no stable QB play, it\r\n    certainly worked out well for him in Week One, with Mariota putting forth a\r\n    solid performance and getting some great play from his skill position\r\n    studs. He’s a name to know once again this season!\r\n</p>\r\n<p>\r\n    Honorable Mention: Dmichs\r\n</p>\r\n<p>\r\n    <strong>Player: </strong>\r\n    Saquon Barkley. While it came at the expense of The Report this week, we\r\n    are personally thrilled to see one of our favorite players in the league\r\n    show that he still possesses all the traits of an elite RB. Obviously\r\n    staying healthy will be the key for Saquon, but we are hopeful that the\r\n    injury bug is behind him. All the best to your guy NN!\r\n</p>\r\n<p>\r\n    Honorable Mention: Geno Smith\r\n</p>\r\n<p>\r\n    <strong>Something Else: </strong>\r\n    Dmichs’ trips to Costco. I’m not really sure what is going on there. But I\r\n    am here for it. Eat up young man!\r\n</p>\r\n<p>\r\n    Honorable Mention: Pesto\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Who’s Not Back Of The Week?\r\n</h3>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Team: </strong>\r\n    Nooni. 0-14 baby.\r\n</p>\r\n<p>\r\n    Honorable Mention: Folbe\r\n</p>\r\n<p>\r\n    <strong>Player: </strong>\r\n    Chris Godwin. It pains this writer to categorize Godwin here as I am\r\n    personally a big fan, but in his first game back from ACL surgery, Godwin\r\n    is already sidelined once again with a hamstring injury. Heal up quick\r\n    Chris!\r\n</p>\r\n<p>\r\n    Honorable Mention: Rodrigo Blankenship\r\n</p>\r\n<p>\r\n    <strong>Something Else: </strong>\r\n    Scott Frost. We’ll be seein ya\r\n</p>\r\n<p>\r\n    Honorable Mention: The vampire that was planning on killing Dmichs before\r\n    he bought three pounds of garlic\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Transaction Analysis\r\n</h3>\r\n<p>\r\n    <strong>Best Transaction:</strong>\r\n    Jeff Wilson Jr, $0. With Eli Mitchell being out for 8 weeks, Jeff Wilson Jr\r\n    has become a viable starting RB that NN got for free! He may still only be\r\n    RB3 in that offense, but nonetheless it was a shrewd move.\r\n</p>\r\n<p>\r\n    Honorable Mention: Isiah Pacheco, $0. While his successful week one was\r\n    primarily credited to the Chiefs being up by so much and thus CEH sitting\r\n    out much of the second half, Pacheco showed some shiftiness, and all\r\n    players in the Chiefs offense hold a high ceiling as they continue to\r\n    replace Tyreek Hill. This could end up being a sneaky good acquisition.\r\n</p>\r\n<p>\r\n    <strong>Worst Transaction:</strong>\r\n    Joe Flacco, $0. Flacco himself is not terrible, but Dmichs dropping Geno\r\n    Smith to acquire Flacco is what lands him on this list. Geno is him. No way\r\n    around it. And he is gonna go for a solid bag this upcoming week. A tough\r\n    break for a team that usually does not make these kinds of mistakes.\r\n</p>\r\n<p>\r\n    Honorable Mention: Irv Smith, $1. He may not catch a pass this year.\r\n</p>\r\n<h3>\r\n    Record by PF Finish\r\n</h3>\r\n<p>\r\n    1st: 1-0\r\n</p>\r\n<p>\r\n    2nd: 1-0\r\n</p>\r\n<p>\r\n    3rd: 1-0\r\n</p>\r\n<p>\r\n    4th: 0-1\r\n</p>\r\n<p>\r\n    5th: 1-0\r\n</p>\r\n<p>\r\n    6th: 0-1\r\n</p>\r\n<p>\r\n    7th: 0-1\r\n</p>\r\n<p>\r\n    8th: 0-1\r\n</p>\r\n<p>\r\n    9th: 1-0\r\n</p>\r\n<p>\r\n    10th: 0-1\r\n</p>\r\n<p>\r\n    11th: 1-0\r\n</p>\r\n<p>\r\n    12th: 0-1\r\n</p>\r\n<h3>\r\n    Worst Possible Lineup\r\n</h3>\r\n<p>\r\n    QB: Matt Stafford, 7.8 points, JL\r\n</p>\r\n<p>\r\n    RB: Cam Akers, 0 points, Bank\r\n</p>\r\n<p>\r\n    RB: Eli Mitchell, 4.1 points, Brad\r\n</p>\r\n<p>\r\n    WR: Darnell Mooney, 1.3 points, Brad\r\n</p>\r\n<p>\r\n    WR: Allen Robinson, 1.7 points, Brad<strong></strong>\r\n</p>\r\n<p>\r\n    TE: Mike Gesicki, 1.1 points, Folbe\r\n</p>\r\n<p>\r\n    FLEX: Cole Kmet, 0.0 points, Levine\r\n</p>\r\n<p>\r\n    SUPERFLEX: Aaron Rodgers, 3.7 points, Jason\r\n</p>\r\n<p>\r\n    D/ST: Green Bay, 1.0 points, Nooni\r\n</p>\r\n<p>\r\n    <strong>Total Points: 20.7</strong>\r\n</p>\r\n<p>\r\nWould it have beaten Folbe:    <strong>Nah, Team Horses is balling out</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Best Possible Lineup\r\n</h3>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    QB: Josh Allen, 31.48 points, Bank\r\n</p>\r\n<p>\r\n    RB: Saquon Barkley, 30.4 points, NN\r\n</p>\r\n<p>\r\n    RB: Jonathan Taylor, 25.5 points, Dmichs\r\n</p>\r\n<p>\r\n    WR: Justin Jefferson, 34.9 points, Levine\r\n</p>\r\n<p>\r\n    WR: Cooper Kupp, 25.3 points, MW\r\n</p>\r\n<p>\r\n    TE: Travis Kelce, 26.1 points, Nooni\r\n</p>\r\n<p>\r\n    FLEX: Mike Evans, 15.6 points, JL\r\n</p>\r\n<p>\r\n    SUPERFLEX: Patrick Mahomes, 34.9 points, Brad\r\n</p>\r\n<p>\r\n    D/ST: Bills D/ST, 15.0 points, Jart\r\n</p>\r\n<p>\r\n    <strong>Total Points: 239.18</strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Would it have beaten Dwitt in 2019: Yes, thank you Superflex!\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Best Benchwarmer Lineup\r\n</h3>\r\n<p>\r\n    QB: Carson Wentz, 27.72 points, NN\r\n</p>\r\n<p>\r\n    RB: Kareem Hunt, 21.0 points, Nooni\r\n</p>\r\n<p>\r\n    RB: James Robinson, 19.4 points, MW\r\n</p>\r\n<p>\r\n    WR: Michael Thomas, 20.2 points, JL\r\n</p>\r\n<p>\r\n    WR: Christian Kirk, 14.7 points, Jart\r\n</p>\r\n<p>\r\n    TE: Logan Thomas, 7.5 points, Dmichs\r\n</p>\r\n<p>\r\n    FLEX: AJ Dillon, 17.6 points, NN\r\n</p>\r\n<p>\r\n    SUPERFLEX: Daniel Jones, 16.02 points, Jart\r\n</p>\r\n<p>\r\n    D/ST: Tampa Bay, 10.0 points, Dmichs\r\n</p>\r\n<p>\r\n    <strong>Total Points: 154.14</strong>\r\n</p>\r\n<p>\r\n    <strong>How many teams would it have beaten this week: All 12</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Jart’s Mailbag\r\n</h3>\r\n<p>\r\n    <strong>Why oh why did Team Immunized have to lose by 0.6?</strong>\r\n</p>\r\n<p>\r\n    Truly heartbreaking stuff. Personally, Christian Watson seems to be the one\r\n    to blame for dropping a wide open long TD. It was certainly a tough\r\n    setback, but morale should remain high for Team Immunized, as the Hurts-AJB\r\n    stack looks elite, and Jones and Jacobs should find the endzone in future\r\n    weeks. Cooks is the ultimate safety net at WR, and BMW should see more work\r\n    with Keenan Allen sidelined. Keep your head up!\r\n</p>\r\n<p>\r\n    <strong>\r\n        Will Marcus Mariota finish with more points than Trey Lance?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I mean maybe, but probably not. I do not see Mariota keeping his job for\r\n    the duration of the season, as he seems to have spoken openly about his\r\n    role in mentoring Ridder. Lance will be San Fran’s guy for better or worse,\r\n    because Jimmy G has shown that he cannot lead a team to a Super Bowl. Lance\r\n    may not be able to either, but SF needs to find out. This week should be\r\n    more telling on the two with Lance playing in normal weather, and he avoids\r\n    the reincarnation of the ‘85 Bears D. Will be fun to see how it plays out\r\n    as they face off against each other in fantasy this week!\r\n</p>\r\n<p>\r\n    <strong>What (team) surprised you the most after Week One?</strong>\r\n</p>\r\n<p>\r\n    This was two separate questions, so for team, It pains me to say it, but\r\n    MW. I want to be clear that I love Marcus Mariota. I hope he does\r\n    incredible. I did and still do not expect him to. But he had a very solid\r\n    week one, and the studs MW spent big money on came through in week one,\r\n    which is a very encouraging sign for him. I thought MW would struggle this\r\n    year, and he still may, but I was surprised at his Week One performance.\r\n</p>\r\n<p>\r\n    Outside of a team, I was most surprised by Justin Jefferson. How was he so\r\n    wide open when Minnesota does not have other major threats at wideout? Is\r\n    Green Bay that bad in the secondary, or is Jefferson that good? It is\r\n    probably both.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Will any game finish with less point discrepancy than Brad and Jason at\r\n        0.6?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I really hope so, because we love a good sweat. But with the implementation\r\n    of the SUPERFLEX, we should be seeing much higher scoring matchups this\r\n    year, which will likely increase the variance of scores and make close\r\n    matchups less likely. But since we love close ones, we will say yes! Let’s\r\n    go with a 135.42-135.08 matchup this season.\r\n</p>\r\n<p>\r\n    <strong>What team are you most concerned about? </strong>\r\n</p>\r\n<p>\r\n    JL, because the injuries are already starting to mount up. It seems like\r\n    every year there is a team that is just always injured, and he is certainly\r\n    trending in that direction already. Got the win week one with an 11th in PF\r\n    performance, but is going to need to score much higher in the future to\r\n    win, and the weapons may not be there right now.\r\n</p>\r\n<p>\r\n    <strong>1-10 how much do you regret drafting Kyler for $39?</strong>\r\n</p>\r\n<p>\r\n    If 10 is the most, probably like a 2? On an off week for him, he still\r\n    scored 20 points, and should be a solid set and forget option at a very\r\n    important position. I would like to see him use his legs more than he did\r\n    in week one, but he also came up just short of adding a rushing TD as well\r\n    that would have put him near the top of the board for scoring this week. We\r\n    remain very high on Kyler!\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Who is your week 1 overreaction favorite to win the league pick?\r\n    </strong>\r\n</p>\r\n<p>\r\n    NN! What a team! 3rd in roto and had a number of plays on his bench show\r\n    out in Wentz and Dillon. It was a privilege to face off against him, and\r\n    while I do not actually think he will end up winning the league because\r\n    that is determined by whose team is not decimated by injuries and gets hot\r\n    late, he has moved to the Report’s favorite currently.\r\n</p>\r\n<p>\r\n    <strong>\r\n        What the *heck* was Nathaniel Hackett doing? If you didn’t watch the\r\n        end of that game please find some footage and view and get back to the\r\n        readers.\r\n    </strong>\r\n</p>\r\n<p>\r\n    I did not catch much of the game as I was at a Division III JV football\r\n    game (I at least got to stand on the sideline with the team), but I sought\r\n    out some footage and perspectives. I have no words for that drive and clock\r\n    management. I love the video of Peyton trying to call a timeout for the\r\n    Broncos, because I just don’t get it. How do you give up so much to trade\r\n    for Russ, give him an enormous contract, and then not let you go win the\r\n    game against his former team? McManus is good, but a 64 yard field goal has\r\n    to be lower percentage than converting a 4th and 5. Wild times. Hackett’s\r\n    worst move was perhaps even coming out and saying he would have done it\r\n    differently, because it shows an immense lack of confidence that you do not\r\n    want to see from your head coach. Denver definitely has some issues to\r\n    figure out.\r\n</p>\r\n<p>\r\n    <strong>\r\n        I don’t recall if the Jart trade analyzer did suggested trades last\r\n        year but if so will we see a return of this segment, if not is this\r\n        something the readers can expect?\r\n    </strong>\r\n</p>\r\n<p>\r\n    Yes! Not this week because trading after one week is a vast overreaction\r\n    and we cannot support that, but the Trade Jartalyzer<sup>TM</sup> will be\r\n    back soon, and will include suggested trades once more information has been\r\n    gathered on people’s rosters.\r\n</p>\r\n<p>\r\n    <strong>Please rank the league in order of who will retire first? </strong>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        MW (I think he already did)\r\n    </li>\r\n    <li>\r\n        JL\r\n    </li>\r\n    <li>\r\n        Bank\r\n    </li>\r\n    <li>\r\n        NN\r\n    </li>\r\n    <li>\r\n        Nooni\r\n    </li>\r\n    <li>\r\n        Aross\r\n    </li>\r\n    <li>\r\n        Folbe\r\n    </li>\r\n    <li>\r\n        Dmichs\r\n    </li>\r\n    <li>\r\n        Jase\r\n    </li>\r\n    <li>\r\n        Brad\r\n    </li>\r\n    <li>\r\n        Levine\r\n    </li>\r\n    <li>\r\n        Jart\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong>Thoughts on Peloton firing their chairman and former CEO?</strong>\r\n</p>\r\n<p>\r\n    I hope you pay back everyone you made lose money. But hopefully big things\r\n    ahead for $PTON! To the moon!\r\n</p>\r\n<p>\r\n    <strong>Who is your biggest riser/faller?</strong>\r\n</p>\r\n<p>\r\n    Biggest Riser: Nooni. I’ll still trash him at times in this report, because\r\n    it is fun to. And he still needs to find a way to win a game. But Kelce\r\n    looks like a cheat code, Mixon and Ekeler should be a solid duo all season\r\n    long if they can stay healthy, and Waddle should find good usage still even\r\n    as WR2 in Miami. The play of Tannehill and Jameis will be the big question\r\n    mark, but overall this team should be much improved this year.\r\n</p>\r\n<p>\r\n    Biggest Faller: JL. Given his recent success, he gained the benefit of the\r\n    doubt in many ways from this writer, but Stafford looked awful, Dak is\r\n    hurt, Kamara is hurt, Keenan is hurt. There’s positives like Gibson taking\r\n    over the RB1 role in Washington, and Chase looks to be heavily involved\r\n    once again this year, but there’s a lot of concerns currently.\r\n</p>\r\n<p>\r\n    <strong>What’s your projected playoff?</strong>\r\n</p>\r\n<p>\r\n    NN, MW, Dmichs, Jase, Jart, Nooni.\r\n</p>\r\n<p>\r\n    <strong>Herbert, Allen, Mahomes start/bench/cut?</strong>\r\n</p>\r\n<p>\r\n    I am starting Allen. He is the model of consistency, and his usage of his\r\n    legs more than the others gives him a slightly higher floor. Between\r\n    Herbert and Mahomes, this is tough, but Mahomes currently has more options\r\n    around him, especially as Keenan deals with his injury. So I would bench\r\n    Mahomes, and cut Herbert. Keep that waiver money ready Brad.\r\n</p>\r\n<h3>\r\n    Mailbag Question of the Week\r\n</h3>\r\n<p>\r\n    The questions you all ask are the lifeblood of the Jart Report and I\r\n    greatly appreciate them, and thus as an additional enticement to keep them\r\n    flowing each week, I will be selecting one question to be the question of\r\n    the week. Our inaugural winner is:\r\n</p>\r\n<p>\r\n    <strong>\r\n        Scott Frost, Mike Riley, Bo Pelini (hire, fire, offensive/defensive\r\n        coordinator)?\r\n    </strong>\r\n</p>\r\n<p>\r\n    This is tough. I would not want any of them on my staff, as Bo showed his\r\n    inability to do anything in his failure of a return to LSU as DC, and Frost\r\n    has lost any ability to call plays. But Mike Riley is just the worst coach\r\n    ever, so I will take Pelini as my HC, and Frost as my OC. But we’d win\r\n    about 3 games.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Mailbag Question Asking Standings\r\n</h3>\r\n<p>\r\n    Per request, we will be tracking how many mailbag questions each of you\r\n    have asked.\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Jason (23)\r\n    </li>\r\n    <li>\r\n        Bank (14)\r\n    </li>\r\n    <li>\r\n        Brad (11)\r\n    </li>\r\n    <li>\r\n        NN (8)\r\n    </li>\r\n    <li>\r\n        MW (8)\r\n    </li>\r\n    <li>\r\n        Folbe (5)\r\n    </li>\r\n    <li>\r\n        JL (5)\r\n    </li>\r\n    <li>\r\n        Nooni (3)\r\n    </li>\r\n    <li>\r\n        Levine (3)\r\n    </li>\r\n    <li>\r\n        Dmichs (2)\r\n    </li>\r\n    <li>\r\n        Aross (1)\r\n    </li>\r\n</ol>\r\n<h3>\r\n    League Takes\r\n</h3>\r\n<p>\r\n    <strong>Agree:</strong>\r\n</p>\r\n<p>\r\n    -NN winning week 1 sets him back by not putting steel in his spine\r\n</p>\r\n<p>\r\n    -Hot takes are fun\r\n</p>\r\n<p>\r\n    <strong>Neutral:</strong>\r\n</p>\r\n<p>\r\n    -Folbe’s team is so bad it makes me wanna claw out my eyes\r\n</p>\r\n<p>\r\n    -Nooni’s team isn’t as bad as we once thought\r\n</p>\r\n<p>\r\n    <strong>Disagree:</strong>\r\n</p>\r\n<p>\r\n    -MW wins again\r\n</p>\r\n<h3>\r\n    Jart’s Power Rankings\r\n</h3>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        NN\r\n    </li>\r\n    <li>\r\n        Dmichs\r\n    </li>\r\n    <li>\r\n        MW\r\n    </li>\r\n    <li>\r\n        Jart\r\n    </li>\r\n    <li>\r\n        Levine\r\n    </li>\r\n    <li>\r\n        Jason\r\n    </li>\r\n    <li>\r\n        Bank\r\n    </li>\r\n    <li>\r\n        Aross\r\n    </li>\r\n    <li>\r\n        Brad\r\n    </li>\r\n    <li>\r\n        JL\r\n    </li>\r\n    <li>\r\n        Folbe\r\n    </li>\r\n    <li>\r\n        Nooni (win a game)\r\n    </li>\r\n</ol>\r\n<h3>\r\n    Week Two\r\n</h3>\r\n<p>\r\n    <strong><em>Expand the IR </em>vs <em>Alyssa Robinson</em>:</strong>\r\n    This matchup is fun because they are the two that likely have the most\r\n    invested in the QB position this year, which certainly paid off well for\r\n    them production wise in week one. Beginning with some TNF fireworks and\r\n    Herbert-Mahomes, this matchup has the potential to bring a lot of fun and\r\n    sweat no matter how many points each team ends up scoring. We give the\r\n    slight edge to Bank at the QB position, as the Chiefs look like the overall\r\n    better team, which generally benefits the QB of the worse team as they play\r\n    catch-up. The RB situation for both teams is not my favorite, but Bank\r\n    seems to hold the advantage here as well with Michael Carter getting a lot\r\n    of usage and Cam Akers in the doghouse. James Conner scoring 14 points on\r\n    26 yards rushing (2.6 ypc) continues to frustrate me. At WR, while Arobby,\r\n    Mooney, and Woods should all have bounceback weeks after each only having 1\r\n    catch in Week One (insane), Renfrow should also get more work with Carr not\r\n    being harassed constantly, and Diggs looks like the WR1 for an elite Bills\r\n    offense. Given all this, <em>we like</em> <em>Expand the IR by 14.5. </em>\r\n</p>\r\n<p>\r\n    Bank: “I’m gonna lose”\r\n</p>\r\n<p>\r\n    Brad: “My team sucks. Going to get smoked by expand the IR (reverse jinx)”\r\n</p>\r\n<p>\r\n    <strong><em>Team Nooni vs. Team ACL Tear:</em></strong>\r\n    This writer wants to start by noting that 18 points is not Joe Mixon’s\r\n    floor. The QB situation is not pretty for either team in this matchup,\r\n    although Stafford should look much better this week now that they are not\r\n    facing the best defense in the league. It is revenge week for Jameis though\r\n    against Tampa Bay, and thus we like Nooni to have the slight edge at the QB\r\n    spot (also T-3 weeks until Pickett starts in Pittsburgh). The RBs are the\r\n    thing to watch for these teams, although Kamara’s health will be something\r\n    to keep an eye on, as Melvin Gordon does not offer nearly the same amount\r\n    of upside. Ekeler should get plenty of passing work, and Mixon should run a\r\n    lot with Cincy up big on a Dak-less Dallas team, so we like Nooni at RB.\r\n    Given that Cincy should run a lot, we like Nooni at WR as well, as Chase\r\n    should have a weaker day. Travis Kelce is the clear cut TE1 as well, and\r\nTonyan won’t put up nearly the same numbers. Given this,    <em>we like Team Nooni by 27.3</em>.\r\n</p>\r\n<p>\r\n    Nooni: “No clue about next week yet, we’ll be coming out hard again\r\n    considering my RBs are the stronger part of my team and they had floor\r\n    weeks for sure”\r\n</p>\r\n<p>\r\n    JL: “Excited to go against my former family Ekeler and Mixon. Nooni’s team\r\n    is far better than mine so I expect to lose. Let's go Mitch!”\r\n</p>\r\n<p>\r\n    <strong><em>Step Burrow I’m Stuck vs Team Horses:</em></strong>\r\n    Likely the best team from Week One against the worst, Folbe is going to\r\n    need a major bounceback performance to be able to hang. While we think this\r\n    is entirely within the realm of possibility (we need to stop overreacting\r\n    to Week One), the QB position favors NN with a shrewd start of Wentz over\r\n    Burrow, and Russell coming out angry against Houston. Saquon finally looks\r\n    elite once again at the RB position, and 4NET is getting fantastic usage\r\n    along with AJ Dillon. Derrick Henry should look better, and perhaps Miles\r\n    can find the endzone again this week (this writer hopes so!), but Ceedee’s\r\n    stock is certainly down currently without Dak. The potential return of\r\n    Kittle could be a major boon for Folbe after Gesicki managed 1 yard last\r\n    week, but it still likely won’t be enough to get him over the hump this\r\nweek.    <em>We like Step Burrow I’m Stuck by 3.3 in a surprisingly close one.</em>\r\n</p>\r\n<p>\r\n    NN: “Looking forward to playing Folbe. I’m lucky to face him while I get to\r\n    start Wentz at QB vs. his Lions. Getting the boys rallied to start 2-0”\r\n</p>\r\n<p>\r\n    Folbe: “No”\r\n</p>\r\n<p>\r\n    <strong><em>Team Immunized vs Team Levine:</em></strong>\r\n    While Jason is beginning to hurt my credibility as a writer with these\r\n    losses, we are pleased to report that his team remained healthy, and that\r\n    the QB position overall looks promising. I do not see Aaron Rodgers as an\r\n    elite QB this year, but Hurts will be near the top every week, and Rodgers\r\n    should hover much closer to 15 PPG than 3.7. Tua and Goff are gross for\r\n    Levine, how did this guy outscore me last week? RB’s look like a push in\r\n    this matchup, although personally I am pretty low on Penny this year.\r\n    JJettas alone puts Levine at the advantage at WR, but will it be enough to\r\n    overcome disgusting QB play and a Goff-Chark stack? This writer thinks not,\r\nas the Hurts-AJB stack is lethal. <em>We like Team Immunized by 7.8.</em>    <em></em>\r\n</p>\r\n<p>\r\n    Jase: “Excited to be given the opportunity to humble Levine and give him\r\n    his first loss in this league. Good luck!”\r\n</p>\r\n<p>\r\n    Levine: “I’m very fearful going into next week. I think the Hurts-AJ Brown\r\n    duo is going to be a top 5 wr/qb duo this season and will be the\r\n    determining factor next week”\r\n</p>\r\n<p>\r\n    <strong><em>Team Michaels vs Two Cooks in the Kitchen: </em></strong>\r\n    ARoss made the clear decision to not invest in the QB position this year,\r\n    and while we will see if that pays off, Dmichs holds the advantage here. RB\r\n    is quite interesting, as Dmichs likely has the best one in Taylor, and\r\n    Patterson has been hot, but Zeke should struggle greatly without Dak, and\r\n    Caff + Dalvin is insane when they are on. While Amon-Ra looks like a great\r\n    option this year and Sutton had a solid night, Davante is the clear cut WR1\r\n    in Las Vegas, and Jeudy flashed big play potential on Monday night. This\r\n    writer loves Juju on TNF this week, and thinks that could be the difference\r\nmaker. This should be a great matchup, and    <em>we like Two Cooks in the Kitchen by 4.3</em>.<em></em>\r\n</p>\r\n<p>\r\n    Dmichs: “I don’t like Alex’s team at all this year. But he’s proven to be a\r\n    top guy in fantasy year in year out so there’s no counting him out”\r\n</p>\r\n<p>\r\n    Aross: “This will be the first Sunday I miss in over 6 years as I will be\r\n    starting a 7 hour drive. May bench my guys”\r\n</p>\r\n<p>\r\n    <strong><em>United Nations vs The Report:</em></strong>\r\n    This is gonna be fun! MW has been talking a lot of smack about Mariota &gt;\r\n    Lance, and thus we are excited to get onto the field and see how this one\r\n    plays out. Kyler demonstrated his floor may be around 20 points, and thus\r\n    we like Jart to hold the QB advantage here, even if Mariota outperforms\r\n    Lance once again. RB should be quite interesting, as all four flashed last\r\n    week as legit guys moving forward this season. We give MW the slight edge,\r\n    but could see it going either way. MW does hold the clear advantage at WR\r\n    with Deebo, Kupp, and Tyreek although the upside on DK and Diontae remains\r\n    high. Pitts should have a bounceback performance, although this writer is\r\n    high on both Goedert and Hockenson this week. This could be very back and\r\n    forth, and rests on which guys show up with big days, but for now, MW seems\r\n    like the safer pick, and thus <em>we like United Nations by 7.5.</em>\r\n</p>\r\n<p>\r\n    MW: “Wish you all the best this week”\r\n</p>\r\n<p>\r\n    Jart: “Wish you even more than all the best this week”\r\n</p>\r\n<h3>\r\n    Jart’s Survivor Pool\r\n</h3>\r\n<p>\r\n    For this segment, each week I will be selecting one team that I am\r\n    guaranteeing a win for, and I cannot pick the same team twice in the same\r\n    season. For the inaugural week, although he is going 0-14, we are taking\r\n    Nooni!\r\n</p>\r\n<p>\r\n    <strong>Best Player at Each Position:</strong>\r\n</p>\r\n<p>\r\n    QB: Justin Herbert, Bank\r\n</p>\r\n<p>\r\n    RB: Nick Chubb, Jart\r\n</p>\r\n<p>\r\n    WR: Justin Jefferson, Levine\r\n</p>\r\n<p>\r\n    TE: Travis Kelce, Nooni\r\n</p>\r\n<p>\r\n    D/ST: Bengals, FA\r\n</p>\r\n<h3>\r\n    JL’s Power Rankings\r\n</h3>\r\n<p>\r\n    1. NN (+8)\r\n</p>\r\n<p>\r\n    2. DMikes (+4)\r\n</p>\r\n<p>\r\n    3. Banooni (+8)\r\n</p>\r\n<p>\r\n    4. Jarrett (+3)\r\n</p>\r\n<p>\r\n    5. Merrick (+7)\r\n</p>\r\n<p>\r\n    6. Bank (-2)\r\n</p>\r\n<p>\r\n    7. Alex (+1)\r\n</p>\r\n<p>\r\n    8. Jason (-7)\r\n</p>\r\n<p>\r\n    9. Brad (-4)\r\n</p>\r\n<p>\r\n    10. Levine (No Change)\r\n</p>\r\n<p>\r\n    11. Jonah (-9)\r\n</p>\r\n<p>\r\n    12. Folbe (-9)\r\n</p>\r\n<h3>\r\n    Family Award\r\n</h3>\r\n<p>\r\n    For its eclectic mix of personal family members and family members of The\r\n    Report, Dmichs wins the award. A first place finish in PF on the backs of\r\n    strong days from Jonathan Taylor, Cordarelle Patterson, and Davante Adams,\r\n    this team is a beautiful family that will only continue to flourish if it\r\n    can find consistent FLEX and QB play.\r\n</p>"}