{"title": "What's the Deal", "season": 2022, "week": "0", "report": "<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Welcome back to another Jart Report, as we look back on the draft and ahead\r\n    to the rapidly approaching kickoff week! This week we dive into the\r\n    question, “what’s the deal with everyone’s team?” as we reflect on the\r\n    momentous inaugural auction draft for this league as it leaves the stone\r\n    age and boomer Folbe in the rear view mirror. After what was a fantastic\r\n    draft, we at The Report are excited to dive into your questions and analyze\r\n    the selections made.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    Jart’s Mailbag\r\n</h3>\r\n<p>\r\n    <strong>How are you feeling today?</strong>\r\n</p>\r\n<p>\r\n    I’m doing well, thanks for asking! I’m about to take off for Minnesota for\r\n    three days (I’ll likely be releasing this on my way home from that trip).\r\n    Been a very busy long weekend, but it has been a lot of fun, and I am\r\n    excited for the football season to officially get underway. Still thinking\r\n    through what different segments I want to include this season, but excited\r\n    for the process to begin again as I experiment and grow The Report!\r\n</p>\r\n<p>\r\n    <strong>What surprised you most from the draft?</strong>\r\n</p>\r\n<p>\r\n    Aross not going bigger on QBs. I’ll mention this often in this report (I\r\n    know this because I already wrote most of it and am working out of order\r\n    here), but I’m fascinated to see what makes up a successful team. Aross\r\n    certainly continued to prioritize elite RB play, which was undoubtedly the\r\n    move in our prior system. It very well could remain to be so, in which case\r\n    he is in fantastic shape. But perhaps it will not be with QBs receiving a\r\n    major bump and TEs a minor one! Only time will tell, and that is an\r\n    additional fun twist heading into what should be our best season yet.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Looking back, what's your biggest regret (anyone you wish you would\r\n        have spent more on to get?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I mention this later as well, but Alvin Kamara. I really wanted him going\r\n    into the draft. He did not go for much. I am not sure what I was doing\r\n    honestly. Might have been distracted, was drafting while technically still\r\n    at work.\r\n</p>\r\n<p>\r\n    <strong>Is there anyone you felt you spent too much on?</strong>\r\n</p>\r\n<p>\r\n    I have heard murmurs of my pick of Dameon Pierce for $23, and while I can\r\n    understand the perspective, I also got the other players on my roster near\r\n    the end for much cheaper than expected, and I had to make sure I got him as\r\n    I see him as a Top 15 RB this year. I knew $23 was the most Aross could\r\n    still spend at that point and was not sure where he was going with that\r\n    money, so I went and made sure I did not get outbid, which $23 ensured. He\r\n    later told me his max on Pierce was $12, but hey, go get your guy. It’s\r\n    Dameon Pierce bellcow season.\r\n</p>\r\n<p>\r\n    Aside from this, I would say that unless Kareem Hunt gets traded it would\r\n    be Nick Chubb. Chubb is a guy I had admired on the teams of others for many\r\n    years now and knew I wanted him to be a family member now. But his QB\r\n    situation is admittedly not great, and I pretty much spent the same amount\r\n    as Kamara went for. I’d rather have Kamara, I’ll tell you that.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Not sure how many trades NN made last year but can we get a total on\r\n        that and get an over/under that number of trades for him this season?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I can see this going a lot of different directions, but I will put the\r\n    number at 3.5 for you degens at home reading this currently. I think he\r\n    will be more hesitant to trade this year after proclaiming himself the\r\n    biggest beneficiary of the shift to an auction draft system, and this will\r\n    reduce the amount of moves he makes. But I could also see him making 10+\r\n    trades this year. Depends on how active Nooni is with firesaling his team.\r\n</p>\r\n<p>\r\n    <strong>Will the league see a trade before the season starts?</strong>\r\n</p>\r\n<p>\r\n    Yes. While it won’t be JL moving Chase or MW acquiring a QB, there has been\r\n    too much chatter among too many teams for something to not happen. People\r\n    are buzzing for the season to get underway, and while that still remains\r\n    days away, someone will be willing to sacrifice a little for the sake of\r\n    making a move. With that said, bang my line.\r\n</p>\r\n<p>\r\n    <strong>How confident are you in your 2TE set?</strong>\r\n</p>\r\n<p>\r\n    I would feel more confident if my two tight ends were Kelce and Andrews,\r\n    but I am personally very excited to see how it goes. Week one for me is\r\n    very much an experiment with a different looking roster than I am used to.\r\n    I love my team as a collection of high-upside question marks, and things\r\n    should begin to clear up in this first week. There is a chance I do not end\r\n    up starting both of them this week, but given that they play each other and\r\n    it involves the Lions game, it seems too good to pass up. I know NN is not\r\n    ready to defend it either!\r\n</p>\r\n<p>\r\n    <strong>\r\n        In what state will each league member reside at the age of 40?\r\n    </strong>\r\n</p>\r\n<p>\r\n    The whole league is moving back to Michigan, no questions asked. Aross\r\n    working for the Tigers. The rest of us work for SANA Detroit, with NN as\r\n    our lawyer on retainer and Bank as our doctor to make sure everything is\r\n    functioning as it should be. Every weekend we will attend Brad’s tennis\r\n    tournaments and JL’s poker tournaments. See you boys there.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Updated League Marriage Odds?</strong>\r\n</p>\r\n<p>\r\n    MW -240\r\n</p>\r\n<p>\r\n    Levine +140\r\n</p>\r\n<p>\r\n    Nooni +180\r\n</p>\r\n<p>\r\n    Bank +220\r\n</p>\r\n<p>\r\n    NN +300\r\n</p>\r\n<p>\r\n    Jart +400\r\n</p>\r\n<p>\r\n    Garrett +600\r\n</p>\r\n<p>\r\n    Aross +650\r\n</p>\r\n<p>\r\n    Dmichs +700\r\n</p>\r\n<p>\r\n    Jason +750\r\n</p>\r\n<p>\r\n    JL +800\r\n</p>\r\n<p>\r\n    Brad +900\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        If everyone in the league ran a marathon, what order would everyone\r\n        finish?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Brad\r\n    </li>\r\n    <li>\r\n        Aross\r\n    </li>\r\n    <li>\r\n        Merrill\r\n    </li>\r\n    <li>\r\n        Nooni\r\n    </li>\r\n    <li>\r\n        Levine\r\n    </li>\r\n    <li>\r\n        Garrett\r\n    </li>\r\n    <li>\r\n        JL\r\n    </li>\r\n    <li>\r\n        Dmichs\r\n    </li>\r\n    <li>\r\n        NN\r\n    </li>\r\n    <li>\r\n        Jason\r\n    </li>\r\n    <li>\r\n        Bank\r\n    </li>\r\n    <li>\r\n        Jart\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Updated league swol rankings? </strong>\r\n</p>\r\n<p>\r\n    I am not the man to ask for these rankings, I just put my head down and\r\n    grind while you all sleep. I also haven’t seen any of you in years. Folbe\r\n    is 1 though.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        What time do you think each league member wakes up in the morning on\r\n        average?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I literally have no idea, so these are complete guesses:\r\n</p>\r\n<p>\r\n    Folbe: 7:00 AM\r\n</p>\r\n<p>\r\n    NN: 7:30 AM\r\n</p>\r\n<p>\r\n    Jart: 8:34 AM\r\n</p>\r\n<p>\r\n    Levine: 8:00 AM\r\n</p>\r\n<p>\r\n    Bank: 6:45 AM\r\n</p>\r\n<p>\r\n    Aross: 7:00 AM\r\n</p>\r\n<p>\r\n    Brad: 6 AM to send a text about how he is awake, then back to bed until\r\n    about 7:30 AM\r\n</p>\r\n<p>\r\n    Danny: 7:15 AM\r\n</p>\r\n<p>\r\n    Jason: 8:00 AM\r\n</p>\r\n<p>\r\n    Jonah: 8:01 AM\r\n</p>\r\n<p>\r\n    Dmichs: 7:45 AM\r\n</p>\r\n<p>\r\n    MW: Noon\r\n</p>\r\n<p>\r\n    <strong>\r\n        Who at Michigan Football social media decided that Cinema acoustic\r\n        cover would be a good choice for this?\r\n    </strong>\r\n</p>\r\n<p>\r\n    This is really enhanced if you are watching the video as well (Peep\r\n    @umichathletics on Instagram from August 27th), but whoever it was was a\r\n    genius. I wrote my answer to this question while listening to the full\r\n    acoustic version, and it hits different for sure. I can only assume it was\r\n    Benny Benassi himself.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Thoughts on aggressive early vs aggressive late draft strategies?\r\n    </strong>\r\n</p>\r\n<p>\r\n    In general, I am a fan of the aggressive late draft strategy, although upon\r\n    reflection it is definitely the better move in leagues with more than 5\r\n    bench spots, such as my dynasty league draft that I had last year where I\r\n    was able to obtain unparalleled depth for cheap. In reality, the best move\r\n    is probably aggressive in the middle, where you don’t blow a bag on the top\r\n    guys, but also are still getting some elite level talent for an appropriate\r\n    price. But I think the variety in strategies is what makes the auction so\r\n    fun.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Why did Folbe turn down your offer to collude when you both had a bunch\r\n        of money remaining?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I honestly have no idea. Seems like it would have greatly benefitted both\r\n    of us to get the guys we really wanted for even cheaper when no one else\r\n    had the money to bid on them. But I guess he wants to play with integrity\r\n    or something. Sounds like a recipe for missing the playoffs again this year\r\n    Folbe.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Who will NN trade with to make his terrible team a contender?\r\n    </strong>\r\n</p>\r\n<p>\r\n    It does not seem like it will be Nooni this year, and thus I like Levine to\r\n    be the choice here. Levine has expressed a desire to part ways with Najee,\r\n    and obviously he is a guy that NN is a big fan of following last season.\r\n    For the record, this writer does not think that NN’s team is terrible and\r\n    needs to make a move unlike last year, but I just answer the questions I am\r\n    asked.\r\n</p>\r\n<p>\r\n    <strong>Who has the worst QBs in the league?</strong>\r\n</p>\r\n<p>\r\n    I mean, it has to be MW, right? I would rather have most teams #3 QB than\r\n    either of MW’s starters, and as much as I love Mariota, he won’t even be\r\n    the starter soon. The Report is very low on MW this season because of his\r\n    rancid QB situation, and I don’t think anyone is going to be willing to\r\n    send one his direction.\r\n</p>\r\n<p>\r\n    <strong>\r\n        What’s better: Spending on QBs strategy or building a deep roster?\r\n    </strong>\r\n</p>\r\n<p>\r\n    This is one of the fascinating questions that we will learn more about this\r\n    year - Aross and I were chatting about this one at the conclusion of the\r\n    draft. I know that not everyone loves every single rule change that we made\r\n    this year, and defenses still need to go, but I think new scoring is going\r\n    to add a whole new layer of fun in learning what makes a good team. We had\r\n    gotten very stagnant in that regard in that a competitive team that had\r\n    healthy RBs just won it every year. I do not think that will be the case\r\n    anymore, and that excites me!\r\n</p>\r\n<p>\r\n    <strong>Who had the best draft strategy? The worst?</strong>\r\n</p>\r\n<p>\r\n    I moved this question down here because it is very related to the one\r\n    above. What is perhaps most fascinating to me is that I think it’s fair to\r\n    say that Aross and I at least have the reputation of being the two best\r\n    drafters, and we went very different directions, with Aross spending $92 on\r\n    his two main RBs, and me spending less than $40, while he spent $21 on his\r\n    QBs and I spent $72 (and there are multiple teams who far outspent me on\r\n    QBs, shoutout Bank $109). All this to say, it is hard to say before a\r\n    single game has been played who pursued the right path in constructing a\r\n    team! What we do know is that WR seems to remain at best the 3rd most\r\n    important position, behind QB and RBs with the move to a superflex system.\r\n    So for this reason, MW gets the worst draft strategy for spending $100 on\r\n    his 3 WRs, and leaving himself with a very bare cupboard at arguably the\r\n    most important position, QB.\r\n</p>\r\n<p>\r\n    As far as best strategy goes, it is also hard to know how people’s drafts\r\n    ended up looking in comparison to their plans going in. I do think not\r\n    blowing a large portion of your budget on a single player is a wise move\r\n    though, and JL did a good job of acquiring solid talent without breaking\r\n    the bank, never spending more than $33 on a player. And that’s the player\r\n    on his team that he hates the most! While I reiterate that Kamara was dumb\r\n    at how much of a steal he was, JL was able to acquire a wide variety of\r\n    starter talent, which will be helpful when injuries inevitably come to all\r\n    of our teams.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Can we add a mailbag question count to see how I'm stacking up against\r\n        everyone else? I'm off to a good start but wanna keep this lead\r\n        throughout the year. Yes this should count towards that total if it is\r\n        included.\r\n    </strong>\r\n</p>\r\n<p>\r\n    Yes, I will actually make that its own little tracking feature that you\r\n    will see below the mailbag segment beginning with the next one. The\r\n    tracking number will be how many questions actually end up making it into\r\n    the mailbag, sometimes I will cut a question if it is overly similar to\r\n    another (you both would get a point in that scenario though), and if I am\r\n    already answering it in a different segment (no point in that situation). I\r\n    will not include it yet, because I hope that this will encourage some\r\n    people who have been lackluster in their question asking to kick things\r\n    into gear! Be more like Jason guys!\r\n</p>\r\n<p>\r\n    <strong>Hey, where is my question, you didn’t answer it!</strong>\r\n</p>\r\n<p>\r\n    Many of you asked very similar questions, and the answers will be found in\r\n    the next section!\r\n</p>\r\n<h3>\r\n    Draft Superlatives\r\n</h3>\r\n<p>\r\n    <strong>Best Pick:</strong>\r\n    Antonio Gibson, $11, Team ACL Tear. As is often true with a JL managed\r\n    team, this one is more about luck, but Gibson is now firmly entrenched as\r\n    the RB1 who will get the bellcow share of 1st and 2nd down work. He’s still\r\n    Antonio Gibson, so he could do nothing and fumble 25 times, but for now, it\r\n    is looking like a steal at a premium position.\r\n</p>\r\n<p>\r\n    <strong>Honorable Mention:</strong>\r\n    Tyler Allgeier, $1, Team Immunized.\r\n</p>\r\n<p>\r\n    <strong>Worst Pick:</strong>\r\n    Cooper Kupp, $41, United Nations. At the end of the day I was between this\r\n    one and Justin Jefferson for $43. WRs have never been as valuable as other\r\n    positions, and that becomes even more true this season with the significant\r\n    increase in importance for the QB position with the adoption of the\r\n    superflex, and moderate increase for the TE position with the\r\n    implementation of full PPR. Jefferson feels like the safest one just\r\n    because he has firmly established himself in both of his first two years as\r\n    the dominant WR in the league, even if Kupp’s numbers were better. Both\r\n    could end as WR1 and WR2 in the league, but as someone who rostered Chase,\r\n    Adams, and Tyreek last year, I’m not sure it’s worth it.\r\n</p>\r\n<p>\r\n    <strong>Honorable Mention:</strong>\r\n    Justin Jefferson, $43, Team Levine.\r\n</p>\r\n<p>\r\n    <strong>Most Predictable Pick:</strong>\r\n    Dalvin Cook, $43, Two Cooks in the Kitchen. Dalvin Cook has lived his whole\r\n    career on the roster of Aross it seems, and this year is no different. It\r\n    has certainly been to various degrees of success, but he helps form a\r\n    high-risk, high-reward backfield for a team that is likely going to need\r\n    elite RB play to compete.\r\n</p>\r\n<p>\r\n    <strong>Honorable Mention:</strong>\r\n    Alexander Mattison, $3, Two Cooks in the Kitchen.\r\n</p>\r\n<p>\r\n    <strong>Can’t Leave Him Out Though:</strong>\r\n    Derrick Henry, $41, Team Horses.\r\n</p>\r\n<p>\r\n    <strong>Least Predictable Pick:</strong>\r\n    Joe Mixon, $33, Nooni. Tough to see Nooni spend so much money on a guy who\r\n    has a history of beating women. Hope they don’t hear about this in Texas.\r\n</p>\r\n<p>\r\n    <strong>Pick That Made Me Happiest:</strong>\r\n    Jalen Hurts, $41, Team Immunized. I love Jalen Hurts. I think he is a\r\n    surefire lock to be a top-3 QB in fantasy this year, and probably QB1. I\r\n    thought he would be $50+, so I took my value on Lance and Kyler early. But\r\n    if he had to go somewhere, I’m glad it was to Jason. We at The Family love\r\n    to see our players flourish in his system, and are excited to see how the\r\n    Hurts-AJB stack takes off this year.\r\n</p>\r\n<p>\r\n    <strong>Honorable Mention:</strong>\r\n    David Montgomery, Josh Jacobs, Brandin Cooks, Brandon Aiyuk, George\r\n    Pickens, Team Immunized. Lotta family over there these days.\r\n</p>\r\n<p>\r\n    <strong>Pick That Made Me Angriest:</strong>\r\n    Aaron Rodgers, $29, Team Immunized. With all of my family moving over to\r\n    Jason’s team this year, I hate seeing a guy who hates his family be on the\r\n    roster. I trust the management and coaching of Jason to mediate any\r\n    conflicts that will arise in that locker room, but it is a painful blip on\r\n    an otherwise beautifully crafted roster.\r\n</p>\r\n<p>\r\n    <strong>Honorable Mention:</strong>\r\n    Alvin Kamara, $28, Team ACL Tear. We let a top 5 RB go for pennies in\r\n    comparison to the other top guys. Let’s get our heads in the game next year\r\n    boys.\r\n</p>\r\n<p>\r\n    <strong>Most Fun Team to Watch:</strong>\r\n    I’m going with a likely unpopular pick here in United Nations. While I\r\n    don’t think this will be a very good team overall given the lack of QB\r\n    play, there are a number of exciting playmakers in Swift, Samuel, Hill,\r\n    Pitts, and Kupp that at least make this an enjoyable team to watch. I’m\r\n    pretty low on a number of those players this season, but they should still\r\n    be good for some nice highlights.\r\n</p>\r\n<p>\r\n    <strong>Most Boring Team to Watch:</strong>\r\n    This would be Expand the IR if not for the excitement that the Buffalo\r\n    triple stack offers, but we will instead go with Team Michaels. Brady and\r\n    Cousins are about as boring as it gets from the QB position, and Zeke,\r\n    Jeudy, and Patterson are more grind it out guys than big flashy plays.\r\n    Taylor and Adams offer potential excitement, but it does not quite compare\r\n    to other teams.\r\n</p>\r\n<p>\r\n    <strong>Best Team Name:</strong>\r\n    Team Immunized. There was not much competition here as few teams have\r\n    changed their names from last year, and Nooni’s is awful. But the Report\r\n    continues to support Jason in all of his endeavors, and it did make me\r\n    laugh.\r\n</p>\r\n<p>\r\n    <strong>Worst Team Name:</strong>\r\n    United Nations. I’ve never understood it, it’s never changed.\r\n</p>\r\n<p>\r\n    <strong>My Predicted Champion:</strong>\r\n    This happens often, and I remain biased. But if Jason’s team can stay\r\n    healthy (a big if), I think they’re the safest pick. Elite QB play with\r\n    top-tier talent and depth at the RB and WR positions position this team\r\n    well to sustain even an injury or two. The pick ups of rookies Allgeier and\r\n    Pickens potentially give the team elite depth come playoff time if the two\r\n    are able to maintain a roster spot throughout the season with only 5 bench\r\n    spots. AJB, Cooks, and BMW provide a nice trio, and hopefully the matchup\r\n    alone will allow Dmont or Jacobs to fill in alongside Aaron Jones. Pat is a\r\n    great TE, especially at only $3, and overall I think this team dominates\r\n    this season.\r\n</p>\r\n<h3>\r\n    Draft Grades &amp; Record Predictions\r\n</h3>\r\n<p>\r\n    A: Jason\r\n</p>\r\n<p>\r\n    A-: Folbe\r\n</p>\r\n<p>\r\n    B+: Aross, Brad, JL\r\n</p>\r\n<p>\r\n    B: Bank, NN, Jart\r\n</p>\r\n<p>\r\n    B-: Dmichs, MW, Levine\r\n</p>\r\n<p>\r\n    C+: Nooni\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Jason (14-0)\r\n    </li>\r\n    <li>\r\n        JL (9-5)\r\n    </li>\r\n    <li>\r\n        Aross (9-5)\r\n    </li>\r\n    <li>\r\n        Folbe (8-6)\r\n    </li>\r\n    <li>\r\n        Jart (8-6)\r\n    </li>\r\n    <li>\r\n        Bank (7-7)\r\n    </li>\r\n    <li>\r\n        Brad (7-7)\r\n    </li>\r\n    <li>\r\n        NN (6-8)\r\n    </li>\r\n    <li>\r\n        Dmichs (5-9)\r\n    </li>\r\n    <li>\r\n        Levine (4-10)\r\n    </li>\r\n    <li>\r\n        MW (4-10)\r\n    </li>\r\n    <li>\r\n        Nooni (3-11)\r\n    </li>\r\n</ol>\r\n<h3>\r\n    League Takes\r\n</h3>\r\n<p>\r\n    <strong>Agree:</strong>\r\n</p>\r\n<p>\r\n    -JL doesn't actually want to trade he just likes to talk trades bc it gets\r\n    the fantasy juices flowing\r\n</p>\r\n<p>\r\n    -This will be the most balanced league in awhile (besides 1-2 trash teams)\r\n</p>\r\n<p>\r\n    -Noah Nathan showers with socks on\r\n</p>\r\n<p>\r\n    -Jart has best fantasy take\r\n</p>\r\n<p>\r\n    <strong>Neutral:</strong>\r\n</p>\r\n<p>\r\n    -Levine Brad and Jart end up bottom 3\r\n</p>\r\n<p>\r\n    -Aross has a bottom 3 team\r\n</p>\r\n<p>\r\n    -Danny Banooni prefers butt stuff\r\n</p>\r\n<p>\r\n    -Levine has worst squad\r\n</p>\r\n<p>\r\n    -Noah has an opinion or response for everything which makes him top 2 most\r\n    annoying &amp; not 2\r\n</p>\r\n<p>\r\n    <strong>Disagree:</strong>\r\n</p>\r\n<p>\r\n    -Let’s root for cordy Patterson to *poop* the bed like the last 4 weeks of\r\n    last szn\r\n</p>\r\n<p>\r\n    -A team is going 0-14 this year\r\n</p>\r\n<p>\r\n    -Levine is a top 3 seed in his debut season. While the team looks rough\r\n    now, there's a lot of potential there. Najee is the 2022 fantasy MVP\r\n</p>\r\n<p>\r\n    -Mariota will finish a Top-15 QB\r\n</p>\r\n<h3>\r\n    Week One\r\n</h3>\r\n<p>\r\n    Football is upon us in a matter of days, and that means we are back with\r\n    our matchup breakdowns. While it is tough to know how staunch defenses will\r\n    be this season on any team, we will not let inaccuracies keep us from\r\n    preparing the report.\r\n</p>\r\n<p>\r\n    <strong><em>Expand the IR </em>vs. <em>United Nations</em>:</strong>\r\n    I love this matchup for its insight on what the best draft strategy is in\r\n    our current format, as these teams could not be more different. MW went all\r\n    in on WRs with a solid budget devoted to RBs, while Bank went all in on\r\n    QBs. Looking at MW’s team, I expect Javonte to have a big day since Denver\r\n    should be up big, but Mac, Mariota, Deebo, and Kupp should struggle to live\r\n    up to expectations. On the other side, Allen may not have a huge day\r\n    against a stout Rams defense, but Herbert should have a big day in a high\r\n    scoring game, while Dobbins and Renfrow should likewise excel. Bills-Rams\r\n    is a huge game for this matchup which makes this very fun and hopefully\r\n    brings life to the oft-dull TNF games. I could see this one going either\r\nway, but QB play is too important this year in a superflex system. We like    <em>Expand the IR by 10.2</em>.\r\n</p>\r\n<p>\r\n    Bank: “What can I say…. Two time champ. Loaded skill position roster with\r\n    probably the two worst starting qbs against the worst skill position roster\r\n    with the two best qbs. One strategy was right and one was wrong. It’ll be\r\n    close but Merrick will definitely win”\r\n</p>\r\n<p>\r\n    MW: “I’m focused on my team. Think we’re in a good position to win versus a\r\n    soft team”\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses vs. Team ACL Tear:</em></strong>\r\n    This is one of my favorite matchups from week one, because these teams are\r\n    built somewhat similarly, and thus have similar floors and ceilings. Dak\r\n    and Derek Carr should perform similarly this year, although I am higher on\r\n    Carr with the plethora of weapons surrounding him. Kamara and Henry provide\r\n    likely very similar production in very different ways, but should close to\r\n    push this week. Antonio Gibson and Miles Sanders are two wild RBs who are\r\n    insanely difficult to predict, while Ja’Marr and Ceedee both provide elite\r\n    upside at the WR1 position. Mike Evans and DJ Moore are consistently slept\r\n    on at the WR2 spot, and Keenan and Terry make for great FLEX options.\r\n    Almost every positional matchup pushes here, but with Stafford having weird\r\n    injury news against a good defense and the advantage of Kittle over Irv\r\nSmith Jr gives the nod to Folbe. Given this, we like    <em>Team Horses by 6.4</em>.\r\n</p>\r\n<p>\r\n    Folbe: “GL JL”\r\n</p>\r\n<p>\r\n    JL: “Scary to face Folbe with a loaded Horse. Fortunately his WRs and QBs\r\n    are less than ideal so I like my side in Week 1”\r\n</p>\r\n<p>\r\n    <strong><em>Team Michaels vs Nooni:</em></strong>\r\n    QBs? Easily Dmichs. RBs? Likely a push, depending on the play of Ezekiel\r\n    Elliott and how much work Kareem Hunt gets in the midst of his publicized\r\n    unhappiness in Cleveland. WR is a slight edge to Dmichs, while TE is a\r\n    clear win for Nooni. Overall, like many other matchups this season, the\r\nstronger QB play should be the difference maker. We like    <em>Team Michaels by 12.4</em>.\r\n</p>\r\n<p>\r\n    Dmichs: The acoustic version of Cinema is my favorite song\r\n</p>\r\n<p>\r\n    Nooni: “Always exciting playing DMikes. Great guy to DM (no pun intended)\r\n    and shoot the shit ab the matchup. I’ll make sure to message him come game\r\n    day. A tad worried ab waddle given injury and his QB, but I’m very excited\r\n    ab Mixon Ekeler Kelce”\r\n</p>\r\n<p>\r\n    <strong><em>Team Immunized vs Alyssa Robinson:</em></strong>\r\n    I mean, Brad’s team is solid. He has fantastic QB play, some solid RBs,\r\n    questionable WRs but positive upside, and a good TE. It’s a team that\r\n    should compete in every game this season. But unfortunately for him, he is\r\n    playing Jason. And we at the Jart Report DO NOT PICK JASON TO LOSE. Jalen\r\n    Hurts? QB1 this season. Aaron Jones? WR1 this season. AJB and BMW bring\r\n    incredible upside, while Jacobs and RIP have close to unrivaled usage and\r\nconfirmed bellcow status. Good try Brad, but we like    <em>Team Immunized by 23.4.</em>\r\n</p>\r\n<p>\r\n    Jase: “Should be an interesting one. Who knows what Brads team looks like\r\n    if i don't give him my auction value sheet. It was fun to be in person and\r\n    draft with him. NN and I knew when he was interested in a player by him\r\n    adjusting his posture to ensure he was locked in on the bid. We also had\r\n    our eyes on a lot of similar guys, who knows what Team manstone could have\r\n    been. Even more excited that I get to play him twice this year!”\r\n</p>\r\n<p>\r\n    Brad: “Always thankful that the league lets either Jason or I start the\r\n    year 1-0. It sucks to play him before all his guys get hurt but I’m feeling\r\n    good that I’ll win my first week 1 game since 2019”\r\n</p>\r\n<p>\r\n    <strong><em>Team Levine vs Two Cooks in the Kitchen: </em></strong>\r\n    As someone who placed a high level of importance on the quarterback\r\n    position, it pains me to see these two teams collectively trot out Tua,\r\n    Goff, Fields, and Baker. The RB position is clearly a benefit to Aross with\r\n    McCaffrey and Cook having the potential to finish as the top 2 RBs in\r\n    fantasy football this season. WR room is a bit of an advantage to Levine\r\n    behind JJeffs expected monster season, but don’t sleep on Juju this season\r\n    filling a big role vacated by Tyreek’s departure. The Report expects Mark\r\n    Andrews to finish as TE1 this year by a considerable margin, and given his\r\n    expected outplaying of Dalton Schultz combined with slightly better QB\r\n    play, we like Team Levine to pick up his first win in the league right\r\n    away. We like <em>Team Levine by 4.5.</em>\r\n</p>\r\n<p>\r\n    Levine: I am new to this league\r\n</p>\r\n<p>\r\n    Aross: “Baker mayfield ‘I’m gonna *frick* them up’”\r\n</p>\r\n<p>\r\n    <strong><em>The Report vs Step Burrow I’m Stuck:</em></strong>\r\n    This is my favorite matchup of the week, not only because it is my own, but\r\n    because it contains so many players that are unknowns for this season. On\r\n    NN’s side, how much work will Burrow get with a revamped O-Line and\r\n    expected increased running game? How will the split between Etienne and\r\n    JRob play out? Will 300 pound 4NET’s work be reduced as rumored? Will\r\n    Saquon be healthy this year, and be able to produce in a rough Giants\r\n    offense? Can Tee find great production without being the top wideout? How\r\n    will Michael Pittman function as top dog and a new QB? How will Ertz\r\n    perform with a highly drafted rookie TE now in the room? For Jart, how will\r\n    Trey Lance perform with Jimmy G still around? Can Nick Chubb and DK produce\r\n    without QBs? Will CEH finally put it together in the league? Is Lazard\r\n    ready to be WR1? Can a 2TE stack without Kelce or Andrews be effective? So\r\n    many questions, and I am excited to start to get some answers this week. We\r\nfeel safer with NN’s team and this point, and thus like    <em>Step Burrow I’m Stuck by 12.4.</em>\r\n</p>\r\n<p>\r\n    NN: “Excited to get the season started, sorry to my opponent that you got\r\n    matched with the best team in the league”\r\n</p>\r\n<p>\r\n    Jart: “I am very excited for the season to be back, and to get to play a\r\n    guy like NN. I know the DMs will be buzzing throughout the weekend, ready\r\n    to see how the teams perform in what should be a very fun season! Sorry to\r\n    me that I got matched with the best team in the league!”\r\n</p>\r\n<h3>\r\n    JL Post-Draft Roster Power Rankings\r\n</h3>\r\n<p>\r\n    1. Jason\r\n</p>\r\n<p>\r\n    2. Jonah\r\n</p>\r\n<p>\r\n    3. Folbe\r\n</p>\r\n<p>\r\n    4. Bank\r\n</p>\r\n<p>\r\n    5. Brad\r\n</p>\r\n<p>\r\n    6. DMikes\r\n</p>\r\n<p>\r\n    7. Jarrett\r\n</p>\r\n<p>\r\n    8. Alex\r\n</p>\r\n<p>\r\n    9. NN\r\n</p>\r\n<p>\r\n    10. Max\r\n</p>\r\n<p>\r\n    11. Banooni\r\n</p>\r\n<p>\r\n    12. Merrick\r\n</p>\r\n<p>\r\n    These are awful, but we include them to support other league content\r\n    creators.\r\n</p>"}