{"title": "Griddy Gangin'", "season": 2021, "week": "2", "report": "<p>\r\n    Welcome back to the Jart Report after a week two full of sweating and some\r\n    interesting matchups in terms of PF distribution! Following an unexpectedly\r\n    close matchup ourselves, we at the Jart Report are excited to dig deep into\r\n    what was a unique week of matchups for the league.\r\n</p>\r\n<h3>\r\n    <strong>Week Two Recap</strong>\r\n</h3>\r\n<p>\r\n    To start, we are going to be looking back at how week two unfolded versus\r\n    the predictions that the Jart Team put together. The team strives to learn\r\n    from previous weeks to make the most informed predictions, but this early\r\n    in the season still expects to be quite inaccurate (besides for Aross vs\r\n    Folbe). On a week when the top 6 teams in points for all played each other\r\n    in 3 matchups, there will certainly be some deviation created between Roto\r\n    and current H2H records. We will go matchup by matchup and look at what we\r\n    learned as the season begins to take shape.\r\n</p>\r\n<p>\r\n    <em><strong>Team Horses vs Team Ross:</strong></em>\r\n</p>\r\n<p>\r\n    Prediction: Team Ross by 13\r\n</p>\r\n<p>\r\n    Reality: Team Ross by 11.2\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        Folbe comes into this one reeling against a solid squad for Aross.\r\n        There is still so much uncertainty for both of these terms as to what\r\n        their floors and ceilings are this season. Team Horses certainly should\r\n        see a big bounce back after a limp first week, but the loss of Jerry\r\n        Jeudy is noteworthy. DK Metcalf vs AJ Brown will be a fun matchup to\r\n        watch as the Ole Miss stars square off against each other in both\r\n        fantasy and real life. Ultimately, the Jart Report expects Lamar to\r\n        have a massive outing against Kansas City in what should be a very high\r\n        scoring game, and coupled with a better showing from Dalvin Cook, Aross\r\n        continues his winning ways.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: The loss of Jerry Jeudy was certainly felt this week for\r\n    Horses, as Jaylen Waddle struggled to fill the hole in the FLEX. The elite\r\n    play of LockettE has come at the cost of DK Metcalf so far, and Ezekiel\r\n    Elliott’s role is certainly being challenged currently by Tony Pollard\r\n    despite the solid performance from Zeke. Josh Allen also is struggling to\r\n    live up to the expectations set for him this year following a memorable\r\n    campaign last season. While we expect this team to improve moving forward,\r\n    this was certainly a concerning effort across the board, and one that has\r\n    Folbe near the bottom of power rankings across the nation. For Team Ross,\r\n    Lamar Jackson lived up to his billing against Kansas City, and Dalvin Cook\r\n    found a lot more success on the ground, although he was unable to find\r\n    paydirt. While the bench was not anything to write home about, we expect\r\n    better performances by AB and AJB moving forward, and for Keenan to find\r\n    the endzone in a future week. Team Ross continues to look good, still\r\n    managing to get a win even on an off week.\r\n</p>\r\n<p>\r\n    <em><strong>Team NN vs Team Dmichs:</strong></em>\r\n</p>\r\n<p>\r\n    Prediction: Team Dmichs by 7\r\n</p>\r\n<p>\r\n    Reality: Team NN by 2.3\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        A lot of people are saying NN should probably just not even show up\r\n        this week. They’re right, Dmichs by a million. While the Dak-Amari\r\n        connection will likely produce closer to 40 points than 60 this week\r\n        and Dmichs TD luck comes back down to earth, there is still more to\r\n        like about this team at this stage. Until Najee gets it going the\r\n        question marks remain, and can Mixon maintain production? Until we see\r\n        it, we’re taking Dmichs by 7.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: Well, we at the Jart Report want to take a second to\r\n    acknowledge that we were wrong. NN did not show up this week, but neither\r\n    did Dmichs. The Dak-Amari connection brought just 11.38 points this week as\r\n    opposed to 60 last week, as Dmichs got back to his inconsistent ways in\r\n    fantasy football. A massive outing from Cooper Kupp was enough to push NN\r\n    to victory in a matchup that left fans everywhere disappointed. Encouraging\r\n    signs from Najee Harris in the receiving front offset the disappointment\r\n    that CEH has been so far this year. Expect to see MJJ and Sterling Shepherd\r\n    take the field for NN next week in place of Meyers and CEH. For Dmichs,\r\n    it’s back to the drawing board, as Travis Kelce was the only player to have\r\n    scored in double digits both weeks besides bench stud Hollywood Brown. We\r\n    at the Jart Report hope this moves him away from a 2 TE set, but we’ll see.\r\n</p>\r\n<p>\r\n    <em><strong>praying every sunday vs brad silverman:</strong></em>\r\n</p>\r\n<p>\r\n    Prediction: brad silverman by 23\r\n</p>\r\n<p>\r\n    Reality: praying every sunday by 10.3\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        In the matchup of teams that don’t know how to use capital letters,\r\n        there just seems to be too much pointing towards Brad picking up a much\r\n        needed win. Mahomes in a Sunday night shootout, Adams coming back from\r\n        a rough Week One to face Detroit’s already banged up secondary on MNF,\r\n        and other key contributors with encouraging matchups should provide a\r\n        solid performance from a team that left points on the bench last week.\r\n        With LockettE due for some down weeks, we like brad silverman by 23.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: Once again, the Jart Report wishes to make an apology to\r\n    Daniel Banooni for the lack of faith the Report has in his team’s ability\r\n    to win games. This is a different Tyler LockettE we are seeing this year\r\n    compared to his boom or bust ways last year, as he backed up his opening\r\n    explosion with another this week. While Mahomes and Adams performed well\r\n    for Brad, discouraging efforts from Gibson, Hunt, and Kittle left the team\r\n    without enough fire power to match the performances of LockettE and Evans.\r\n    On a week where it had to have been tough to watch #3 overall pick Alvin\r\n    Kamara score 5 points while #4 overall Derrick Henry scored 44.7, Nooni\r\n    still picks up his first win as he leans of big performances from the WR\r\n    corps. Major concerns still surround this team at the RB and TE positions,\r\n    along with a QB whose ceiling is not massive. But for now, a win is a win.\r\n</p>\r\n<p>\r\n    <em><strong>Team ACL Tear vs I Got a Half Chubb:</strong></em>\r\n</p>\r\n<p>\r\n    Prediction: I Got a Half Chubb by 14\r\n</p>\r\n<p>\r\n    Reality: Team ACL ear by 8.3\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        In our matchup of the week, these two teams both had the potential to\r\n        put up massive week one scores, and both picked up key wins to kick off\r\n        their seasons. Optimism is certainly higher around CJ than Jonah, with\r\n        serious RB2 questions and lingering concerns about the consistency of\r\n        the TE position (Gronk is so slow). It is no secret the Jart Report is\r\n        quite anxious about Kyler Murray’s production this year, and\r\n        Minnesota’s retooled secondary should prove a tougher matchup than the\r\n        clown show in Tennessee. An elite performance from Rodgers is\r\n        guaranteed against the Lions, and thus we like I Got a Half Chubb to\r\n        win by 14.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: In what lived up to its billing as the game of the week, both\r\n    teams put forth great efforts, all the way from the starters to the bench.\r\n    Kyler continues to prove the haters at the Jart Report wrong with a 400\r\n    yard passing day (the emergence of Rondale Moore is certainly one to\r\n    watch), and another rushing TD despite a noticeable decrease in attempts.\r\n    At least for this week, questions cannot be asked about JL’s RB2 position,\r\n    as 5 RBs on his team put up at least 9.6. Top down, this team is looking\r\n    quite dangerous at this point, although the Jart Report does have questions\r\n    about the sustainability of some players’ performances. For CJ, this was a\r\n    disappointing loss on a day when his team performed well. Aaron Rodgers\r\n    made things interesting at the end as he carved up the Lions secondary, but\r\n    there was not enough explosion from Dmont, Dhop, and Thielen to put him\r\n    over the top in this one. We are not concerned about his ability to win\r\n    ball games moving forward though.\r\n</p>\r\n<p>\r\n    <em><strong>GRIDDY GANG vs Tompa Bay: </strong></em>\r\n</p>\r\n<p>\r\n    Prediction: GRIDDY GANG by 4\r\n</p>\r\n<p>\r\n    Reality: GRIDDY GANG by 16.68\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        One of these owners loves his team, the other is already blaming ESPN\r\n        for tricking him into their 2nd round pick. While Aaron Jones and\r\n        Calvin Ridley should produce better numbers this week, the Jart Report\r\n        is certainly not sold on this team. With better days expected from\r\n        Horse, JJeffs, Scary Terry, and Bobby Onions, GRIDDY GANG should roll\r\n        as the nation starts to pay closer attention to what Jason has going\r\n        on. We like GRIDDY GANG by 4.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: Well. What a matchup. While this one was never in doubt, an\r\n    explosive performance from Arwin Jones on MNF elevated Bank’s Roto\r\n    standings moving forward. Calvin Ridley had a better day (and outscored\r\n    Dhop), and Tom Brady tore apart the Falcons defense. Devonta Smith\r\n    certainly was a let down in what was an uneven performance from the Eagles\r\n    offense (no one is more aware of the Eagles offense than the Jart Report),\r\n    but Julio certainly put forth an encouraging effort. For GRIDDY GANG, it’s\r\n    all smiles as top to bottom this starting lineup came to play. Led by King\r\n    Horse himself, it is tough to find a weakness with this team right now. The\r\n    injury to Darrell Henderson is certainly one to keep a close eye on, as\r\n    GRIDDY GANG lacks RB depth, and Sony Michel may be able to carve out a\r\n    bigger role moving forward. But for now, it’s all celebration for league\r\n    favorite Jason Silverstone.\r\n</p>\r\n<p>\r\n    <em><strong>United Nations vs Real Brothers: </strong></em>\r\n</p>\r\n<p>\r\n    Prediction: Real Brothers by 12\r\n</p>\r\n<p>\r\n    Reality: Real Brothers by 2.08\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        It’s hard to pick against the defending champ. But this week, we will\r\n        be doing just that. While Caff is a lock to score 30+ any time he plays\r\n        Jart, a better chosen lineup for Jart shows the kind of firepower he\r\n        can bring this season. While Saquon won’t be seeing the lineup for a\r\n        while, if Jamarr Chase can indeed catch footballs, there is a lot of\r\n        potential for this team. We like Jalen Hurts to outscore Justin Herbert\r\n        once again this week, and for Swift to once again clean up in pass\r\n        catching duties with the Lions trailing. Vulnerable secondaries in\r\n        Baltimore, Cleveland, and Tampa Bay should spell good things for\r\n        Tyreek, Cooks, and Pitts. The play of James Robinson and Javonte\r\n        Williams will certainly be worth watching for these young backs, but\r\n        based off Week one, Jart seems primed for the dub.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: Going into Sunday night, the Jart Report expectedly to roll\r\n    easily after only trailing MW by 12.12 with Tyreek Hill and D’Andre Swift\r\n    still to play. But that’s why they play the game, because going into the\r\n    Lions last drive, the Jart Report was expecting a loss. A key incompletion\r\n    from Aaron Rodgers with 3:20 left gave D’Andre Swift the chance to catch 3\r\n    passes and secure the much needed win for Jart. This was the kind of win\r\n    Jart couldn’t get last year, and one the team will certainly look to build\r\n    off. While the Eagles put forth a disappointing offensive showing, Hurts\r\n    continued to show his value with his legs, as he now has 144 yards rushing\r\n    and a TD through 2 weeks. Brandin Cooks and Jamarr Chase continue to make\r\n    Jart happy, and a major bounceback is certainly expected for Freaky\r\n    Tyreeky. Kyle Pitts continues to show promising signs of a blossoming TE\r\n    for a team that will look to return to their Week One ways against Folbe.\r\n    For MW, a disappointing performance from Justin Herbert offset the solid\r\n    player from Carolina stars Caff and DJ Moore (The Jart Report loved seeing\r\n    two sons combine for over 40 points). James Robinson continues to put forth\r\n    mid-tier RB2 numbers in a rough Jacksonville offense, while Javonte\r\n    Williams continues to work towards grabbing a bigger role from Melvin\r\n    Gordon. This team will get better, but may see some inconsistency\r\n    throughout.\r\n</p>\r\n<h3>\r\n    <strong>Yards to TD Ratio</strong>\r\n</h3>\r\n<p>\r\n    Our new statistic, <strong>Yards to TD ratio, </strong>is back. We will be\r\n    looking at the 2 RB, 2 WR, 1 TE, and FLEX position only (ignoring QBs), and\r\n    will be calculated by taking total yards and dividing by touchdowns scored.\r\n</p>\r\n<p>\r\n    <strong>United Nations: </strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 551 yards / 1 TD = 551 (1st)</em>\r\n</p>\r\n<p>\r\n    This Week: 486 yards / 2 TD = <strong>243 (3rd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Real Brothers: </strong>\r\n</p>\r\n<p>\r\n    <em> Last Week: 528 yards / 1 TD = 528 (2nd)</em>\r\n</p>\r\n<p>\r\n    This Week: 371 yards / 2 TD = <strong>185.5 (4th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Ross: </strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 514 yards / 3 TDs = 171.33 (6th)</em>\r\n</p>\r\n<p>\r\n    This Week: 395 yards / 1 TD = <strong>395 (2nd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Horses: </strong>\r\n</p>\r\n<p>\r\n    <em> Last Week: 376 yards / 3 TDs = 125.33 (9th)</em>\r\n</p>\r\n<p>\r\n    This Week: 334 yards / 4 TDs = <strong>83.5 (9th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team NN: </strong>\r\n</p>\r\n<p>\r\n    <em> Last Week: 427 yards / 2 TDs = 213.5 (4th)</em>\r\n</p>\r\n<p>\r\n    This Week: 422 yards / 3 TDs = <strong>140.67 (7th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Dmichs: </strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 542 yards / 9 TDs = 60.22 (11th)</em>\r\n</p>\r\n<p>\r\n    This Week: 345 yards / 3 TDs = <strong>115 (8th)</strong>\r\n</p>\r\n<p>\r\n    <strong>praying every sunday: </strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 270 yards / 2 TDs = 135 (8th)</em>\r\n</p>\r\n<p>\r\n    This Week: 399 yards / 5 TDs = <strong>79.8 (10th)</strong>\r\n</p>\r\n<p>\r\n    <strong>brad silverman: </strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 371 yards / 1 TD = 371 (3rd)</em>\r\n</p>\r\n<p>\r\n    This Week: 408 yards / 1 TD = <strong>408 (1st)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team ACL Tear: </strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 428 yards / 5 TDs = 85.6 (10th)</em>\r\n</p>\r\n<p>\r\n    This Week: 502 yards / 3 TDs = <strong>167.33 (5th)</strong>\r\n</p>\r\n<p>\r\n    <strong>I Got a Half Chubb:</strong>\r\n</p>\r\n<p>\r\n    <em>Last Week: 450 yards / 8 TDs = 56.25 (12th)</em>\r\n</p>\r\n<p>\r\n    This Week: 432 yards / 3 TDs = <strong>144 (6th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Tompa Bay: </strong>\r\n</p>\r\n<p>\r\n    <em> Last Week: 339 yards / 2 TDs = 169.5 (7th)</em>\r\n</p>\r\n<p>\r\n    This Week: 405 yards / 6 TDs = <strong>67.5 (12th)</strong>\r\n</p>\r\n<p>\r\n    <strong>GRIDDY GANG: </strong>\r\n</p>\r\n<p>\r\n    <em> Last Week: 410 yards / 2 TDs = 205 (5th)</em>\r\n</p>\r\n<p>\r\n    This Week: 605 yards / 8 TDs = <strong>75.63 (11th)</strong>\r\n</p>\r\n<p>\r\n    Overall, the ratios were much lower this week. Not surprising to see MB and\r\n    Jase as the lowest two ratios, given how many points each scored and the\r\n    need for TDs to do so. MW and Brad so far have been the unluckiest in this\r\n    department, with Aross and Jart close behind. Something to watch moving\r\n    forward!\r\n</p>\r\n<h3>\r\n    <strong>Lineup Efficiency</strong>\r\n</h3>\r\n<ol>\r\n    <li>\r\n        <p>\r\n            Jason (163.32) → <strong>100%</strong> (Last week 96.10%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            JL (159.3) → <strong>83.4%</strong> (Last week: 84.15%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Bank (159.84) → <strong>91.7%</strong> (Last week 84.50%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            CJ (140.6) → <strong>88.5%</strong> (Last week 81.95%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Brad (115.82) → <strong>85.8%</strong> (Last week 78.27%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            praying every sunday (110.92) → <strong>98.8%</strong> (Last week\r\n            86.19%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            NN (108.78) → <strong>76.6%</strong> (Last week 73.09%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Aross (101.36) → <strong>94.4%</strong> (Last week 98.80%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Jart (100.5) → <strong>94.9%</strong> (Last week 78.52%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Dmichs (97.88) → <strong>82.7%</strong> (Last week: 99.37%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            MW (93.32) → <strong>100%</strong> (Last week 82.86%)\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Folbe (88.36) → <strong>95.7%</strong> (Last week 92.14%)\r\n        </p>\r\n    </li>\r\n</ol>\r\n<p>\r\n    For the second straight week, Folbe had the lowest amount for most points\r\n    possible, which is not a great sign for this team that is in need of a win.\r\n    Jason and MW both played their best possible lineups, but those lineups\r\n    looked very different in terms of points scored. NN continues to struggle\r\n    to play his best lineup, something that seems to surprise no one in this\r\n    league. Overall, I expect the % to continue to rise as managers learn more\r\n    about who on their teams will be performers this year and who will\r\n    struggle. Except NN. He will always struggle to play a good lineup.\r\n</p>\r\n<h3>\r\n    <strong>New Segment: Transaction Analysis</strong>\r\n</h3>\r\n<p>\r\n    Each week we’ll be incorporating a new segment, and this week it will be\r\n    transaction analysis. In this segment we will look at the transactions from\r\n    this week and rate the best and worst one in the opinion of the Jart\r\n    Report.\r\n</p>\r\n<p>\r\n    <strong>Best Transaction: </strong>\r\n    Merrick Bank, Kenneth Gainwell, $4. A solid RB who was flipped for JD\r\n    McKissic and only $9 turns out to be a fantastic move. A RB you can feel\r\n    confident starting most weeks for only $13 is a steal. Honorable mention:\r\n    NN, Stealing Shepherd, $2.\r\n</p>\r\n<p>\r\n    <strong>Worst Transaction:</strong>\r\n    Brad Silverman, Elijah Mitchell, $99. 6.3 points with an injury to go with\r\n    it is certainly not worth the full FAAB for the season. Already treating JD\r\n    McKissic like a fake brother and trading him away certainly does not make\r\n    the situation look any better.\r\n</p>\r\n<h3>\r\n    <strong>Power Rankings</strong>\r\n</h3>\r\n<ol>\r\n    <li>\r\n        <p>\r\n            JL\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Jason\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            CJ\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Bank\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Aross\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Jart\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Dmichs\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Brad\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Nooni\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            MW\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            NN\r\n        </p>\r\n    </li>\r\n    <li>\r\n        <p>\r\n            Folbe\r\n        </p>\r\n    </li>\r\n</ol>\r\n<p>\r\n    No debating.\r\n</p>\r\n<h3>\r\n    <strong>On To Week Three!</strong>\r\n</h3>\r\n<p>\r\n    It is now time to preview this week’s matchups!\r\n</p>\r\n<p>\r\n    <em><strong>Team Ross vs Team Dmichs: </strong></em>\r\n    Coming off a low scoring Week Two for both teams, some favorable matchups\r\n    suggest a higher scoring affair this week. Lamar Jackson facing off against\r\n    Detroit certainly suggests good things, but Hollywood Brown on the other\r\n    side of this matchup could offset many of those points. Dalvin Cook faces\r\n    off against a Seattle defense that was absolutely obliterated by Derrick\r\n    Henry, suggesting a big day for Cook. While Mike Davis seems to be\r\n    struggling to hold off Cordarelle Patterson from touches, AJB should bounce\r\n    back along with Keenan Allen finding the endzone. Dmichs performance will\r\n    likely hinge upon the Dak-Amari connection, which will certainly be a fun\r\n    one to watch on Monday night. The Eagles just came off a low scoring game\r\n    against the 49ers, but there was yards to be had. We expect a solid game\r\nfrom Dallas, but not enough to close the deficit for Dmichs.    <em>Team Ross by 8.4.</em>\r\n</p>\r\n<p>\r\n    <em><strong>brad silverman vs N N: </strong></em>\r\n    Brad comes into this one in deep need of a win, while NN just picked up his\r\n    first win despite only scoring 83 points. While Gibson and Hunt have been\r\n    inconsistent at best so far this season, we expect the Sunday night matchup\r\n    of Green Bay and San Francisco to be a high scoring one, suggesting good\r\n    things for Davante Adams and George Kittle. Mike Williams should also get\r\n    plenty of work against the Chiefs as one would expect the Chargers to be\r\n    trailing early and often. Tannehill and Mixon both have tough defenses this\r\n    week, while CEH continues to exhibit early season struggles. If Najee and\r\n    Kupp can repeat similar performances to last week NN will be right there in\r\n    this one, but as of right now that feels too unlikely to count on to that\r\n    degree. <em>Brad gets his first win by 12.2</em>.\r\n</p>\r\n<p>\r\n    <em><strong>I Got A Half Chubb vs United Nations: </strong></em>\r\n    A fun matchup for this week, two 1-1 teams with different stories so far\r\n    this year face off. CJ has outscored MW by 46 points through 2 weeks, but\r\n    tougher matchups for CJ leave these clubs both at .500. While CJ has been\r\n    the better team this year, MW comes into this one with some extremely\r\n    enticing matchups. Herbert against Kansas City, Caff against Houston, and\r\n    Javonte Williams against the Jets could provide a lot of points for a team\r\n    that has struggled to find them this year. Look for Herbert to get back on\r\n    track in a shootout, Caff to translate his absurd touch amount into 2-3 TDs\r\n    this week, and Javonte to begin to take over the backfield in Denver. The\r\n    health of Diontae Johnson is a lingering question mark for CJ this week,\r\n    and there are some tough matchups this week for a team that has found\r\nsuccess early. While we expect CJ to have the better season, we have    <em>MW by 14.2 this week.</em>\r\n</p>\r\n<p>\r\n    <em><strong>Tompa Bay vs praying every sunday: </strong></em>\r\n    At this point in the season, we are not sure what to make of these two\r\n    clubs. Bank exploded for 146 in the loss this last week, while Nooni\r\n    bounced back with a much needed win. While Kamara should be greatly\r\n    improved this week after being a non-factor against Carolina, Tyler Lockett\r\n    likely will concede yards and touches to DK Metcalf this week, while Mike\r\n    Evans will likely draw Jalen Ramsey this week. In what we expect to be a\r\n    rather low scoring game, it is the play of Robert Woods and Calvin Ridley\r\n    that gets <em>Bank the victory this week by 7.6.</em>\r\n</p>\r\n<p>\r\n    <em><strong>GRIDDY GANG vs Team ACL Tear: </strong></em>\r\n    The undisputed two best teams so far this season, we are treated to an\r\n    exciting early season matchup that should bring the points. There is a lot\r\n    to like on both sides of this matchup, with Russell Wilson and Kyler Murray\r\n    both drawing favorable matchups. The difference in this matchup this week\r\n    ends up being at the RB spot, which brings a bit of a surprise this week.\r\n    After King Henry’s explosion last week, look for a talented Colts defense\r\n    to hone in on stopping the run, forcing Tannehill to throw and AJB to step\r\n    up his play. Darrell Henderson’s injury lingers, and extremely favorable\r\n    matchups for the pass catching Ekeler against the Chiefs and Ty’Son\r\n    Williams against the Lions should bring good production for Lopey,\r\n    depending on how Baltimore cycles the RBs. The WRs will be fun to watch in\r\n    this one, but should end up near a wash. In the highest scoring matchup of\r\n    this week, we like <em>Team ACL Tear to win by 3.7</em>.\r\n</p>\r\n<p>\r\n    <em><strong>Real Brothers vs Team Horses: </strong></em>\r\n    A team that almost collapsed last week versus a team that has struggled\r\n    mightily to get off the ground this year could provide us with our most\r\n    surprising matchup of the week. While stars like Josh Allen and DK Metcalf\r\n    has yet to perform as expected for Folbe, expect them to get going this\r\n    week. DK saw 11 targets last week, and an extremely favorable matchup\r\n    against Minnesota should spell a ginormous day (30+ points), especially\r\n    considering that Jart’s sons always pop against him. This one will most\r\n    certainly come down to Monday night, as Jalen Hurts and Miles Sanders face\r\n    off against Ezekiel Elliott. Folbe will be holding the lead going into that\r\n    time, but will Jart be able to make the comeback on the wings of his\r\n    Eagles? Bounceback play from Tyreek Hill and D’Andre Swift, along with the\r\n    potential breaking out of Saquon Barkley makes us think it is likely. Until\r\n    Folbe proves he can perform we will struggle to pick him, so for now we\r\n    take <em>Real Brothers by 11.4.</em>\r\n</p>"}