{"title": "For Saquon <3", "season": 2021, "week": "5", "report": "<p>\r\n    Welcome back to the Jart Report after a week five that brought some good\r\n    matchups that came down to the wire on MNF. While the week was filled with\r\n    pain and the loss of a beloved player, we remain committed to bringing you\r\n    the best analysis.\r\n</p>\r\n<p>\r\n    <h3>Week Five Recap</h3>\r\n</p>\r\n<p>\r\n    To start, we are going to be looking back at how week four unfolded versus\r\n    the predictions that the Jart Team put together. The team strives to learn\r\n    from previous weeks to make the most informed predictions, and as we move\r\n    into the middle of the season we hope to improve in accuracy considerably.\r\n    We will go matchup by matchup and look at what we learned as the season\r\n    begins to take shape.\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses vs GRIDDY GANG:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: GRIDDY GANG by 22.7\r\n</p>\r\n<p>\r\n    Reality: Team Horses by 51.02\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: Unless Week 3 Folbe shows up, this one will be over\r\n        quickly. Examining matchups across the board, we like Josh Allen to\r\n        have a massive day against KC as Jalen Hurts just did and outscore\r\n        Russell Wilson. Zeke should continue success and Chris Carson bounces\r\n        back, but very good matchups for Elder Horse and Darrell provide a\r\n        massive advantage to GRIDDY GANG. Getting Tee Higgins back will be big\r\n        for Horses, but DK likely can’t offset the trio of Jefferson, Godwin,\r\n        and McLaurin. Replacing Logan Thomas will be interesting to watch, but\r\n        there is simply too much going GRIDDY GANG’s way. Some off-brand\r\n        performances from Jason coupled by explosion from Folbe is needed to\r\n        pull the upset here, and we don’t see that happening. We like GRIDDY\r\n        GANG by 22.7.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Off-brand performances from Jason? Check. Explosion from\r\n    Folbe? Check. Kicked off by DK Metcalf on TNF and an injury to Russell\r\n    Wilson, Folbe took an early lead and never looked back. Josh Allen\r\n    continues to play at an elite level, while Zeke continues his resurgence as\r\n    well and Leonard Fournette begins to flash for really the first time in his\r\n    career. For Jason, Derrick Henry continues to be an animal, while Hendoggy\r\n    and JJeffs provide continued solid play. Terry and Godwin have both been up\r\n    and down this year, and the performances just weren’t there this week. We\r\n    still like this team quite a bit even after the loss, although the stats\r\n    this week may reveal that this team has not been all that many have been\r\n    making it out to be through five weeks of the season.\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs Mike Williams WR1: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team Ross by 15.4\r\n</p>\r\n<p>\r\n    Reality: Mike Williams WR1 by 0.2\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: Two teams coming off disappointing losses last week, on\r\n        paper this looks to be one of the more even matchups of the week. Lamar\r\n        Jackson and Patrick Mahomes both provide the potential for electric QB\r\n        play, although Mahomes has been more consistent so far this year.\r\n        Dalvin Cook has a fabulous matchup with the Lions, and look for Aross\r\n        to pursue Damien Williams heavily to slide into the RB2 role. If AJB\r\n        can go that will provide a nice boost to the FLEX position that\r\n        struggled greatly a week ago, and Keenan Allen and AB should both see\r\n        improved weeks. For Brad, Gibson and Hunt both remain difficult for the\r\n        Jart Report to fully trust despite solid seasons so far, while Tyler\r\n        Boyd is downgraded if Tee Higgins suits up. Bounceback weeks for\r\n        Davante Adams and Mike Williams are to be expected, but will it be\r\n        enough? We think not at the Jart Report, as we have Team Ross by 15.4.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: Davante Adams and Mike Williams both certainly bounced back\r\n    this week, putting up 64.6 points, which turned out to be almost exactly\r\n    enough. While Cook didn’t play, Mattison filled in just as well, and Lamar\r\n    did bring the electric play unlike Mahomes. Antonio Brown certainly had an\r\n    improved week, and Mike Davis rewarded owners who continue to put faith in\r\n    him with another TD despite continuing to look much less efficient than\r\n    Patterson. For Brad, Gibson and Hunt turned in fabulous performances once\r\n    again, but an injury to Kenny Golladay may force the $99 man himself back\r\n    into action this week. One that truly came down to the wire on MNF, Brad\r\n    gets a big win, and can continue to freely obsess about roto.\r\n</p>\r\n<p>\r\n    <strong><em>Nooni vs United Nations:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Nooni by 12.6\r\n</p>\r\n<p>\r\n    Reality: United Nations by 8.42\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: Neither of these teams are good. So the Jart Report team\r\n        is unsure of what to expect. Ultimately, the play of Stafford and\r\n        Kamara coupled with what should be a better performance from Chuba\r\n        Hubbard give Nooni the spark needed to beat the McCaffrey-less Merrill.\r\n        This is likely the week DJ Moore comes back down to Earth some while\r\n        being covered by Slay, and we like Tyler Lockett to turn in a solid\r\n        outing. James Robinson will likely be the wildcard here, but we don’t\r\n        expect him to maintain the same elite production he has turned in the\r\n        last two weeks. Nooni by 12.6.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Well, we apologize at least this week for saying neither of\r\n    these teams were good. While this was a weird, high scoring week across the\r\n    board, both of these teams performed well. For Nooni, Alvin Kamara finally\r\n    showed why he went early first round (so perfect time to trade him for\r\n    pennies, right?), and fill-ins Hubbard and Williams both performed well in\r\n    their temporary roles. For MW, the play of Justin Herbert certainly led the\r\n    way, while Jrob and Claypool also had big days. This team certainly does\r\n    seem to be trending up with Christian McCaffrey set to return soon, and\r\n    will be one to watch.<strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>Real Brothers vs I Got a Half Chubb:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Real Brothers by 2.2\r\n</p>\r\n<p>\r\n    Reality: I Got a Half Chubb by 29.74\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: The Jart Report’s game of the week, two Top 4 teams in\r\n        the league so far face off, both coming off wins. There is a lot to\r\n        like about both of these teams, with the biggest question mark on\r\n        either starting lineup being how Latavius Murray fills in for the\r\n        injured David Montgomery. The Jart Report hates missing a chance to\r\n        face off against a son, but nonetheless we expect a lot of points to be\r\n        put up in this one. Thielen should find the endzone at least once\r\n        against Detroit, but Hopkins and Diontae draw tough matchups in San\r\n        Fran and Denver respectively. The play of Cordarelle Patterson is a\r\n        surprising new x-factor for The Family, as on paper a matchup against\r\n        the Jets suggests a big day. We fully expect Jart to make some lineup\r\n        errors this week, and which Tyreek Hill shows up will certainly be a\r\n        major factor. A matchup we would like to be pretty much even if there\r\n        were no injuries, the inability of RIP Dmont to suit up gives the\r\n        slight edge to Jart. We like Real Brothers by 2.2.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: After an explosive morning in London from Kyle Pitts and\r\n    Cordarelle Patterson followed by solid performances in the 1 o’clock\r\n    window, Jart looked to have this one in the bag, projected to win by over\r\n    30. Then Saquon Barkley’s ankle got stepped on in what we can only assume\r\n    was some B1G revenge from Jourdan Lewis, while Nick Chubb had his best day\r\n    of the year and DHop also performed well. The Bills D/ST out-scoring the\r\n    also injured Tyreek Hill was the icing on the cake, while Mark Andrews’ MNF\r\n    performance was, well, more icing. Both of these teams have a lot to like,\r\n    but Jart has to figure out how to get his best performers on the field, and\r\n    it will be tough to replace Saquon Barkley just when he was starting to put\r\n    up elite RB1 numbers once again. A huge blow to this team, as the\r\n    disappointing Miles Sanders will now be thrust into action this next week.\r\n</p>\r\n<p>\r\n    <strong><em>Tompa Bay vs Team Dmichs: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Dmichs by 5.4\r\n</p>\r\n<p>\r\n    Reality: Dmichs by 19.84\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: <strong> </strong>Another intriguing matchup, both of\r\n        these teams have shown a lot of volatility so far this season. We\r\n        expect one of these teams to show up this week while the other does\r\n        not, but we could see it going either way. Ultimately, after having one\r\n        of his worst weeks in recent memory, the Jart Report expects Travis\r\n        Kelce to get back on track in a major way, and for the Dak-Amari\r\n        connection to continue to kindle its flame. For Bank, Robert Woods has\r\n        the chance to have a massive day against the suspect Seahawk defense if\r\n        Kupp doesn’t steal the show, and Ridley could feast on the Jets D\r\n        unless the game script goes run heavy early. This one has the potential\r\n        for a lot of points, and while we like it in a blowout, since we can’t\r\n        choose which direction we’ll take Dmichs by 5.4.<strong></strong>\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: While Calvin Ridley did not travel to London, Robert Woods did\r\n    indeed feast on the Seahawks secondary, although his inability to find the\r\n    endzone on Thursday set the tone for Bank’s team this week. The Cardinals\r\n    RB stack is an understandable decision, but did not age well with the play\r\n    of Marquez Callaway and AJ Dillon on the bench. Tom Brady continues to\r\n    utilize the plethora of weapons at his disposal quite well, and Devonta\r\n    Smith has proven to be a reliable fantasy option. For Dmichs, the\r\n    touchdowns were back as Jonathan Taylor and Hollywood led the way with 2\r\n    TDs each. The Dak-Amari connection stayed strong as they hooked up for a\r\n    touchdown, but OBJ continued to disappoint and Juju was lost for the year.\r\n    A nice win for a Dmichs team seeking consistency, they have shown\r\n    themselves to be a playoff-capable team that could make some noise should\r\n    they get in.\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>NN vs Team ACL Tear: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team ACL Tear by 32.6\r\n</p>\r\n<p>\r\n    Reality: Team ACL Tear by 21.26\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: Oof. The consensus best and worst teams so far this\r\n        season face off, and there just is not much to say here. The Jart\r\n        Report likes Cousins and Najee to both have big days, and for Cooper\r\n        Kupp to either have a massive showing against Seattle on TNF or be\r\n        completely locked down. RB2 remains a concern for this team, along with\r\n        TE and FLEX. For JL, the sustainability of Deebo Samuel’s play is a\r\n        major question mark along with CEH, but there is a lot to like for this\r\n        team. CeeDee Lamb should bounce back nicely against the Giants, while\r\n        Kyler Murray has historically performed well against the 49ers, albeit\r\n        injuries do not plague that defense in the same way this season. NN is\r\n        going to need some massive performances to pull off the upset, and\r\n        while we can see its plausibility, we like Team ACL Tear by 32.6.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: NN popped off broooooo best week yet! When you’re 5-0\r\n    sometimes you need to be a mix of lucky and good, and this week JL was\r\n    lucky. Drawing a favorable matchup despite being 8th in PF, JL continues\r\n    his reign atop the league this year, although CEH may not be easy to\r\n    replace. Zack Moss and Tony Pollard have both looked good this season, but\r\n    neither serves as a bellcow, and will be interesting to watch. The Bills’\r\n    elite level of play has this team flying high, and we will see if that can\r\n    continue. For NN, Courtland Sutton got into the mix on what lately has been\r\n    the Najee and Kupp show, but this team continues to look like the worst in\r\n    the league. QB play has not yet been resolved, and and this team still\r\n    needs to figure out the TE and FLEX positions to begin to compete.\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>Yards to TD Ratio</h3>\r\n</p>\r\n<p>\r\n    <strong>Yards to TD ratio </strong>\r\n    is back. We will be looking at the 2 RB, 2 WR, 1 TE, and FLEX position only\r\n    (ignoring QBs), and will be calculated by taking total yards and dividing\r\n    by touchdowns scored.\r\n</p>\r\n<p>\r\n    <strong>United Nations: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 551 yards / 1 TD = 551 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 486 yards / 2 TD = 243 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 453 yards / 1 TD = 453 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 320 yards / 5 TDs = 64 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 529 yards / 3 TDs = <strong>176.3 (3rd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Nooni: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 270 yards / 2 TDs = 135 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 399 yards / 5 TDs = 79.8 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 320 yards / 1 TD = 320 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 410 yards / 1 TD = 410 (2nd)</em>\r\n</p>\r\n<p>\r\n    This Week: 553 yards / 5 TDs = <strong>110.6 (7th)</strong>\r\n</p>\r\n<p>\r\n    <strong>GRIDDY GANG: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 410 yards / 2 TDs = 205 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 605 yards / 8 TDs = 75.63 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 440 yards / 3 TDs = 146.7 (9th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 563 yards / 4 TDs = 140.8 (7th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 477 yards / 4 TDs = <strong>119.8 (5th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Horses: </strong>\r\n</p>\r\n<p>\r\n    <strong><em> </em></strong>\r\n    <em>Week One: 376 yards / 3 TDs = 125.33 (9th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 334 yards / 4 TDs = 83.5 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Three: 412 yards / 5 TDs = 82.4 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 311 yards / 2 TDs = 155.5 (5th)</em>\r\n</p>\r\n<p>\r\n    This Week: 503 yards / 5 TDs = <strong>100.6 (9th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>I Got a Half Chubb:</strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 450 yards / 8 TDs = 56.25 (12th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 432 yards / 3 TDs = 144 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 392 yards / 1 TD = 392 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 483 yards / 3 TDs = 161 (4th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 546 yards / 5 TDs = <strong>109.2 (8th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Real Brothers: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 528 yards / 1 TD = 528 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 371 yards / 2 TD = 185.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Three: 485 yards / 4 TDs = 121.3 (10th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 456 yards / 3 TDs = 152 (6th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 447 yards / 2 TDs = <strong>223.5 (2nd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Ross: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 514 yards / 3 TDs = 171.33 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 395 yards / 1 TD = 395 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 383 yards / 1 TD = 383 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Four: 218 yards / 2 TDs = 109 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 471 yards / 4 TDs = <strong>117.8 (6th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Mike Williams WR1: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 371 yards / 1 TD = 371 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 408 yards / 1 TD = 408 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 552 yards / 5 TDs = 110.4 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 394 yards / 2 TDs = 197 (3rd)</em>\r\n</p>\r\n<p>\r\n    This Week: 557 yards / 7 TDs = <strong>79.6 (11th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Team Dmichs: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 542 yards / 9 TDs = 60.22 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 345 yards / 3 TDs = 115 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 368 yards / 0 TDs = Infinity (1st)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 414 yards / 3 TDs = 138 (8th)</em>\r\n</p>\r\n<p>\r\n    This Week: 498 yards / 7 TDs = <strong>71.1 (12th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Tompa Bay: </strong>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week One: 339 yards / 2 TDs = 169.5 (7th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 405 yards / 6 TDs = 67.5 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 327 yards / 1 TD = 327 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 530 yards / 1 TD = 530 (1st)</em>\r\n</p>\r\n<p>\r\n    This Week: 429 yards / 1 TD = <strong>429 (1st)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team NN: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 427 yards / 2 TDs = 213.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 422 yards / 3 TDs = 140.67 (7th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 395 yards / 2 TDs = 197.5 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 307 yards / 3 TDs = 102.3 (10th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 443 yards / 3 TDs = <strong>147.7 (4th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team ACL Tear: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 428 yards / 5 TDs = 85.6 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 502 yards / 3 TDs = 167.33 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 450 yards / 2 TDs = 225 (7th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 580 yards / 7 TDs = 82.9 (11th)</em>\r\n</p>\r\n<p>\r\n    This Week: 488 yards / 6 TDs = <strong>81.3 (10th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    A week with tons of touchdowns meant real low ratios this week, with 10\r\n    teams scoring at least 3 touchdowns.\r\n</p>\r\n<p>\r\n    <h3>Total Touchdown Standings</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (23)\r\n    </li>\r\n    <li>\r\n        Dmichs (22)\r\n    </li>\r\n    <li>\r\n        Jase (21)\r\n    </li>\r\n    <li>\r\n        CJ (20)\r\n    </li>\r\n    <li>\r\n        Folbe (19)\r\n    </li>\r\n    <li>\r\n        Brad (16)\r\n    </li>\r\n    <li>\r\n        Nooni (14)\r\n    </li>\r\n    <li>\r\n        NN (13)\r\n    </li>\r\n    <li>\r\n        Jart (12), MW (12)\r\n    </li>\r\n    <li>\r\n        Bank (11), Aross (11)\r\n    </li>\r\n</ol>\r\n<p>\r\n    <h3>Lineup Efficiency</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Jart (160.12) → <strong>68.8%</strong> (Last week 68.4%)\r\n    </li>\r\n    <li>\r\n        Aross (158.88) → <strong>83.4%</strong> (Last week 92.4%)\r\n    </li>\r\n    <li>\r\n        CJ (156.02) → <strong>89.6%</strong> (Last week 95.5%)\r\n    </li>\r\n    <li>\r\n        Folbe (149.5) → <strong>96.9%</strong> (Last week 81.3%)\r\n    </li>\r\n    <li>\r\n        MW (141.62) → <strong>95.8%</strong> (Last week 91.9%)\r\n    </li>\r\n    <li>\r\n        Brad (139.88) → <strong>94.9%</strong> (Last week 84.5%)\r\n    </li>\r\n    <li>\r\n        JL (139.36) → <strong>85.4%</strong> (Last week: 93.9%)\r\n    </li>\r\n    <li>\r\n        Bank (132.94) → <strong>81.7%</strong> (Last week 89.2%)\r\n    </li>\r\n    <li>\r\n        Dmichs (131.98) → <strong>97.3%</strong> (Last week: 77.6%)\r\n    </li>\r\n    <li>\r\n        Nooni (129.3) → <strong>98.5%</strong> (Last week 77.6%)\r\n    </li>\r\n    <li>\r\n        Jason (103.48) → <strong>90.6%</strong> (Last week 93.6%)\r\n    </li>\r\n    <li>\r\n        NN (103.48) → <strong>94.4%</strong> (Last week 88.9%)\r\n    </li>\r\n</ol>\r\n<p>\r\n    Everybody popped this week, except for Jason. Not much to draw from this\r\n    week with such events occurring, other than that Jart really needs to\r\n    figure out how to play a lineup, although the Saquon Barkley injury\r\n    certainly hurt the lineup % significantly.\r\n</p>\r\n<p>\r\n    <h3>New Segment: Best Possible Season PF</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (739.88 PF)\r\n    </li>\r\n    <li>\r\n        Jart (713 PF)\r\n    </li>\r\n    <li>\r\n        CJ (669.66 PF)\r\n    </li>\r\n    <li>\r\n        Brad (656.8 PF)\r\n    </li>\r\n    <li>\r\n        Dmichs (619.42 PF)\r\n    </li>\r\n    <li>\r\n        Bank (618.38 PF)\r\n    </li>\r\n    <li>\r\n        Jason (614.34 PF)\r\n    </li>\r\n    <li>\r\n        MW (584.94 PF)\r\n    </li>\r\n    <li>\r\n        Aross (584.46 PF)\r\n    </li>\r\n    <li>\r\n        Folbe (575.9 PF)\r\n    </li>\r\n    <li>\r\n        Nooni (555.74 PF)\r\n    </li>\r\n    <li>\r\n        NN (529.4 PF)\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Jason is a fraud!\r\n</p>\r\n<p>\r\n    <h3>New Segment: Pulse of the League</h3>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    As a reminder, you all were quizzed on how you expected the above to shake\r\n    out, and here are the results. One point was awarded for each place off on\r\n    standings, and lowest score wins.\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL &amp; Folbe (10)\r\n    </li>\r\n    <li>\r\n        Bank, Brad, Dmichs, &amp; Nooni (12)\r\n    </li>\r\n    <li>\r\n        MW (14)\r\n    </li>\r\n    <li>\r\n        Jase (16)\r\n    </li>\r\n    <li>\r\n        NN (19)\r\n    </li>\r\n    <li>\r\n        CJ (22)\r\n    </li>\r\n    <li>\r\n        Aross (did not compete)\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>Transaction Analysis</h3>\r\n</p>\r\n<p>\r\n    In this segment we will look at the transactions from this week and rate\r\n    the best and worst one in the opinion of the Jart Report.\r\n</p>\r\n<p>\r\n    <strong>Best Transaction: </strong>\r\n    Jart, Kadarius Toney, $0. Getting in a week ahead of a guy who will likely\r\n    be the top waiver add this week in leagues, Toney is rising into WR1\r\n    position for the Giants, putting up 189 yards this week. Plus he is not\r\n    afraid to punch a dude.\r\n</p>\r\n<p>\r\n    Honorable Mention: Bank, AJ Dillon, $1. While Aaron Jones is obviously the\r\n    lead dog here, Bank got his handcuff and a solid RB for almost nothing, who\r\n    put up 15.9 this week while showing his ability to catch passes.\r\n</p>\r\n<p>\r\n    <strong>Worst Transaction:</strong>\r\n    NN, Jared Cook, $16 ($17 if you ask MW). While Damien Williams was the\r\n    tempting choice here given his short term fantasy relevance, Jared Cook had\r\n    1 catch, and does not look to be a solid long term TE. Lots of money to pay\r\n    for a TE.\r\n</p>\r\n<p>\r\n    Honorable Mention: Aross, Brandon Aiyuk, $0. Only a matter of time until\r\n    Trevon Diggs passes him in catches.\r\n</p>\r\n<p>\r\n    <strong>Memorable Transaction:</strong>\r\n    Needed to find a space to get this recent development into the Jart Report.\r\n    While we generally exclude trades from this section, the controversially\r\n    vetoed deal between Nooni and Folbe needed to be immortalized somewhere.\r\n    Leonard Fournette and Chris Carson for Alvin Kamara. On paper, a big win\r\n    for Folbe had it gone through, but it will be interesting to track this\r\n    season on how it develops. The Jart Report personally is extremely low on\r\n    Chris Carson and views him as an RB3, but we’ve been known to be wrong!\r\n</p>\r\n<p>\r\n    <h3>Record by PF Finish</h3>\r\n</p>\r\n<p>\r\n    1st: 5-0\r\n</p>\r\n<p>\r\n    2nd: 4-1\r\n</p>\r\n<p>\r\n    3rd: 3-2\r\n</p>\r\n<p>\r\n    4th: 4-1\r\n</p>\r\n<p>\r\n    5th: 4-1\r\n</p>\r\n<p>\r\n    6th: 3-2\r\n</p>\r\n<p>\r\n    7th: 3-2\r\n</p>\r\n<p>\r\n    8th: 2-3\r\n</p>\r\n<p>\r\n    9th: 1-4\r\n</p>\r\n<p>\r\n    10th: 0-5\r\n</p>\r\n<p>\r\n    11th: 1-4\r\n</p>\r\n<p>\r\n    12th: 0-5\r\n</p>\r\n<p>\r\n    Things are starting to even out here, with 3rd place really only being the\r\n    only one that is a little off, but even that is around where expected.\r\n</p>\r\n<p>\r\n    <h3>Power Rankings</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (5-0)\r\n    </li>\r\n    <li>\r\n        CJ (3-2)\r\n    </li>\r\n    <li>\r\n        Jason (3-2)\r\n    </li>\r\n    <li>\r\n        Dmichs (3-2)\r\n    </li>\r\n    <li>\r\n        Aross (3-2)\r\n    </li>\r\n    <li>\r\n        Brad (2-3)\r\n    </li>\r\n    <li>\r\n        MW (3-2)\r\n    </li>\r\n    <li>\r\n        Bank (2-3)\r\n    </li>\r\n    <li>\r\n        Folbe (2-3)\r\n    </li>\r\n    <li>\r\n        Jart (2-3)\r\n    </li>\r\n    <li>\r\n        Nooni (1-4)\r\n    </li>\r\n    <li>\r\n        NN (1-4)\r\n    </li>\r\n</ol>\r\n<p>\r\n    No debating.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Worst Possible Lineup</strong>\r\n</p>\r\n<p>\r\n    Here we will look at the worst combination of starters in this league!\r\n</p>\r\n<p>\r\n    QB: Russell Wilson*, 9.08 points, Jason\r\n</p>\r\n<p>\r\n    RB: Saquon Barkley*, 0.9 points, Jart\r\n</p>\r\n<p>\r\n    RB: Clyde Edwards-Helaire*, 2.9 points, JL\r\n</p>\r\n<p>\r\n    WR: Kenny Golladay*, 0 points, Brad\r\n</p>\r\n<p>\r\n    WR: Odell Beckham Jr, 3 points, Dmichs<strong></strong>\r\n</p>\r\n<p>\r\n    TE: Robert Tonyan, 1.3 points, Jason\r\n</p>\r\n<p>\r\n    FLEX: Chase Edmonds, 2.9 points, Bank\r\n</p>\r\n<p>\r\n    D/ST: Colts D/ST, -3 points, Jason\r\n</p>\r\n<p>\r\n    K: Evan McPherson, 0 points, Brad\r\n</p>\r\n<p>\r\n    <strong>Total Points: 17.08</strong>\r\n</p>\r\n<p>\r\n    Would it have beaten NN: <strong>No</strong>\r\n</p>\r\n<p>\r\n    *Suffered game ending injuries. Which was pretty much this whole list.\r\n</p>\r\n<p>\r\n    <h3>On To Week Six!</h3>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    It is now time to preview this week’s matchups!\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs I Got a Half Chubb: </em></strong>\r\n    Two teams coming off of very high scoring weeks, both teams are looking to\r\n    pick up a 4th win and separate themselves from the pack some as we approach\r\n    the midway point of this season. As of right now it looks like Trevor\r\n    Lawrence will be drawing the start for Squeej Nation, while Melvin Gordon\r\n    replaces the disappointing Latavius Murray at RB2 as RIP Dmont remains out.\r\n    Diontae Johnson seems primed for a big showing with an atrocious Seattle\r\n    secondary and Juju out, while Michael Pittman Jr. also draws a nice matchup\r\n    against the Texans. For Aross, Lamar should continue high level play\r\n    against a Chargers D/ST that was just torn up by Cleveland, while Keenan\r\n    Allen and AJ Brown should both eventually reclaim their WR1 mantles. The\r\n    difference maker in this one proves to be Noah Fant and Steelers D/ST, who\r\n    the Jart Report expects to both have big days. For that reason, while this\r\n    one will be a shootout, we like <em>Team Ross by 4.5. </em>\r\n</p>\r\n<p>\r\n    <strong><em>Tompa Bay vs Mike Williams WR1: </em></strong>\r\n    As we really aren’t sure what to make of this matchup, we are going to go\r\n    position by position. At QB, we like the advantage to go to Patrick Mahomes\r\n    in what should be a major bounceback day for the Chiefs after an\r\n    embarrassing loss. The Washington [REDACTED] defense has looked horrendous\r\n    so far, and certainly ill-equipped to stop all of the weapons the Chiefs\r\n    have. CEH being out should mean even more passing too, boosting Mahomes.\r\n    The Eagles defense shut down Darnold last week, and while Brady is\r\n    certainly better, we do not expect him to perform at similar levels to last\r\n    week. At RB, we call it a wash between the combo of Aaron Jones and Chase\r\n    Edmonds and Antonio Gibson and Kareem Hunt this week. All four backs are\r\n    often tough to predict, and things should even out here. At WR, the big\r\n    advantage goes to Brad as Davante Adams and Mike Williams have outplayed\r\n    Robert Woods and Devonta Smith all year. While we expect Mike Williams to\r\n    have an average day and Chicago to key in on Adams, Woods and Smith haven’t\r\n    yet shown the explosive play needed to keep up with those two. At TE we\r\n    like Hockenson to bounce back in a major way and outplay Conklin, while\r\n    defense and kicker remain stupid positions that have no business being in\r\n    this league. In considering all of this, we don’t feel much clearer on\r\n    anything, but we will take Mike Williams WR1 by 14.2, fueled by the monster\r\n    day of Mahomes.\r\n</p>\r\n<p>\r\n    <strong><em>Nooni vs Team Horses: </em></strong>\r\n    With McCaffrey likely returning and Kamara on bye, we do not expect this\r\n    one to be close. While Folbe has shown he is more than capable of putting\r\n    up 80 points on any given week, that may still be enough to win this week.\r\n    Mike Evans and Tyler Lockett could both have massive days, but without\r\n    Russell Wilson for Lockett and Evans likely drawing Darius Slay, we do not\r\n    see that happening. For Folbe, Allen should continue to play well, and\r\n    while it may be a somewhat uneven week for Folbe as DK adjusts to Geno\r\n    Smith, it should be enough to put the team over the top this week. While\r\n    this one may be relatively low scoring this week (certainly less than each\r\n    of these teams scored last week), we like <em>Team Horses by 17.6.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Buffalo Bills vs Dmichs: </em></strong>\r\n    The one thing I can say with confidence here is that Dmichs will have a big\r\n    lead after play concludes on Sunday. As JL rolls out the 4 Bills lineup on\r\n    MNF, this game will certainly sustain intrigue throughout. While Dmichs\r\n    does not look primed to score above 115 this week, we just don’t like the\r\n    Bills this week. We at the Jart Report refuse to believe that four players\r\n    from the same team that doesn’t include the QB can be a fantasy viable\r\n    options, and honestly for that reason we are rooting for Dmichs. This one\r\n    could certainly go either way, and while Kyler Murray should perform well\r\nagainst a Cleveland defense that was just abused by Justin Herbert, we like    <em>Dmichs by 12.2.</em>\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>NN vs United Nations: </em></strong>\r\n    Stick with me here, because I’m going to lose you early on. What is the\r\n    heart and soul of MW’s team? Some might say Justin Herbert, or James\r\n    Robinson. Some might think Christian McCaffrey. None of these answers are\r\n    correct. It’s Younghoe Koo. And he doesn’t play this week. That, coupled\r\n    with Najee Harris, Joe Mixon, and Cooper Kupp combining for 70+ this week,\r\n    gives NN a win and some vindication. We like <em>NN by 22.1. </em>We are\r\n    also ready to once again be very wrong about NN.\r\n</p>\r\n<p>\r\n    <strong><em>Real Brothers vs GRIDDY GANG: </em></strong>\r\n    If Saquon Barkley was healthy, this would easily be the matchup of the\r\n    week. But he’s not, and Miles Sanders is starting. We watched an interview\r\n    with Miles and the dude frankly isn’t pissed enough about how Nick Sirriani\r\n    is using him. While Jason’s QB remains a question, ultimately we are going\r\n    to decide this matchup by the end of Thursday night. Miles Sanders vs Chris\r\n    Godwin. Whoever scores more will lead their team to victory this week. We\r\nlike Chris Godwin to do so. And for that reason, we will take    <em>GRIDDY GANG by 72.7.</em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>Best Player at Each Position</h3>\r\n</p>\r\n<p>\r\n    In this segment we will predict who will have the best fantasy performance\r\n    this week at each position, along with who they are rostered by (if they\r\n    are currently rostered).\r\n</p>\r\n<p>\r\n    QB: Patrick Mahomes, Brad\r\n</p>\r\n<p>\r\n    RB: Darrell Henderson, Jason\r\n</p>\r\n<p>\r\n    WR: Tyreek Hill, Jart\r\n</p>\r\n<p>\r\n    TE: Noah Fant, Aross\r\n</p>\r\n<p>\r\n    D/ST: Steelers D/ST, Aross\r\n</p>\r\n<p>\r\n    K: Matt Gay, JL\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>IBM Jartson Trade Assistant</h3>\r\n</p>\r\n<p>\r\n    In this segment we create one trade of perceived equal value by the Jart\r\n    Report’s view that we think should happen. Trades involving Jart will be\r\n    excluded from consideration.\r\n</p>\r\n<p>\r\n    CJ: Michael Pittman Jr\r\n</p>\r\n<p>\r\n    Aross: Sony Michel\r\n</p>\r\n<p>\r\n    CJ gets a serviceable RB2 until Dmont is able to return, and Aross bolsters\r\n    WR depth as AJ Brown continues to struggle to get going this season.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>Family Award</h3>\r\n</p>\r\n<p>\r\n    Given that JL is playing 4 Bills this week, he wins the family award for\r\n    literally fielding a team of one team. We just hope it doesn’t work out for\r\n    him.\r\n</p>"}