{"title": "Happy Birthday Jason", "season": 2021, "week": "4", "report": "<p>\r\n    Welcome back to the Jart Report after a week four that brought blowouts\r\n    across the board this week. Despite the snoozers, we still learned a lot\r\n    about all of our teams this week and we are excited to bring you the\r\n    analysis heading into an exciting week five.\r\n</p>\r\n<p>\r\n    <h3>Week Four Recap</h3>\r\n</p>\r\n<p>\r\n    To start, we are going to be looking back at how week four unfolded versus\r\n    the predictions that the Jart Team put together. The team strives to learn\r\n    from previous weeks to make the most informed predictions, and as we move\r\n    into the middle of the season we hope to improve in accuracy considerably.\r\n    We will go matchup by matchup and look at what we learned as the season\r\n    begins to take shape.\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses vs I Got a Half Chubb:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team Horses by 11.6\r\n</p>\r\n<p>\r\n    Reality: I Got a Half Chubb by 52.3\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: Two teams currently trending in different directions\r\n        after Week Three, CJ will be looking to get back on track while Folbe\r\n        looks to keep up the high scoring momentum. Josh Allen is faced with a\r\n        highly enticing matchup against the Texans, while DK draws a SF defense\r\n        that was just torched by Davante Adams. For CJ, Chubb and Dmont draw\r\n        favorable games against Minnesota and Detroit respectively. While the\r\n        RB production should be good, we are weary about the potential tough\r\n        matchups at QB and TE, while we are in a wait and see approach on how\r\n        Diontae Johnson returns from injury. While we could see this game going\r\n        either way, continued high level performance from some key players\r\n        propel Folbe, as we have Team Horses by 11.6.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: The Jart Report wanted to believe that Folbe scoring 137\r\n    wasn’t just a once-in-a-season fluke that cost Jart Nation a loss, but\r\n    instead we see that that is truly all it was. Allen and DK performed well,\r\n    and a second great week from Zeke was certainly encouraging. But the rest\r\n    of the team was absolute and utter garbage. No one else scored more than\r\n    5.4 ($21 man Tim Patrick), and it looks like Logan Thomas is going to miss\r\n    at least one week. At least Tee Higgins is back soon? For CJ, a good bounce\r\n    back week was severely dampened by a knee injury that will sideline RIP\r\n    Dmont for at least 4 weeks. Diontae Johnson returning was a big boost for\r\n    the squad, and Buffalo feasted on turnover prone Davis Mills. Never was in\r\n    doubt.\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs Real Brothers: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Real Brothers by 12.9\r\n</p>\r\n<p>\r\n    Reality: Real Brothers by 26.04\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: In one of the more unique matchups, we come into this one\r\n        with the 1-2 team averaging almost 13 PPG more than the 3-0 team. For\r\n        Aross, Dalvin Cook is expected to be back, which honestly does not make\r\n        much of a difference and Alexander Mattison has proven he can put up\r\n        the same numbers in replacement. After struggling with Detroit some\r\n        last week, Lamar draws a tough matchup in Denver’s D. Mike Davis and\r\n        Myles Gaskin will both look to get going this week, with Davis drawing\r\n        the more favorable matchup. Antonio Brown has been rumored to be\r\n        receiving the start this week, so we will certainly be keeping an eye\r\n        on that story as it develops. For Jart, Jalen Hurts and Miles Sanders\r\n        draw Kansas City in what looks to be a big bounceback week after\r\n        struggling against the Cowboys. Ja’Marr Chase draws the always awful\r\n        Jaguars to kick off the week on TNF, while Brandin Cooks will likely be\r\n        receiving throws early and often with the Texans as massive underdogs.\r\n        The thing to watch most here is D’Andre Swift’s usage is what will\r\n        likely be a low scoring and close game throughout, as well as if Tyreek\r\n        Hill can get back to producing. We expect both of these things to\r\n        happen, and we like Real Brothers by 12.9 this week.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: Dalvin Cook was in and out of the game, hindering his output\r\n    and setting the tone for what was a disappointing day for Aross. Mike Davis\r\n    somehow found the end zone despite having 13 carries for 14 yards, which\r\n    was of great frustration to your team at the Jart Report. Myles Gaskin was\r\n    the epitome of the trash can emoji, while Keenan Allen struggled to get\r\n    going and AB was just missed a couple times for a TD. Lamar looked fine but\r\n    not amazing, and it is not usually a good sign when 2 of your 3 double\r\n    digit scorers are your TE and your Kicker. Back to the drawing board for a\r\n    team that is lucky to be 3-1, but is still in the thick of it. For Jart, it\r\n    was the return of Tyreek Hill that led this team, although Jalen Hurts\r\n    continues to provide high level play. The terrible management you have come\r\n    to expect was on display for Jart, as Saquon Barkley and Cordarelle\r\n    Patterson combined for 59.2 on his bench. This team has the firepower to\r\n    hang with anyone in the league, but needs to get it onto the field at the\r\n    same time.\r\n</p>\r\n<p>\r\n    <strong><em>Nooni vs Team ACL Tears:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Nooni by 17.1\r\n</p>\r\n<p>\r\n    Reality: Team ACL Tear by 70.82\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: This is our prediction for blowout of the week. We do\r\n        like what Nooni is working towards here and the team receives a big\r\n        boost from McCaffrey’s injury, and we expect bounceback days from Allen\r\n        Robinson and Tyler LockettE. For JL, Kyler Murray looks to find the\r\n        endzone through the air this week after failing to do so last week,\r\n        while Diggs and Deebo both draw favorable matchups. I bet you thought I\r\n        was gonna say this was gonna be a blowout win for Lopey. But in what\r\n        will probably ruin the integrity of the Jart Report and make us look\r\n        like idiots come next week, we are calling a breakout week from Nooni\r\n        and some struggles from JL. In a pick we want to hide from, we like\r\n        Nooni by 17.1.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Lol. That’s all. We at the Jart Report apologize for picking\r\n    Nooni.\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>United Nations vs GRIDDY GANG:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: GRIDDY GANG by 13.3\r\n</p>\r\n<p>\r\n    Reality: GRIDDY GANG by 32.08\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: These are two very different 2-1 teams. As in one\r\n        deserves to be 2-1 and the other doesn’t. In the absence of Christian\r\n        McCaffrey, there is simply too much firepower on GRIDDY GANG to be\r\n        overcome. A massive day from Derrick Henry is certainly expected\r\n        against the Jets, while the Griddy receiving duo should all provide\r\n        solid days to complement. DJ Moore and James Robinson will be the guys\r\n        to watch on MW’s team, to see if they can continue to build off of last\r\n        week’s success. We like GRIDDY GANG by 13.3.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Derrick popped, and the elite WR duo of the GRIDDY GANG JJeffs\r\n    and Scary Terry showed out. Darrell Henderson looked good in his return\r\n    from injury, and overall this team continues to prove they are a Top 3 team\r\n    week in and out. The TD luck was there for MW, but the lack of yardage in\r\n    the absence of Christian McCaffrey was too much to overcome. Suddenly this\r\n    team has serious WR2 and FLEX questions, as well as potentially RB2 while\r\n    McCaffrey remains out. Unless something changes quick, the next couple of\r\n    weeks do not look promising for MW.\r\n</p>\r\n<p>\r\n    <strong><em>Mike Williams WR1 vs Team Dmichs: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Dmichs by 7.2\r\n</p>\r\n<p>\r\n    Reality: Dmichs 18.3\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: <strong> </strong>A matchup that would have been decided\r\n        by over 70 points last week, these teams come in with very different\r\n        levels of momentum. All signs point to Brad winning easily, but we at\r\n        the Jart Report do not see this one going down that way. We expect Dak\r\n        and Amari to reestablish their Week One connection against a solid but\r\n        not unbeatable Carolina defense, while Jonathan Taylor has the\r\n        potential for a big day against a Miami defense that was just torched\r\n        by Payton Barber, while Devin Singletary and Odell Beckham Jr. both\r\n        have very favorable matchups. Travis Kelce should cancel out much of\r\n        Mahomes, and the Jart Report is skeptical on Elijah Mitchell and Kareem\r\n        Hunt. In what we expect to be a fairly high scoring matchup, we like\r\n        Dmichs by 7.2.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Dak Prescott and Amari Cooper did hook up for a TD this week,\r\n    and Jonathan Taylor did finally find the endzone against the weak Dolphins\r\n    run D. OBJ and Kelce both had disappointing days (OBJ’s being the bigger\r\n    cause for concern), but solid performances from Hollywood Brown,\r\n    Baltimore’s D/ST, and Matt Prater put Dmichs over the top. For Brad, great\r\n    games for Mahomes, Gibson, Hunt, and Boyd were offset by disappointing\r\n    performances from Adams, Kittle, WR1.6, Tennessee D/ST, and Greg Joseph.\r\n    While the Jart Report expects BMW to get more than 1 catch a game, his days\r\n    as WR2 are likely in the past. The Jart Report doesn’t feel great about\r\n    either of these teams moving forward, but a nice win for Dmichs.\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>NN vs Tompa Bay: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Tompa Bay by 9.8\r\n</p>\r\n<p>\r\n    Reality: Tompa Bay by 26.74\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: While we will keep a watchful eye on what NN does in the\r\n        QB department this week (Jart Report’s best guess is Baker Mayfield),\r\n        the Jart Report sees a lot more to like on the Tompa Bay side. While\r\n        both teams are in need of a win after rough starts to the season\r\n        (outside of Week 2 for Bank), we expect some regression from Cooper\r\n        Kupp this week as teams begin to really key in on making someone else\r\n        (Robert Woods) beat them through the air. Joe Mixon should have a good\r\n        night on TNF against the lowly Jaguars, but expectations are somewhat\r\n        tampered for Marvin Jones Jr and Courtland Sutton this week. Tom Brady\r\n        should have a monster game against his old team, while Chase Edmonds,\r\n        Calvin Ridley, and Julio Jones all draw favorable matchups. This likely\r\n        won’t be the highest scoring matchup of the week, but we like Tompa Bay\r\n        by 9.8.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: We at the Jart Report are stumped. We can’t seem to find the\r\n    words to describe just how bad NN’s team is. With Cooper Kupp returning to\r\n    Earth, he and Najee Harris are really the only hope for a team that has now\r\n    entered into the annual Joe Mixon week-to-week injury season. QB play\r\n    remains poor, while WR2 and FLEX provide inconsistent production, and the\r\n    TE position remains TD dependent. There is not much to like here, and not\r\n    much to trade to try to build. While we hope NN improves, we have a tough\r\n    time seeing it without a favorable trade.\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>Yards to TD Ratio</h3>\r\n</p>\r\n<p>\r\n    <strong>Yards to TD ratio </strong>\r\n    is back. We will be looking at the 2 RB, 2 WR, 1 TE, and FLEX position only\r\n    (ignoring QBs), and will be calculated by taking total yards and dividing\r\n    by touchdowns scored.\r\n</p>\r\n<p>\r\n    <strong>United Nations: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 551 yards / 1 TD = 551 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 486 yards / 2 TD = 243 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 453 yards / 1 TD = 453 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 320 yards / 5 TDs = <strong>64 (12th)</strong>\r\n</p>\r\n<p>\r\n    <strong>GRIDDY GANG: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 410 yards / 2 TDs = 205 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 605 yards / 8 TDs = 75.63 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 440 yards / 3 TDs = 146.7 (9th)</em>\r\n</p>\r\n<p>\r\n    This Week: 563 yards / 4 TDs = <strong>140.8 (7th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>I Got a Half Chubb:</strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 450 yards / 8 TDs = 56.25 (12th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 432 yards / 3 TDs = 144 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 392 yards / 1 TD = 392 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 483 yards / 3 TDs = <strong>161 (4th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Horses: </strong>\r\n</p>\r\n<p>\r\n    <strong><em> </em></strong>\r\n    <em>Week One: 376 yards / 3 TDs = 125.33 (9th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 334 yards / 4 TDs = 83.5 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Three: 412 yards / 5 TDs = 82.4 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 311 yards / 2 TDs = <strong>155.5 (5th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Real Brothers: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 528 yards / 1 TD = 528 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 371 yards / 2 TD = 185.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Three: 485 yards / 4 TDs = 121.3 (10th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 456 yards / 3 TDs = <strong>152 (6th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Ross: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 514 yards / 3 TDs = 171.33 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 395 yards / 1 TD = 395 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 383 yards / 1 TD = 383 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 218 yards / 2 TDs = <strong>109 (9th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Team Dmichs: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 542 yards / 9 TDs = 60.22 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 345 yards / 3 TDs = 115 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 368 yards / 0 TDs = Infinity (1st)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 414 yards / 3 TDs = <strong>138 (8th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Mike Williams WR1: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 371 yards / 1 TD = 371 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 408 yards / 1 TD = 408 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 552 yards / 5 TDs = 110.4 (11th)</em>\r\n</p>\r\n<p>\r\n    This Week: 394 yards / 2 TDs = <strong>197 (3rd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team NN: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 427 yards / 2 TDs = 213.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 422 yards / 3 TDs = 140.67 (7th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 395 yards / 2 TDs = 197.5 (8th)</em>\r\n</p>\r\n<p>\r\n    This Week: 307 yards / 3 TDs = <strong>102.3 (10th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Tompa Bay: </strong>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week One: 339 yards / 2 TDs = 169.5 (7th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 405 yards / 6 TDs = 67.5 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 327 yards / 1 TD = 327 (5th)</em>\r\n</p>\r\n<p>\r\n    This Week: 530 yards / 1 TD = <strong>530 (1st)</strong>\r\n</p>\r\n<p>\r\n    <strong>Nooni: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 270 yards / 2 TDs = 135 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 399 yards / 5 TDs = 79.8 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 320 yards / 1 TD = 320 (6th)</em>\r\n</p>\r\n<p>\r\n    This Week: 410 yards / 1 TD = <strong>410 (2nd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team ACL Tear: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 428 yards / 5 TDs = 85.6 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 502 yards / 3 TDs = 167.33 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 450 yards / 2 TDs = 225 (7th)</em>\r\n</p>\r\n<p>\r\n    This Week: 580 yards / 7 TDs = <strong>82.9 (11th)</strong>\r\n</p>\r\n<p>\r\n    Ratios were pretty even this week throughout the league, with the majority\r\n    of ratios falling in the 100s. Ratios were much lower this week, with 197\r\n    coming in as the 3rd highest this week after 197.5 was the 8th highest last\r\n    week. MW was a surprise coming in with the lowest ratio, given that he did\r\n    not score that many points and took the loss. Not a great sign for the\r\n    team.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>Lineup Efficiency</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (159.42) → <strong>93.9%</strong> (Last week: 86.0%)\r\n    </li>\r\n    <li>\r\n        Jart (155.38) → <strong>68.4%</strong> (Last week 93.6%)\r\n    </li>\r\n    <li>\r\n        Dmichs (150.02) → <strong>77.6%</strong> (Last week: 95.6%)\r\n    </li>\r\n    <li>\r\n        Jason (139.86) → <strong>93.6%</strong> (Last week 100%)\r\n    </li>\r\n    <li>\r\n        CJ (132.42) → <strong>95.5%</strong> (Last week 85.2%)\r\n    </li>\r\n    <li>\r\n        Brad (116.12) → <strong>84.5%</strong> (Last week 89.5%)\r\n    </li>\r\n    <li>\r\n        Bank (113.26) → <strong>89.2%</strong> (Last week 84.0%)\r\n    </li>\r\n    <li>\r\n        MW (107.52) → <strong>91.9%</strong> (Last week 85.8%)\r\n    </li>\r\n    <li>\r\n        Nooni (101.6) → <strong>77.6%</strong> (Last week 78.8%)\r\n    </li>\r\n    <li>\r\n        Folbe (91.22) → <strong>81.3%</strong> (Last week 89.1%)\r\n    </li>\r\n    <li>\r\n        Aross (86.84) → <strong>92.4%</strong> (Last week 84.3%)\r\n    </li>\r\n    <li>\r\n        NN (83.62) → <strong>88.9%</strong> (Last week 81.1%)\r\n    </li>\r\n</ol>\r\n<p>\r\n    A lot of shakeups this week, with Dmichs returning near the top in points\r\n    possible, and Folbe falling back down to the bottom. No one played their\r\n    best possible lineup this week, with CJ coming the closest. Jart was by far\r\n    the worst lineup picker this week, with Saquon Barkley and Cordarelle\r\n    Patterson going off while Miles Sanders and D’Andre Swift struggled.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>Transaction Analysis</h3>\r\n</p>\r\n<p>\r\n    In this segment we will look at the transactions from this week and rate\r\n    the best and worst one in the opinion of the Jart Report.\r\n</p>\r\n<p>\r\n    <strong>Best Transaction: </strong>\r\n    JL, Dawson Knox, $1. Idek how this is happening. But every TE that Jonah\r\n    touches turns to gold.\r\n</p>\r\n<p>\r\n    Honorable Mention: CJ, Latavius Murray, $1. While it remains to be seen how\r\n    this RB rotation will all shake out with Ty’Son healthy, if Latavius takes\r\n    control of the work $1 is a steal for a solid FLEX play.\r\n</p>\r\n<p>\r\n    <strong>Worst Transaction:</strong>\r\n    NN, Kirk Cousins, $1. While NN didn’t pay much to acquire him, he once\r\n    again dropped a QB who outscored the one he picked up. This week was quite\r\n    the sizeable difference between Daniel Jones and Kirk Cousins, as Cousins\r\n    finished as the worst starter at the QB position for the league this week.\r\n</p>\r\n<p>\r\n    Hororable Mention: Folbe, Tim Patrick, $21. Could turn out to be fine, but\r\n    right now looks like a major overpay for a WR whose ceiling is certainly\r\n    limited, and floor may be quite low, especially with Bridgewater sidelined\r\n    now.\r\n</p>\r\n<p>\r\n    <h3>Record by PF Finish</h3>\r\n</p>\r\n<p>\r\n    1st: 4-0\r\n</p>\r\n<p>\r\n    2nd: 3-1\r\n</p>\r\n<p>\r\n    3rd: 2-2\r\n</p>\r\n<p>\r\n    4th: 3-1\r\n</p>\r\n<p>\r\n    5th: 4-0\r\n</p>\r\n<p>\r\n    6th: 2-2\r\n</p>\r\n<p>\r\n    7th: 3-1\r\n</p>\r\n<p>\r\n    8th: 1-3\r\n</p>\r\n<p>\r\n    9th: 1-3\r\n</p>\r\n<p>\r\n    10th: 0-4\r\n</p>\r\n<p>\r\n    11th: 1-3\r\n</p>\r\n<p>\r\n    12th: 0-4\r\n</p>\r\n<p>\r\n    All top 6 PF won this week. Who needs roto?\r\n</p>\r\n<p>\r\n    <h3>Power Rankings</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (4-0)\r\n    </li>\r\n    <li>\r\n        Jason (3-1)\r\n    </li>\r\n    <li>\r\n        Jart (2-2)\r\n    </li>\r\n    <li>\r\n        CJ (2-2)\r\n    </li>\r\n    <li>\r\n        Aross (3-1)\r\n    </li>\r\n    <li>\r\n        Brad (1-3)\r\n    </li>\r\n    <li>\r\n        Bank (2-2)\r\n    </li>\r\n    <li>\r\n        Dmichs (2-2)\r\n    </li>\r\n    <li>\r\n        MW (2-2)\r\n    </li>\r\n    <li>\r\n        Nooni (1-3)\r\n    </li>\r\n    <li>\r\n        Folbe (1-3)\r\n    </li>\r\n    <li>\r\n        NN (1-3)\r\n    </li>\r\n</ol>\r\n<p>\r\n    No debating.\r\n</p>\r\n<p>\r\n    <h3>New Segment: Worst Possible Lineup</h3>\r\n</p>\r\n<p>\r\n    Here we will look at the worst combination of starters in this league!\r\n</p>\r\n<p>\r\n    QB: Kirk Cousins, 10.12 points, NN\r\n</p>\r\n<p>\r\n    RB: Myles Gaskin, 0.3 points, Aross\r\n</p>\r\n<p>\r\n    RB: Chris Carson, 3.6 points, Folbe\r\n</p>\r\n<p>\r\n    WR: DJ Chark*, 0 points, MW\r\n</p>\r\n<p>\r\n    WR: Cole Beasley, 1.6 points, Brad<strong></strong>\r\n</p>\r\n<p>\r\n    TE: Logan Thomas*, 0 points, Folbe\r\n</p>\r\n<p>\r\n    FLEX: CeeDee Lamb, 2.3 points, JL\r\n</p>\r\n<p>\r\n    D/ST: Rams D/ST, -5 points, Nooni\r\n</p>\r\n<p>\r\n    K: Multiple Players, 1 point, Jart, Brad, NN\r\n</p>\r\n<p>\r\n    <strong>Total Points: 13.92</strong>\r\n</p>\r\n<p>\r\n    Would it have beaten NN: <strong>No</strong>\r\n</p>\r\n<p>\r\n    *Suffered game ending injuries.\r\n</p>\r\n<p>\r\n    <h3>On To Week Five!</h3>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    It is now time to preview this week’s matchups!\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs Mike Williams WR1: </em></strong>\r\n    Two teams coming off disappointing losses last week, on paper this looks to\r\n    be one of the more even matchups of the week. Lamar Jackson and Patrick\r\n    Mahomes both provide the potential for electric QB play, although Mahomes\r\n    has been more consistent so far this year. Dalvin Cook has a fabulous\r\n    matchup with the Lions, and look for Aross to pursue Damien Williams\r\n    heavily to slide into the RB2 role. If AJB can go that will provide a nice\r\n    boost to the FLEX position that struggled greatly a week ago, and Keenan\r\n    Allen and AB should both see improved weeks. For Brad, Gibson and Hunt both\r\n    remain difficult for the Jart Report to fully trust despite solid seasons\r\n    so far, while Tyler Boyd is downgraded if Tee Higgins suits up. Bounceback\r\n    weeks for Davante Adams and Mike Williams are to be expected, but will it\r\nbe enough? We think not at the Jart Report, as we have    <em>Team Ross by 15.4.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Tompa Bay vs Dmichs: </em></strong>\r\n    Another intriguing matchup, both of these teams have shown a lot of\r\n    volatility so far this season. We expect one of these teams to show up this\r\n    week while the other does not, but we could see it going either way.\r\n    Ultimately, after having one of his worst weeks in recent memory, the Jart\r\n    Report expects Travis Kelce to get back on track in a major way, and for\r\n    the Dak-Amari connection to continue to kindle its flame. For Bank, Robert\r\n    Woods has the chance to have a massive day against the suspect Seahawk\r\n    defense if Kupp doesn’t steal the show, and Ridley could feast on the Jets\r\n    D unless the game script goes run heavy early. This one has the potential\r\n    for a lot of points, and while we like it in a blowout, since we can’t\r\n    choose which direction we’ll take <em>Dmichs by 5.4.</em>\r\n</p>\r\n<p>\r\n    <strong><em>GRIDDY GANG vs Team Horses: </em></strong>\r\n    Unless Week 3 Folbe shows up, this one will be over quickly. Examining\r\n    matchups across the board, we like Josh Allen to have a massive day against\r\n    KC as Jalen Hurts just did and outscore Russell Wilson. Zeke should\r\n    continue success and Chris Carson bounces back, but very good matchups for\r\n    Elder Horse and Darrell provide a massive advantage to GRIDDY GANG. Getting\r\n    Tee Higgins back will be big for Horses, but DK likely can’t offset the\r\n    trio of Jefferson, Godwin, and McLaurin. Replacing Logan Thomas will be\r\n    interesting to watch, but there is simply too much going GRIDDY GANG’s way.\r\n    Some off-brand performances from Jason coupled by explosion from Folbe is\r\nneeded to pull the upset here, and we don’t see that happening. We like    <em>GRIDDY GANG by 22.7.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Team ACL Tear vs NN: </em></strong>\r\n    Oof. The consensus best and worst teams so far this season face off, and\r\n    there just is not much to say here. The Jart Report likes Cousins and Najee\r\n    to both have big days, and for Cooper Kupp to either have a massive showing\r\n    against Seattle on TNF or be completely locked down. RB2 remains a concern\r\n    for this team, along with TE and FLEX. For JL, the sustainability of Deebo\r\n    Samuel’s play is a major question mark along with CEH, but there is a lot\r\n    to like for this team. CeeDee Lamb should bounce back nicely against the\r\n    Giants, while Kyler Murray has historically performed well against the\r\n    49ers, albeit injuries do not plague that defense in the same way this\r\n    season. NN is going to need some massive performances to pull off the\r\nupset, and while we can see its plausibility, we like    <em>Team ACL Tear by 32.6.</em>\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>Nooni vs United Nations: </em></strong>\r\n    Neither of these teams are good. So the Jart Report team is unsure of what\r\n    to expect. Ultimately, the play of Stafford and Kamara coupled with what\r\n    should be a better performance from Chuba Hubbard give Nooni the spark\r\n    needed to beat the McCaffrey-less Merrill. This is likely the week DJ Moore\r\n    comes back down to Earth some while being covered by Slay, and we like\r\n    Tyler Lockett to turn in a solid outing. James Robinson will likely be the\r\n    wildcard here, but we don’t expect him to maintain the same elite\r\n    production he has turned in the last two weeks. <em>Nooni by 12.6.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Real Brothers vs I Got a Half Chubb: </em></strong>\r\n    The Jart Report’s game of the week, two Top 4 teams in the league so far\r\n    face off, both coming off wins. There is a lot to like about both of these\r\n    teams, with the biggest question mark on either starting lineup being how\r\n    Latavius Murray fills in for the injured David Montgomery. The Jart Report\r\n    hates missing a chance to face off against a son, but nonetheless we expect\r\n    a lot of points to be put up in this one. Thielen should find the endzone\r\n    at least once against Detroit, but Hopkins and Diontae draw tough matchups\r\n    in San Fran and Denver respectively. The play of Cordarelle Patterson is a\r\n    surprising new x-factor for The Family, as on paper a matchup against the\r\n    Jets suggests a big day. We fully expect Jart to make some lineup errors\r\n    this week, and which Tyreek Hill shows up will certainly be a major factor.\r\n    A matchup we would like to be pretty much even if there were no injuries,\r\n    the inability of RIP Dmont to suit up gives the slight edge to Jart. We\r\n    like <em>Real Brothers by 2.2.</em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>Best Player at Each Position</h3>\r\n</p>\r\n<p>\r\n    In this segment we will predict who will have the best fantasy performance\r\n    this week at each position, along with who they are rostered by (if they\r\n    are currently rostered).\r\n</p>\r\n<p>\r\n    QB: Josh Allen\r\n</p>\r\n<p>\r\n    RB: Derrick Henry\r\n</p>\r\n<p>\r\n    WR: Robert Woods\r\n</p>\r\n<p>\r\n    TE: Travis Kelce\r\n</p>\r\n<p>\r\n    D/ST: Buccaneers D/ST\r\n</p>\r\n<p>\r\n    K: Matt Gay\r\n</p>\r\n<p>\r\n    <strong>New Segment: IBM Jartson Trade Assistant</strong>\r\n</p>\r\n<p>\r\n    In this segment we create one trade of perceived equal value by the Jart\r\n    Report’s view that we think should happen. Trades involving Jart will be\r\n    excluded from consideration.\r\n</p>\r\n<p>\r\n    Aross: Antonio Brown\r\n</p>\r\n<p>\r\n    MW: Javonte Williams\r\n</p>\r\n<p>\r\n    MW gets reunited with Antonio Brown and helps solve some WR issues, while\r\n    Aross adds a solid RB to replace Mike Davis. While it would leave MW with\r\n    some RB questions before McCaffrey comes back, it was the most need-filling\r\n    trade the team could find that didn’t involve Dmichs giving Jart Kelce :)\r\n</p>\r\n<p>\r\n    <strong>New Segment: Juju Award</strong>\r\n</p>\r\n<p>\r\n    Submitted by long time reader, first time commenter JL, this award goes to\r\n    the team who seems to be bonding the best (we prefer to call this The\r\n    Family award). As soon as Bob Onions hits the griddy after scoring a TD\r\n    this one will be decided for the team, but until then we give the award to\r\n    NN. Nothing bonds a team together like adversity, and no one is facing more\r\n    currently. While it seems a little early to be tanking for Bryce Young, we\r\n    respect the commitment.\r\n</p>\r\n"}