{"title": "We Are Back", "season": 2021, "week": "0", "report": "<p>\r\n    We’re back boys. While this isn’t my main league, what a joy it is to be\r\n    back in action. We here at the Jart Report are excited to bring you another\r\n    season of in-depth analysis of Fantasy DickBall. In what was likely our\r\n    most seamless draft yet, I was very well pleased with the amount of\r\n    preparation everyone put into this year. This should be our most\r\n    competitive season yet, as I could see every team winning the championship\r\n    this year if things break the right way. For this edition of the Jart\r\n    Report, we are going to be looking at every team’s draft, and provide a\r\n    ranking at the end.\r\n</p>\r\n<h3>Draft Recaps</h3>\r\n<p>\r\n    <strong><em>United Nations:</em></strong>\r\n    Not too many surprises with the draft here. McCaffrey was a known #1 pick,\r\n    and additions of James Robinson, Tyrell Williams and Younghoe Koo are to be\r\n    expected for an MW managed team. High upside picks of Justin Herbert, DJ\r\n    Moore, Javonte Williams, and Darren Waller round out a team that could\r\n    certainly put MW in contention for back-to-back championships (Bank won\r\n    this league two years ago). The FLEX remains a ? for now, as well as James\r\n    Robinson’s usage %. For now, we rate <em>United Nations</em> a B+.\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross:</em></strong>\r\n    Lamar. Lamar. Lamar. We here at the Jart Report are enamored with Lamar\r\n    Jackson this year, expecting him to finish the season as QB1. Paired with\r\n    Dalvin Cook and AJB, this team has the potential for countless explosive\r\n    plays each week. It’s hard to pick apart much of what this team did on\r\n    draft day. Savvy trades, careful selections, and development of bench depth\r\n    at the RB spot (Miles Gaskin, Michael Carter) leaves us excited for this\r\n    team. We give <em>Team Aross</em> an A.\r\n</p>\r\n<p>\r\n    <strong><em>Let’s Try Again:</em></strong>\r\n    The strength of this team rests in the WR corps. Arob, LockettE, and Mike\r\n    Evans provide high upside, but a lot of risks. We’ve seen a lot of bust\r\n    weeks from the latter two over the last couple seasons. We all know Nooni\r\n    hates managing virgins too. With only 1 top 26 pick, Alvin Kamara leads the\r\n    RB room. Raheem Mustard in the starting lineup though? RB depth remains a\r\n    major concern for this team, and Kamara’s role in the Saints offense\r\n    remains to be seen, as Tony Jones Jr. play this preseason must also be\r\n    taken into consideration to take some snaps. Given the potential for\r\n    disaster for this team with one injury, we rate <em>Let’s Try Again</em> a\r\n    B-.\r\n</p>\r\n<p>\r\n    <strong><em>GRIDDY GANG:</em></strong>\r\n    League sweetheart and favorite Jason Silverstone is back again with a new\r\n    look team that is sure to catch your eye. Led by the horse himself (lol @\r\n    folbe for thinking his team is still Team Horses), the always electric duo\r\n    of JJeffs and Scurry Turry form a formidable squad. While more on this\r\n    squad will be coming later in our report, we give Griddy Gang an A-, as\r\n    questions surround RB2.\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses:</em></strong>\r\n    When I think of a Horse, I do not think of Ezekiel Elliott. Proven to be\r\n    the most beloved and cherished RB in the NFL last year by our league, he\r\n    headlines a team with one true horse in DK Metcalf, and a herd of foals.\r\n    This lineup doesn’t have any clear weaknesses, and will rest on the play of\r\nZeke and Carson, as well as how the Bengals target share unfolds. We give    <em>Team Horses </em>an A-.\r\n</p>\r\n<p>\r\n    <strong><em>I Got a Half Chubb:</em></strong>\r\n    This team leaves us at nothing more than a half chubb. The biggest question\r\n    for this team is how aging stars Aaron Rodgers, Deandre Hopkins, and Adam\r\n    Thielen will perform. If they all have another elite season in them, they\r\n    could certainly be in contention. If their careers are winding to a close,\r\n    this team could hit some major road bumps. While we at the Jart Report do\r\n    love RIP DMONT, we do not like his fantasy prospects this season. The Jart\r\n    Report expects Trevor Lawrence to have taken over the starting QB position\r\n    by the end of the year, but with question marks on an aging WR corps, we\r\n    give <em>I Got a Half Chubb</em> a B+.\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>Sutton My Face:</em></strong>\r\n    We at the Jart Report lovingly know this team as the meme team. Led by\r\n    popular offseason names Kyler Murray, Austin Ekeler, Gus Edwards, Ceedee\r\n    Lamb, and Ty’Son Williams, this team seems to just be made up of those guys\r\n    who you heard were undervalued this season. If this turns out to be true,\r\n    this team will compete. We at the Jart Report are not sold on the longevity\r\n    of this team, but we will keep a close eye on how things develop. If Kyler\r\n    does not run as much as last season, if Le’Veon steals some carries, and\r\n    Jerry Jeudy emerges as WR1 in Denver, this team could be in deep trouble.\r\n    We give <em>Sutton My Face</em> a C+.\r\n</p>\r\n<p>\r\n    <strong><em>Tompa Bay:</em></strong>\r\n    The good? This team has 6 WRs who could end the season as WR30 or higher.\r\n    The bad? You can only play 3 WRs at once. The Jart Report has serious\r\n    questions about Chase Edmonds and any Detroit pass-catcher this season, and\r\n    the team lacks quality depth at those positions. While the weapons around\r\n    Brady are certainly elite, at some point his age will catch up to him. If\r\n    there’s one thing we’ve learned, it’s never to bet against Tom, but for now\r\n    we remain hesitant. We give <em>Tompa Bay</em> a B.\r\n</p>\r\n<p>\r\n    <strong><em>Aiyuk Hummin?:</em></strong>\r\n    We at the Jart Report expect the developed depth on this team to play a\r\n    major factor this season. While we are not wowed by Mixon, Kupp, or Aiyuk,\r\n    we love CEH and Marvin Jones Jr. as two guys who we expect to play\r\n    prominent roles this season. Steady QB play coupled with a high potential\r\n    TE leaves us feeling pretty good about this team. While Pittsburgh’s O-Line\r\n    is a concern, volume is king. We give <em>Aiyuk Hummin?</em> an A-.\r\n</p>\r\n<p>\r\n    <strong><em>brad silverman:</em></strong>\r\n    Headlined by the expected QB1 and WR1 this season, RB is the glaring\r\n    concern for this team. Gibson has the makings of a RB1, but until he is\r\n    able to consistently prove it beyond one season, the Jart Report is\r\n    hesitant. Kareem Hunt will always be heavily limited by Nick Chubb, and JD\r\n    McKissic and Kenyan Drake likely only prove viable options should injuries\r\n    occur. This team looks primed to compete, but they seem to lack the\r\nconsistent star power throughout positions to be at the top. We give    <em>brad silverman</em> a B+.\r\n</p>\r\n<p>\r\n    <strong><em>The Equadae:</em></strong>\r\n    Jart got who he wanted, with one notable exception following Alex’s move up\r\n    to 61 to grab Lamar Jackson before Jart picked at 62. Jalen Hurts is\r\n    certainly a question mark, along with a RB core that is extremely talented\r\n    but all hold potential issues. Tyreek Hill and Brandin Cooks will both\r\n    serve as clear WR1 on each of their teams, but QB questions are certainly a\r\n    concern in Houston, and rookie TEs are never a safe bet. The bench provides\r\n    intriguing WR depth, but should any of the 3 primary RBs miss time, this\r\n    team could be severely hurting. We give <em>The Equadae</em> a B.\r\n</p>\r\n<p>\r\n    <strong><em>_ Dmichs:</em></strong>\r\n    We at the Jart Report kinda hate this team. It may score a lot of points,\r\n    but goodness it’s a boring team. Grind it out RBs, a QB/WR stack that\r\n    leaves you with even less of a half chubb than CJ’s, this team has a lot of\r\n    potential but lacks joy. The kind of team you want to just take a nap all\r\n    day Sunday and then check the final score on afterwards. Indianapolis’\r\n    O-Line is a major concern currently, Josh Jacobs is a low-ceiling back with\r\n    legal issues, OBJ hasn’t been relevant in years, and Corey Davis finds\r\n    himself in a packed receiver room. We like this team to score a lot, but\r\n    not be at the top. We give <em>_ Dmichs</em> a B+.\r\n</p>\r\n\r\n    <h3>Ratings:</h3>\r\n<p>\r\n    <strong>A:</strong>\r\n    Team Ross\r\n</p>\r\n<p>\r\n    <strong>A-:</strong>\r\n    Aiyuk Hummin?, Team Horses, GRIDDY GANG\r\n</p>\r\n<p>\r\n    <strong>B+:</strong>\r\n    _Dmichs, brad silverman, I Got A Half Chubb, United Nations\r\n</p>\r\n<p>\r\n    <strong>B:</strong>\r\n    Equadae, Tompa Bay\r\n</p>\r\n<p>\r\n    <strong>B-:</strong>\r\n    Let’s Try Again\r\n</p>\r\n<p>\r\n    <strong>C+:</strong>\r\n    Sutton My Face\r\n</p>\r\n\r\n    <h3>Draft Superlatives:</h3>\r\n\r\n<p>\r\n    <strong>Best Pick:</strong>\r\n    Travis Kelce, 12th overall. Insane value for a guy who is likely going to\r\n    outperform every other TE by a large amount.\r\n</p>\r\n<p>\r\n    <strong>Worst Pick:</strong>\r\n    Joe Mixon, 16th overall. Pretty self-explanatory. Honorable Mention:\r\n    Javonte Williams to MW, solely because he didn’t know who he was.\r\n</p>\r\n<p>\r\n    <strong>Most Predictable Pick:</strong>\r\n    Stefon Diggs, 18th overall to JL. Honorable mention: James Robinson 25th\r\n    overall to MW.\r\n</p>\r\n<p>\r\n    <strong>Least Predictable Pick:</strong>\r\n    Keenan Allen, 26th overall to Aross. Passing on Terry was unexpected!\r\n</p>\r\n<p>\r\n    <strong>Pick That Made Me Happiest:</strong>\r\n    Alvin Kamara. I love all my children, and all I want for them is to find\r\n    good homes with owners who will cherish them. And I have complete\r\n    confidence that Nooni will love Alvin with all of his heart. I hope you go\r\n    14-0 Nooni.\r\n</p>\r\n<p>\r\n    <strong>Pick That Made Me Angriest:</strong>\r\n    Kenyan Drake. Not because I wanted him. I was actually nervous I’d be\r\n    forced to take him. But because no one else is allowed to own Kenyan Drake.\r\n    I hope you go 0-14 Brad.\r\n</p>\r\n<p>\r\n    <strong>Most Fun Team to Watch:</strong>\r\n    <em>GRIDDY GANG!</em>\r\n    You pair two electric wide receivers in JJeffs and Scurry Turry with the\r\n    human tank, all while Russ is cookin? As Bill Raftery would say, onions!\r\n    And Jase even has the human onion himself, Bobby Onions. Godwin and Robby\r\n    Anderson both provide intriguing explosiveness from the FLEX, and this is a\r\n    team I can’t wait to watch.\r\n</p>\r\n<p>\r\n    <strong>Most Boring Team to Watch:</strong>\r\n    This one is a tie between <em>Aiyuk Hummin?</em> and <em>_ Dmichs</em>. I\r\n    don’t necessarily think these teams will be bad by any means, but nothing\r\n    about them is exciting to watch. They’re full of guys who are gonna grind\r\n    out yards and receptions, which will win em games, but at what cost?\r\n</p>\r\n<p>\r\n    <strong>Best Team Name:</strong>\r\n    <em>GRIDDY GANG</em>\r\n    ! Nuff said.\r\n</p>\r\n<p>\r\n    <strong>Worst Team Name:</strong>\r\nThis is a two way tie between <em>brad silverman</em> and    <em>Team Ross</em>. How are you gonna not have a team name in this league.\r\n    Honorable Mention: <em>Tompa Bay</em>.\r\n</p>\r\n    <h3>My Predicted Champion:</h3>\r\n    While tough to predict at this moment with injuries, trades, etc. sure to\r\noccur, the team I like the best as it stands currently is    <em>Team Ross</em>. While injury concerns do follow around guys like\r\n    Dalvin, AJB, and Fant, the explosiveness of the roster leaves a lot of\r\n    upside. We expect Lamar to be QB1 this year in fantasy, and this team\r\n    should score a lot of points.\r\n</p>\r\n    <h3>Week One:</h3>\r\n<p>\r\n    Football is upon us tomorrow night, and that means we are back with our\r\n    matchup breakdowns. While it is tough to know how staunch defenses will be\r\n    this season on any team, we will not let inaccuracies keep us from\r\n    preparing the report.\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross </em>vs. <em>Aiyuk Hummin?</em>:</strong>\r\n    In what I expect to be the biggest blowout of Week One, Team Ross walks out\r\n    with clearer and more proven firepower. AJB has something to prove against\r\n    his former manager, and NN’s team is more built for Week 10 than it is Week\r\n    1. We like <em>Team Ross </em>by 15.\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses vs. United Nations:</em></strong>\r\n    The undisputed best two teams from last season (shut up Bank), these new\r\n    look squads look just as poised to make noise this season. While one can\r\n    feel confident knowing what MW’s team will produce, Folbe’s team provides\r\n    some question marks with low floors and high ceilings that gives this\r\n    matchup great intrigue. As MW said himself though, he doesn’t draft for\r\nWeek One. And we expect Folbe to give him all he handle off the bat.    <em>Team Horses </em>by 7.\r\n</p>\r\n<p>\r\n    <strong><em>_ Dmichs vs Let’s Try Again:</em></strong>\r\n    Nooni’s team seems best suited for early season matchups as Mostert’s role\r\n    will likely only shrink throughout the season, whereas Dmichs looks like a\r\n    team who will improve throughout the season. While I expect _Dmichs to have\r\nthe better season, Nooni pulls off the week one win here.    <em> Let’s Try Again</em> by 3.\r\n</p>\r\n<p>\r\n    <strong><em>brad silverman vs GRIDDY GANG:</em></strong>\r\n    In what the Jart Report expects to be the matchup of the week, two high\r\n    upside teams square off. Whereas some question marks surround Golladay and\r\n    Hunt, GRIDDY GANG looks solid from top down. While both teams will score a\r\n    lot of points, we have the GRIDDY GANG winning by 11.\r\n</p>\r\n<p>\r\n    <strong><em>I Got A Half Chubb vs Tompa Bay: </em></strong>\r\n    A matchup we will gain a lot of clarity on after Thursday night when Bank\r\n    sends out Brady and the Bucs D/ST, both teams trot out a lot of intriguing\r\n    players. 5-10 years ago, a matchup with Aaron Rodgers, Tom Brady, DeAndre\r\n    Hopkins, Adam Thielen, and Julio Jones woulda been the championship. Now,\r\n    we are left wondering what we will get. Less question marks surround CJ,\r\n    and thus the Jart Report has <em>I Got A Half Chubb</em> by 6 in a matchup\r\n    with lots of swings.\r\n</p>\r\n<p>\r\n    <strong><em>The Equadae vs Sutton My Face:</em></strong>\r\n    Week One is certainly the week to face Jart, with question marks on D’Andre\r\n    Swift and Saquon Barkley’s health. Tyreek and Diggs will be a fun battle to\r\n    watch, while Jalen Hurts tries to replicate Kyler Murray’s magic from last\r\n    season. A matchup that could be in the 80s or in the 120s, we expect this\r\n    one to be close. We at the Jart Report have <em>Sutton My Face</em> by 8.\r\n</p>\r\n"}