{"title": "(N)ever Say (N)ever", "season": 2021, "week": "6", "report": "<p>\r\n    Welcome back to the Jart Report after a week six filled with fun matchups\r\n    and drama, as we remain committed to bringing you the best analysis. This\r\n    week brought some surprises both in scoring as well as in deals made\r\n    throughout both last week and into this week, and following a Family\r\n    victory this week we are excited to dive into an eventful week.\r\n</p>\r\n<p>\r\n    <h3>Week Six Recap:</h3>\r\n</p>\r\n<p>\r\n    To start, we are going to be looking back at how week six unfolded versus\r\n    the predictions that the Jart Team put together. The team strives to learn\r\n    from previous weeks to make the most informed predictions, and as we have\r\n    moved into the middle of the season we hope to improve in accuracy\r\n    considerably. We will go matchup by matchup and look at what we learned as\r\n    the season begins to take shape.\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses vs Nooni:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team Horses by 17.6\r\n</p>\r\n<p>\r\n    Reality: Team Horses by 16.98\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: With McCaffrey likely returning and Kamara on bye, we do\r\n        not expect this one to be close. While Folbe has shown he is more than\r\n        capable of putting up 80 points on any given week, that may still be\r\n        enough to win this week. Mike Evans and Tyler Lockett could both have\r\n        massive days, but without Russell Wilson for Lockett and Evans likely\r\n        drawing Darius Slay, we do not see that happening. For Folbe, Allen\r\n        should continue to play well, and while it may be a somewhat uneven\r\n        week for Folbe as DK adjusts to Geno Smith, it should be enough to put\r\n        the team over the top this week. While this one may be relatively low\r\n        scoring this week (certainly less than each of these teams scored last\r\n        week), we like Team Horses by 17.6.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: In what was definitely not a low-scoring matchup as we had\r\n    predicted, both teams came out with solid performances after a\r\n    disappointing TNF for Nooni. The big news is of course the trade that we\r\n    will get into more later, but newcomer Darrell Henderson (hendoggy to those\r\n    who know and love him) stepped in nicely while Chris Godwin struggled. Matt\r\n    Stafford continued his solid play, and Chuba Hubbard is looking like\r\n    potentially the steal of the draft with no timetable on McCaffrey’s return.\r\n    For Folbe, Josh Allen continued his high level of play, while Jaylen Waddle\r\n    finally got going after a slow start for the 6th overall pick in the NFL\r\n    draft. Fournette is also finally living up to his draft billing lately,\r\n    which if that can be sustained will make Folbe quite dangerous as we move\r\n    near the midpoint of the season. While questions linger at WR with Geno\r\n    throwing to Beta Metcalf and Tee continuing to concede targets to Chase,\r\n    Waddle and Tim Patrick certainly showed encouraging signs, although Patrick\r\n    is likely replaced on Horses by the impending return of Jerry Jeudy. A good\r\n    win for the resurgent Horses.\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs I Got a Half Chubb: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team Ross by 4.5\r\n</p>\r\n<p>\r\n    Reality: Team Ross by 16.62\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: Two teams coming off of very high scoring weeks, both\r\n        teams are looking to pick up a 4th win and separate themselves from the\r\n        pack some as we approach the midway point of this season. As of right\r\n        now it looks like Trevor Lawrence will be drawing the start for Squeej\r\n        Nation, while Melvin Gordon replaces the disappointing Latavius Murray\r\n        at RB2 as RIP Dmont remains out. Diontae Johnson seems primed for a big\r\n        showing with an atrocious Seattle secondary and Juju out, while Michael\r\n        Pittman Jr. also draws a nice matchup against the Texans. For Aross,\r\n        Lamar should continue high level play against a Chargers D/ST that was\r\n        just torn up by Cleveland, while Keenan Allen and AJ Brown should both\r\n        eventually reclaim their WR1 mantles. The difference maker in this one\r\n        proves to be Noah Fant and Steelers D/ST, who the Jart Report expects\r\n        to both have big days. For that reason, while this one will be a\r\n        shootout, we like Team Ross by 4.5.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: In the absence of team namesake Nick Chubb and RIP Dmont,\r\n    Melvin Gordon and Latavius Murray filled in fine, but lacked the explosion\r\n    needed to give CJ a chance to win this week. The main takeaway here is the\r\n    questionable decision to bench Rodgers and Thielen in favor of TLaw and\r\n    Michael Pittman, as CJ would have coasted to victory with them. For Aross,\r\n    despite the disappointing play of Lamar Jackson, the Jart Report was quite\r\n    pleased to see Noah Fant go off as predicted, joined by Dalvin and Tampa\r\n    WR1 (sorry Nooni) Antonio Brown. RB2 does remain a concern for this team as\r\n    Miles Gaskin, Mike Davis, and Sony Michel have yet to prove to be reliable\r\n    options, but for now Aross sits at 2nd place with a 4-2 record, and primed\r\n    to continue to compete moving forward. A much needed and nice win for\r\n    Aross.\r\n</p>\r\n<p>\r\n    <strong><em>NN vs United Nations:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: NN by 22.1\r\n</p>\r\n<p>\r\n    Reality: NN by 73.58\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: What is the heart and soul of MW’s team? Some might say\r\n        Justin Herbert, or James Robinson. Some might think Christian\r\n        McCaffrey. None of these answers are correct. It’s Younghoe Koo. And he\r\n        doesn’t play this week. That, coupled with Najee Harris, Joe Mixon, and\r\n        Cooper Kupp combining for 70+ this week, gives NN a win and some\r\n        vindication. We like NN by 22.1. We are also ready to once again be\r\n        very wrong about NN.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: No Younghoe Koo? Big problems for MW as predicted. While NN\r\n    has yet to figure out his QB issues (too soon?) Najee and Mixon continue to\r\n    produce well while Kupp continues his elite play. Shoutout to the Jart\r\n    Report for correctly predicting the trio would score 70+ this week. They\r\nactually combined for 75, which means that    <strong>THOSE THREE ALONE WOULD HAVE BEATEN MW.</strong> Real tough scene\r\n    for MW, who got absolutely nothing from anyone not named James Robinson.\r\n    With CMC nowhere near returning, this team is in trouble. DJ Moore can’t\r\n    catch, Devontae Booker lacks long term relevancy, and Javonte Williams has\r\n    yet to take over the backfield from Melvin Gordon. This is a team in\r\n    trouble.<strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>Real Brothers vs GRIDDY GANG:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: GRIDDY GANG by 72.7\r\n</p>\r\n<p>\r\n    Reality: Real Brothers by 20.72\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: If Saquon Barkley was healthy, this would easily be the\r\n        matchup of the week. But he’s not, and Miles Sanders is starting. We\r\n        watched an interview with Miles and the dude frankly isn’t pissed\r\n        enough about how Nick Sirriani is using him. While Jason’s QB remains a\r\n        question, ultimately we are going to decide this matchup by the end of\r\n        Thursday night. Miles Sanders vs Chris Godwin. Whoever scores more will\r\n        lead their team to victory this week. We like Chris Godwin to do so.\r\n        And for that reason, we will take GRIDDY GANG by 72.7.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Well Jase traded Chris Godwin. So that threw the whole matchup\r\n    off. Miles Sanders ended up outscoring the no one that Jase played, and\r\n    that is why Jart won. While the win was a big one for Jart backed by\r\n    encouraging performances from Jalen Hurts and Tyreek Hill, the big news was\r\n    of course the trade that we will get to later. For Jason, Derrick Henry\r\n    salvaged what was otherwise an atrocious week for a team that chose the\r\n    long term over the short. Acquiring Kamara will most likely be a +EV move\r\n    (you’re welcome brad) over Hendoggy and Godwin, and the Henry-Kamara combo\r\n    will be real tough to face. While this team lost this week, it shouldn’t\r\n    see another sub-100 point game this season.\r\n</p>\r\n<p>\r\n    <strong><em>Buffalo Bills vs Team Dmichs: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Dmichs by 12.2\r\n</p>\r\n<p>\r\n    Reality: Buffalo Bills by 9.46\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: The one thing I can say with confidence here is that\r\n        Dmichs will have a big lead after play concludes on Sunday. As JL rolls\r\n        out the 4 Bills lineup on MNF, this game will certainly sustain\r\n        intrigue throughout. While Dmichs does not look primed to score above\r\n        115 this week, we just don’t like the Bills this week. We at the Jart\r\n        Report refuse to believe that four players from the same team that\r\n        doesn’t include the QB can be fantasy viable options, and honestly for\r\n        that reason we are rooting for Dmichs. This one could certainly go\r\n        either way, and while Kyler Murray should perform well against a\r\n        Cleveland defense that was just abused by Justin Herbert, we like\r\n        Dmichs by 12.2.<strong></strong>\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Had Jonah not cheated, and started Emmanuel Sanders instead of\r\n    Ceedee Lamb as he promised, Dmichs woulda won by 10.54. So it’s not my\r\n    fault. For Dmichs, Jonathan Taylor continues his elite play as of late,\r\n    while Kelce provides a great floor and Josh Jacobs vultured a touchdown\r\n    from Kenyan Drake. A tough loss considering the 4th place PF finish, but a\r\n    lot to like for Dmichs. For JL, Kyler continued to produce at a top 5\r\n    level, while Damien Williams picked up Austin Ekeler’s slack by finding the\r\n    endzone twice. Diggs and Lamb look to be a top 3 WR duo in the league, and\r\n    Deebo can likely provide solid FLEX play. This team still reigns supreme\r\n    this year, although the gap certainly has been closed at least some in the\r\n    last week thanks to moves made by contending managers.\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>Tompa Bay vs Mike Williams WR1: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Mike Williams WR1 by 14.2\r\n</p>\r\n<p>\r\n    Reality: Tompa Bay by 25.9\r\n</p>\r\n<p>\r\n    <em>\r\n        What we said: As we really aren’t sure what to make of this matchup, we\r\n        are going to go position by position. At QB, we like the advantage to\r\n        go to Patrick Mahomes in what should be a major bounceback day for the\r\n        Chiefs after an embarrassing loss. The Washington [REDACTED] defense\r\n        has looked horrendous so far, and certainly ill-equipped to stop all of\r\n        the weapons the Chiefs have. CEH being out should mean even more\r\n        passing too, boosting Mahomes. The Eagles defense shut down Darnold\r\n        last week, and while Brady is certainly better, we do not expect him to\r\n        perform at similar levels to last week. At RB, we call it a wash\r\n        between the combo of Aaron Jones and Chase Edmonds and Antonio Gibson\r\n        and Kareem Hunt this week. All four backs are often tough to predict,\r\n        and things should even out here. At WR, the big advantage goes to Brad\r\n        as Davante Adams and Mike Williams have outplayed Robert Woods and\r\n        Devonta Smith all year. While we expect Mike Williams to have an\r\n        average day and Chicago to key in on Adams, Woods and Smith haven’t yet\r\n        shown the explosive play needed to keep up with those two. At TE we\r\n        like Hockenson to bounce back in a major way and outplay Conklin, while\r\n        defense and kicker remain stupid positions that have no business being\r\n        in this league. In considering all of this, we don’t feel much clearer\r\n        on anything, but we will take Mike Williams WR1 by 14.2, fueled by the\r\n        monster day of Mahomes.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: The Jart Report did not know what to make of this matchup as\r\n    stated, and it showed. Brad went from contender to blow-it-up in one week\r\n    as the injuries mounted. Calf injuries to Gibson and Hunt set the tone for\r\n    a day when Ricky Seals-Jones was really the best performer (we consider\r\n    22.98 from Mahomes a bad performance). This team will look much different\r\n    next week, and we sincerely hope that that is for the best. There is still\r\n    time to salvage a season, but only if Mahomes is still on the roster come\r\n    Sunday. For Bank, it was not a great day (10th in PF), but enough to beat a\r\n    hapless opponent. Arwin looked good, but that was about the only bright\r\n    spot aside from an encouraging bounceback from TJ Hockenson that saw the\r\n    star TE receive 11 targets. Calvin Ridley will be a welcome addition back\r\n    as Devonta has been inconsistent at best, and the Jart Report sincerely\r\n    hopes this Cardinals RB stack will end soon. They are not Mark Ingram and\r\n    Alvin Kamara, and at this point it's just embarrassing.\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>Yards to TD Ratio:</h3>\r\n</p>\r\n<p>\r\n    We will be looking at the 2 RB, 2 WR, 1 TE, and FLEX position only\r\n    (ignoring QBs), and will be calculated by taking total yards and dividing\r\n    by touchdowns scored.\r\n</p>\r\n<p>\r\n    <strong>United Nations: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 551 yards / 1 TD = 551 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 486 yards / 2 TD = 243 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 453 yards / 1 TD = 453 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 320 yards / 5 TDs = 64 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Five: 529 yards / 3 TDs = 176.3 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 393 yards / 1 TD = <strong>393 (1st)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team NN: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 427 yards / 2 TDs = 213.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 422 yards / 3 TDs = 140.67 (7th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 395 yards / 2 TDs = 197.5 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 307 yards / 3 TDs = 102.3 (10th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Five: 443 yards / 3 TDs = 147.7 (4th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 641 yards / 7 TDs = <strong>91.6 (10th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Nooni: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 270 yards / 2 TDs = 135 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 399 yards / 5 TDs = 79.8 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 320 yards / 1 TD = 320 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 410 yards / 1 TD = 410 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Five: 553 yards / 5 TDs = 110.6 (7th)</em>\r\n</p>\r\n<p>\r\n    This Week: 392 yards / 3 TDs = <strong>130.7 (6th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Horses: </strong>\r\n</p>\r\n<p>\r\n    <strong><em> </em></strong>\r\n    <em>Week One: 376 yards / 3 TDs = 125.33 (9th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 334 yards / 4 TDs = 83.5 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Three: 412 yards / 5 TDs = 82.4 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 311 yards / 2 TDs = 155.5 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Five: 503 yards / 5 TDs = 100.6 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 497 yards / 4 TDs = <strong>124.3 (7th)</strong>\r\n</p>\r\n<p>\r\n    <strong>GRIDDY GANG: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 410 yards / 2 TDs = 205 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 605 yards / 8 TDs = 75.63 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 440 yards / 3 TDs = 146.7 (9th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 563 yards / 4 TDs = 140.8 (7th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Five: 477 yards / 4 TDs = 119.8 (5th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 307 yards / 4 TDs = <strong>76.8 (12th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Real Brothers: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 528 yards / 1 TD = 528 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 371 yards / 2 TD = 185.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Three: 485 yards / 4 TDs = 121.3 (10th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 456 yards / 3 TDs = 152 (6th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Five: 447 yards / 2 TDs = 223.5 (2nd)</em>\r\n</p>\r\n<p>\r\n    This Week: 420 yards / 3 TDs = <strong>140 (5th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>I Got a Half Chubb:</strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 450 yards / 8 TDs = 56.25 (12th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 432 yards / 3 TDs = 144 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 392 yards / 1 TD = 392 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 483 yards / 3 TDs = 161 (4th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Five: 546 yards / 5 TDs = 109.2 (8th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 386 yards / 4 TDs = <strong>96.5 (9th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Ross: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 514 yards / 3 TDs = 171.33 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 395 yards / 1 TD = 395 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 383 yards / 1 TD = 383 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Four: 218 yards / 2 TDs = 109 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week Five: 471 yards / 4 TDs = 117.8 (6th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 488 yards / 3 TDs =<strong> 162.7 (4th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Mike Williams WR1: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 371 yards / 1 TD = 371 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 408 yards / 1 TD = 408 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 552 yards / 5 TDs = 110.4 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 394 yards / 2 TDs = 197 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Five: 557 yards / 7 TDs = 79.6 (11th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 303 yards / 1 TD = <strong>303 (2nd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Tompa Bay: </strong>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week One: 339 yards / 2 TDs = 169.5 (7th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 405 yards / 6 TDs = 67.5 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> Week Three: 327 yards / 1 TD = 327 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 530 yards / 1 TD = 530 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Five: 429 yards / 1 TD = 429 (1st)</em>\r\n</p>\r\n<p>\r\n    This Week: 367 yards / 2 TDs = <strong>183.5 (3rd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Dmichs: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 542 yards / 9 TDs = 60.22 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 345 yards / 3 TDs = 115 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 368 yards / 0 TDs = Infinity (1st)</em>\r\n</p>\r\n<p>\r\n    <em> Week Four: 414 yards / 3 TDs = 138 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Five: 498 yards / 7 TDs = 71.1 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 458 yards / 4 TDs = <strong>114.5 (8th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team ACL Tear: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 428 yards / 5 TDs = 85.6 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 502 yards / 3 TDs = 167.33 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Three: 450 yards / 2 TDs = 225 (7th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Four: 580 yards / 7 TDs = 82.9 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Five: 488 yards / 6 TDs = 81.3 (10th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 448 yards / 5 TDs =<strong> 89.6 (11th)</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>New Segment: Yards to TD Season Standings</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        <strong>Merrick W.</strong>\r\n        2732 yards / 13 TDs = <strong>210.2</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Merrick B.</strong>\r\n        2397 yards / 13 TDs = <strong>184.4</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Jarrett B.</strong>\r\n        2707 yards / 15 TDs = <strong>180.5</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Alex R.</strong>\r\n        2469 yards / 14 TDs = <strong>176.4</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Brad S.</strong>\r\n        2585 yards / 17 TDs = <strong>152.1</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Daniel B.</strong>\r\n        2344 yards / 17 TDs = <strong>137.9</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Noah N.</strong>\r\n        2635 yards / 20 TDs = <strong>131.8</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Jason S.</strong>\r\n        2802 yards / 25 TDs = <strong>112.1</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Christopher D.</strong>\r\n        2689 yards / 24 TDs = <strong>112.0</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Garrett F.</strong>\r\n        2433 yards / 23 TDs = <strong>105.8</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Jonah L.</strong>\r\n        2896 yards / 28 TDs = <strong>103.4</strong>\r\n    </li>\r\n    <li>\r\n        <strong>Daniel M.</strong>\r\n        2625 yards / 26 TDs = <strong>100.1</strong>\r\n    </li>\r\n</ol>\r\n\r\n    <h3>Lineup Efficiency:</h3>\r\n\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Folbe (150.22) → 87.2<strong>%</strong> (Last week 96.9%)\r\n    </li>\r\n    <li>\r\n        NN (149.68) → 99.1<strong>%</strong> (Last week 94.4%)\r\n    </li>\r\n    <li>\r\n        JL (143.76) → 95.3<strong>%</strong> (Last week: 85.4%)\r\n    </li>\r\n    <li>\r\n        Dmichs (132.5) → 96.3<strong>%</strong> (Last week: 97.3%)\r\n    </li>\r\n    <li>\r\n        Nooni (131.44) → 86.7<strong>%</strong> (Last week 98.5%)\r\n    </li>\r\n    <li>\r\n        CJ (124.2) → 75.7<strong>%</strong> (Last week 89.6%)\r\n    </li>\r\n    <li>\r\n        Aross (122.68) → 89.7<strong>%</strong> (Last week 83.4%)\r\n    </li>\r\n    <li>\r\n        Jart (116.0) → 100<strong>%</strong> (Last week 68.8%)\r\n    </li>\r\n    <li>\r\n        Jason (103.48) → 92.1<strong>%</strong> (Last week 90.6%)\r\n    </li>\r\n    <li>\r\n        Bank (93.98) → 96.5<strong>%</strong> (Last week 81.7%)\r\n    </li>\r\n    <li>\r\n        MW (93.44) → 80.1<strong>%</strong> (Last week 95.8%)\r\n    </li>\r\n    <li>\r\n        Brad (78.38) → 82.6<strong>%</strong> (Last week 94.9%)\r\n    </li>\r\n</ol>\r\n<p>\r\n    <h3>New Segment: Lineup Efficiency Average</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Jason (95.40%)\r\n    </li>\r\n    <li>\r\n        Dmichs (91.48%)\r\n    </li>\r\n    <li>\r\n        Aross (90.50%)\r\n    </li>\r\n    <li>\r\n        Folbe (90.39%)\r\n    </li>\r\n    <li>\r\n        MW (89.41%)\r\n    </li>\r\n    <li>\r\n        JL (88.03%)\r\n    </li>\r\n    <li>\r\n        Bank (87.93%)\r\n    </li>\r\n    <li>\r\n        Nooni (87.77%)\r\n    </li>\r\n    <li>\r\n        CJ (86.08%)\r\n    </li>\r\n    <li>\r\n        Brad (85.93%)\r\n    </li>\r\n    <li>\r\n        NN (85.53%)\r\n    </li>\r\n    <li>\r\n        Jart (84.04%)\r\n    </li>\r\n</ol>\r\n<p>\r\n    <h3>Pulse of the League</h3>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    As a reminder, you all were quizzed on how you expected the above to shake\r\n    out, and here are the results. One point was awarded for each place off on\r\n    standings, and lowest score wins.\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Jase (22)\r\n    </li>\r\n    <li>\r\n        Folbe (23)\r\n    </li>\r\n    <li>\r\n        Bank (25)\r\n    </li>\r\n    <li>\r\n        Brad, NN (38)\r\n    </li>\r\n</ol>\r\n<p>\r\n    Did not participate: MW, CJ, Aross, JL, Nooni, Dmichs\r\n</p>\r\n\r\n    <h3>Best Possible Season PF</h3>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (883.64 PF)\r\n    </li>\r\n    <li>\r\n        Jart (829 PF)\r\n    </li>\r\n    <li>\r\n        CJ (793.86 PF)\r\n    </li>\r\n    <li>\r\n        Dmichs (751.92 PF)\r\n    </li>\r\n    <li>\r\n        Brad (735.18 PF)\r\n    </li>\r\n    <li>\r\n        Folbe (726.12 PF)\r\n    </li>\r\n    <li>\r\n        Jason (717.82 PF)\r\n    </li>\r\n    <li>\r\n        Bank (712.36 PF)\r\n    </li>\r\n    <li>\r\n        Aross (707.14 PF)\r\n    </li>\r\n    <li>\r\n        Nooni (687.18 PF)\r\n    </li>\r\n    <li>\r\n        NN (679.08 PF)\r\n    </li>\r\n    <li>\r\n        MW (678.38 PF)\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Folbe was the biggest riser, moving from 10th to 6th! NN is not last\r\n    anymore!!<strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>Transaction Analysis</h3>\r\n</p>\r\n<p>\r\n    In this segment we will look at the transactions from this week and rate\r\nthe best and worst one in the opinion of the Jart Report.    <strong>*This does not include trades*</strong>\r\n</p>\r\n<p>\r\n    <strong>Best Transaction: </strong>\r\n    Khalil Herbert, NN, $0. While Damien may return this week and NN would have\r\n    actually been better off playing MJJ, he snagged a RB who put up almost 20\r\n    points for free. That is certainly a rarity.\r\n</p>\r\n<p>\r\n    Honorable Mention: Ricky Seals-Jones, Brad, $0. He was nice.\r\n</p>\r\n<p>\r\n    <strong>Worst Transaction:</strong>\r\n    Browns D/ST, Brad, $0. This is less because of the add, and more because he\r\n    dropped Kenyan Drake to roster 2 defenses. Kenyan made him pay this week.\r\n</p>\r\n<p>\r\n    Honorable Mention: Devontae Booker, $33. Another inefficient week for a RB\r\n    with a limited timeline, this is looking like a waste of a sizeable amount\r\n    of FAAB.\r\n</p>\r\n\r\n    <h3>Special Segment: Trade Jartalyzer</h3>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    The people have requested Jart’s takes on some trades made this week, and\r\n    thus we bring you a special segment to look at those. This segment will\r\n    likely re-appear on an “as needed” basis as opposed to weekly.\r\n</p>\r\n<p>\r\n    I want to take a minute to provide some unsolicited trading advice.\r\n    Throughout the history of this league, trades have been the greatest source\r\n    of in-season division, and frankly that is not uncommon but at the same\r\n    time is not necessary. So the best recommendation that I can make is to\r\n    find an unbiased league member who is not involved in the trade and just\r\n    consult them. Ask if the trade makes sense. Because sometimes we all get\r\n    caught up in things and miss the bigger picture. And then things get messy.\r\n    This is our main league boys, and I implore you to do your best to avoid\r\n    division and contention, and instead make sure the trades you offer and\r\n    accept are in your best interest. We can do this.\r\n</p>\r\n<p>\r\n    <strong>Trade #1:</strong>\r\n</p>\r\n<p>\r\n    Nooni: Darrell Henderson, Chris Godwin, Michael Carter (Grade: B+)\r\n</p>\r\n<p>\r\n    Jase: Alvin Kamara (Grade: A)\r\n</p>\r\n<p>\r\n    This is actually a nice haul for Nooni, although the lack of Scary Terry or\r\n    JJeffs was a tough break. Hendoggy is nice, Carter is rising, and Kamara\r\n    has been inconsistent so far. But Jase gets an elite RB to pair with Henry,\r\n    making him a top threat to win the league.\r\n</p>\r\n<p>\r\n    <strong>Trade #2:</strong>\r\n</p>\r\n<p>\r\n    Nooni: Tony Pollard (Grade: B)\r\n</p>\r\n<p>\r\n    JL: Allen Robinson (Grade: B-)\r\n</p>\r\n<p>\r\n    I don’t think this trade will really impact much, but Arob has sucked and\r\n    Nooni gets a solid RB who can fill in for byes/injuries. Nice to see a\r\n    Bears player on JL’s roster though.\r\n</p>\r\n<p>\r\n    <strong>Trade #3:</strong>\r\n</p>\r\n<p>\r\n    Nooni: Kenneth Gainwell, 50 FAAB (Grade: D)\r\n</p>\r\n<p>\r\n    Dmichs: Damien Harris (Grade: B-)\r\n</p>\r\n<p>\r\n    I don’t trust New England RBs ever, but this was just dumb for Nooni.\r\n</p>\r\n<p>\r\n    <strong>Trade #4:</strong>\r\n</p>\r\n<p>\r\n    Jart: Davante Adams (Grade: A-)\r\n</p>\r\n<p>\r\n    Brad: Brandin Cooks, Cordarelle Patterson (Grade: B+)\r\n</p>\r\n<p>\r\n    The winner won’t be determined until the end of the season. Jart needed an\r\n    elite player to put him in contention, but gave up some valuable assets to\r\n    do so. With Tyrod Taylor returning, if Cooks and Patterson keep up their\r\n    level of play, Brad will walk away as the winner of this trade.\r\n</p>\r\n    <h3>Record by PF Finish</h3>\r\n\r\n<p>\r\n    1st: 6-0\r\n</p>\r\n<p>\r\n    2nd: 5-1\r\n</p>\r\n<p>\r\n    3rd: 4-2\r\n</p>\r\n<p>\r\n    4th: 4-2\r\n</p>\r\n<p>\r\n    5th: 5-1\r\n</p>\r\n<p>\r\n    6th: 3-3\r\n</p>\r\n<p>\r\n    7th: 4-2\r\n</p>\r\n<p>\r\n    8th: 2-4\r\n</p>\r\n<p>\r\n    9th: 1-5\r\n</p>\r\n<p>\r\n    10th: 1-5\r\n</p>\r\n<p>\r\n    11th: 1-5\r\n</p>\r\n<p>\r\n    12th: 0-6\r\n</p>\r\n<p>\r\n    We are starting to see things begin to even out as one expects. I know that\r\n    the most accurate results come from Roto, whatever, but I do still believe\r\n    that the H2H system works pretty dang well throughout the course of the\r\n    entire season. 7th obviously remains an outlier right now, but even that is\r\n    experiencing the expected regression.\r\n</p>\r\n\r\n    <h3>Power Rankings:</h3>\r\n\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (6-0)\r\n    </li>\r\n    <li>\r\n        Jason (3-3)\r\n    </li>\r\n    <li>\r\n        Jart (3-3)\r\n    </li>\r\n    <li>\r\n        Folbe (3-3)\r\n    </li>\r\n    <li>\r\n        Dmichs (3-3)\r\n    </li>\r\n    <li>\r\n        CJ (3-3)\r\n    </li>\r\n    <li>\r\n        Aross (4-2)\r\n    </li>\r\n    <li>\r\n        NN (2-4)\r\n    </li>\r\n    <li>\r\n        Bank (3-3)\r\n    </li>\r\n    <li>\r\n        Brad (2-4)\r\n    </li>\r\n    <li>\r\n        MW (3-3)\r\n    </li>\r\n    <li>\r\n        Nooni (1-5)\r\n    </li>\r\n</ol>\r\n<p>\r\n    No debating.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n\r\n    <h3>Worst Possible Lineup </h3>\r\n<p>\r\n    Here we will look at the worst combination of starters in this league!\r\n</p>\r\n<p>\r\n    QB: Taylor Heinicke, 9.28 points, NN\r\n</p>\r\n<p>\r\n    RB: Miles Gaskin, 2.4 points, Aross\r\n</p>\r\n<p>\r\n    RB: Nyheim Hines, 2.7 points, Jase\r\n</p>\r\n<p>\r\n    WR: Tyler Boyd, 1.2 points, Brad\r\n</p>\r\n<p>\r\n    WR: Chase Claypool, 2.7 points, MW<strong></strong>\r\n</p>\r\n<p>\r\n    TE: Robert Tonyan, 2.0 points, Jase\r\n</p>\r\n<p>\r\n    FLEX: Antonio Gibson, 3.4 points, Brad\r\n</p>\r\n<p>\r\n    D/ST: Denver D/ST, -2 points, Brad\r\n</p>\r\n<p>\r\n    K: Graham Gano, 1.5 points, Brad\r\n</p>\r\n<p>\r\n    <strong>Total Points: 23.18</strong>\r\n</p>\r\n<p>\r\nWould it have beaten NN:<strong>Heck no that dude popped off, no one woulda beaten him</strong>    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>New Segment: Hot Takes</strong>\r\n\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    In this segment, we get to hear from all of you. They will be anonymous for\r\n    the fun of it. The Jart Report team will be organizing them into three\r\n    categories: Takes we agree with, takes we are neutral on, and takes we\r\n    disagree with.\r\n</p>\r\n<p>\r\n    <strong>Agree:</strong>\r\n</p>\r\n<p>\r\n    -“MB, Brad, MW, Nooni are all less likely than NN to make playoffs”\r\n</p>\r\n<p>\r\n    -“NN makes the playoffs”\r\n</p>\r\n<p>\r\n    -“Noah makes a deeper run than Jonah”\r\n</p>\r\n<p>\r\n    <strong>Neutral:</strong>\r\n</p>\r\n<p>\r\n    -“JLs all Buffalo bills roster will revolutionize the way we draft in the\r\n    future”\r\n</p>\r\n<p>\r\n    -“Brad is the worst manager”\r\n</p>\r\n<p>\r\n    -“Jart is the goat”\r\n</p>\r\n<p>\r\n    - “We look back at the adams for cordarelle/cooks trade as the worst trade\r\n    in league history. Brad doesn’t win a game for the rest of the season and\r\n    it propels jart to his third* league trophy”\r\n</p>\r\n<p>\r\n    <strong>Disagree:</strong>\r\n</p>\r\n<p>\r\n    -“Folbe winning the ship”\r\n</p>\r\n<p>\r\n    -“Baltimore ravens are going to win the super bowl” (this manager didn’t\r\n    understand that this was for fantasy football)\r\n</p>\r\n<p>\r\n    -“League might not make it to next year with everything thats gone down in\r\n    the last 7 days”\r\n</p>\r\n<p>\r\n    -“Nooni should be kicked from the league.”\r\n</p>\r\n<p>\r\n    -“Nooni could actually end .500 if PA falls”\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n\r\n    <h3>On To Week Seven!</h3>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>This Week’s Matchups</strong>\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs Tompa Bay: </em></strong>\r\n    An eventful week brought no changes (so far) to these two squads, as both\r\n    enter this week off of wins in uneven performances. As we progress into the\r\n    middle of the season, byes become a major factor, and they significantly\r\n    hinder Aross this week. Without Dalvin Cook, the Gaskin-Davis stack is\r\n    tough to look at, coupled with a 2 TE set. While the A. Brown’s should both\r\n    do well and Lamar should bounce back, there just isn’t any firepower here\r\n    this week. For Bank, the Jart Report loves Arwin, Ridley, and the Bucs D/ST\r\n    this week, and expects huge days from all three. Couple with solid\r\n    performances from the rest, we like <em>Tompa Bay by 32.7.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Buffalo Bills vs Mike Williams WR1: </em></strong>\r\n    Speaking of byes, this is an historic week as JL has seven players on his\r\n    current roster on bye. Frankly, I don’t think the league can handle JL\r\n    winning without the identity of his team, the Buffalo Bills. Much like MW\r\n    playing with Younghoe Koo on bye, JL’s team has no identity without them.\r\n    It’s just Kyler and Deebo running around with a bunch of scrubs this week.\r\n    For Brad, a week of overhaul leaves a roster in limbo, as newcomers\r\n    Cordarelle Patterson and Brandin Cooks try to fill the shoes left by\r\n    Davante Adams. While we won’t be touching the QB situation here, we don’t\r\n    think it should matter as JL simply does not have the guys to win this\r\nweek. In the lowest scoring matchup of the week, we like    <em>Mike Williams WR1 by 12.2.</em>\r\n</p>\r\n<p>\r\n    <strong><em>NN vs Team Horses: </em></strong>\r\n    Assuming NN fields a roster this week, with Najee Harris on bye, Khalil\r\n    Herbert is thrust into the RB2 spot in a very difficult matchup against the\r\n    Buccaneers. While Cooper Kupp brings a very nice matchup against the Lions,\r\n    we do not expect him to do as much damage as one might expect with the Rams\r\n    expected to be up big early, and perhaps looking to other options like Van\r\n    Jefferson. For Folbe, Allen and Zeke on bye means he is playing without two\r\n    of his most consistent contributors. DK and Tee have both struggled with\r\n    their current situations, but we expect both to perform better this week\r\n    and for Waddle to continue his connection with Tua. Ultimately, it is the\r\n    play of Ryan Tannehill in a revenge game against his former manager that\r\nputs Folbe on top in a real tough matchup to watch. We like    <em>Team Horses by 5.6.</em>\r\n</p>\r\n<p>\r\n    <strong><em>United Nations vs Dmichs: </em></strong>\r\n    While the on-and-off Dak-Amari connection is taking the week off to rest\r\n    and recuperate, there is still quite a lot to like fantasy wise from this\r\n    Taylor and Kelce led squad. Josh Jacobs and Hollywood Brown have both\r\n    flashed at times, although Josh Jacobs certainly leaves a lot to be desired\r\n    in the efficiency department. Newcomer Damien Harris should feast, but who\r\n    knows with Patriots RBs. For MW, Koo is back, but Robinson and Herbert are\r\n    out. While Darren Waller should have an elite day, Devontae Booker and\r\nRondale Moore are simply not trustworthy options, and so we like    <em>Dmichs by 17.6</em>.\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>GRIDDY GANG vs I Got a Half Chubb: </em></strong>\r\n    There is not much to say here other than that Derrick Henry faces Kansas\r\n    City and Alvin Kamara faces Seattle. Coupled with what should be bounceback\r\n    days from Darnold and McLaurin, and Jason should lead the league in points\r\n    this week even with the Griddy King himself on bye. Without Chubb and Dmont\r\n    once again and Thielen on bye, CJ does not have the firepower to compete in\r\n    this one. We like <em>GRIDDY GANG by 40.6.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Real Brothers vs Nooni: </em></strong>\r\n    This one should be closer than many of the experts have been saying. While\r\n    Nooni did lose again last week, he showed encouraging signs that had not\r\n    been too evident through the first five weeks. Chuba and Darrell form a\r\n    nice backfield, and the Tampa boys should perform better this week, along\r\n    with LockettE. Stafford is of course the big storyline here as he faces the\r\n    Lions, and how they chose to use him throughout the game could be the\r\n    difference maker. For Jart, RB is a bit of a tough spot until Saquon\r\n    Barkley can return, but the strength of this team now of course lies in the\r\n    Tyreek-Davante-Ja’Marr receiving trio. We like a lot of points to be scored\r\n    in this one, and we think ultimately the x-factor is the tight end\r\n    position. Both Gesicki and Pitts have shown the ability to put up a lot of\r\n    points and they face each other. This week, we like Kyle Pitts to build off\r\nof his London performance and outperform Gesicki, and so we have    <em>Real Brothers by 7.2.</em>\r\n</p>\r\n\r\n    <h3>Best Player at Each Position</h3>\r\n\r\n<p>\r\n    In this segment we will predict who will have the best fantasy performance\r\n    this week at each position, along with who they are rostered by (if they\r\n    are currently rostered).\r\n</p>\r\n<p>\r\n    QB: Patrick Mahomes (40.2), It’s Complicated\r\n</p>\r\n<p>\r\n    RB: Aaron Jones (32.4), Bank\r\n</p>\r\n<p>\r\n    WR: Calvin Ridley (27.6), Bank\r\n</p>\r\n<p>\r\n    TE: Darren Waller (19.2), MW\r\n</p>\r\n<p>\r\n    D/ST: Bucs D/ST (14), Bank\r\n</p>\r\n<p>\r\n    K: Randy Bullock (9.5), Waivers\r\n</p>\r\n\r\n    <h3>Family Award</h3>\r\n\r\n<p>\r\n    Perhaps a surprise winner, this week’s award goes to Aross. He won this\r\n    week and has maintained his core family, continuing to build camaraderie as\r\n    the dubs fly in.\r\n</p>\r\n"}