{"title": "Horse Race!", "season": 2021, "week": "3", "report": "<p>\r\n    Welcome back to the Jart Report after a week three full of pain. In what\r\n    was surely one of the more entertaining MNF sweats in a while, a matchup\r\n    decided by 0.42 in our game of the week was not even the biggest sweat! We\r\n    at the Jart Report are committed to fighting through the pain to deliver\r\n    the same level of analysis our readers have come to expect.\r\n</p>\r\n<p>\r\n    <h3>Week Three Recap</h3>\r\n</p>\r\n<p>\r\n    To start, we are going to be looking back at how week three unfolded versus\r\n    the predictions that the Jart Team put together. The team strives to learn\r\n    from previous weeks to make the most informed predictions, but this early\r\n    in the season still expects to be quite inaccurate. We will go matchup by\r\n    matchup and look at what we learned as the season begins to take shape.\r\n</p>\r\n<p>\r\n    <strong><em>Team Horses vs Real Brothers:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Real Brothers by 11.4\r\n</p>\r\n<p>\r\n    Reality: Team Horses by 1.38\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        A team that almost collapsed last week versus a team that has struggled\r\n        mightily to get off the ground this year could provide us with our most\r\n        surprising matchup of the week. While stars like Josh Allen and DK\r\n        Metcalf have yet to perform as expected for Folbe, expect them to get\r\n        going this week. DK saw 11 targets last week, and an extremely\r\n        favorable matchup against Minnesota should spell a ginormous day (30+\r\n        points), especially considering that Jart’s sons always pop against\r\n        him. This one will most certainly come down to Monday night, as Jalen\r\n        Hurts and Miles Sanders face off against Ezekiel Elliott. Folbe will be\r\n        holding the lead going into that time, but will Jart be able to make\r\n        the comeback on the wings of his Eagles? Bounceback play from Tyreek\r\n        Hill and D’Andre Swift, along with the potential breaking out of Saquon\r\n        Barkley makes us think it is likely. Until Folbe proves he can perform\r\n        we will struggle to pick him, so for now we take Real Brothers by 11.4.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: The loss of Jerry Jeudy continues to be felt for Team Horses\r\n    as they continue to struggle to find consistent WR play beyond DK Metcalf,\r\n    Josh Allen and Metcalf did certainly get going this week, combining for\r\n    56.92 points. The story of the week was the resurgence of Ezekiel Elliott,\r\n    the much maligned RB who finally had the night owners have been waiting for\r\n    over a season to see. For Jart, there was a ton to like about this week.\r\n    Hurts continued to show his high floor even on a bad night, Saquon looked\r\n    explosive, Swift continued to show his versatility as a pass catcher,\r\n    Brandin Cooks and Ja’Marr Chase continued their elite production, and the\r\n    defense and kicker remained rock solid. Backup running backs Nyheim Hines\r\n    and Cordarelle Patterson also put forth encouraging efforts. Disappointing\r\n    efforts from Tyreek Hill once again and the lack of involvement for Kyle\r\n    Pitts ultimately spelled doom for this team. Until the Chiefs decide to\r\n    stop losing and start including Tyreek again, Tyreek’s locked down roster\r\n    spot will continue to be a thorn in the side of this team currently firing\r\n    at (almost) all cylinders. Real Brothers can’t afford to dwell on this loss\r\n    with a matchup against 3-0 Aross on the docket.\r\n</p>\r\n<p>\r\n    <strong><em>Team Ross vs Team Dmichs: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team Ross by 8.4\r\n</p>\r\n<p>\r\n    Reality: Team Ross by 25.68\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        Coming off a low scoring Week Two for both teams, some favorable\r\n        matchups suggest a higher scoring affair this week. Lamar Jackson\r\n        facing off against Detroit certainly suggests good things, but\r\n        Hollywood Brown on the other side of this matchup could offset many of\r\n        those points. Dalvin Cook faces off against a Seattle defense that was\r\n        absolutely obliterated by Derrick Henry, suggesting a big day for Cook.\r\n        While Mike Davis seems to be struggling to hold off Cordarelle\r\n        Patterson from touches, AJB should bounce back along with Keenan Allen\r\n        finding the endzone. Dmichs performance will likely hinge upon the\r\n        Dak-Amari connection, which will certainly be a fun one to watch on\r\n        Monday night. The Eagles just came off a low scoring game against the\r\n        49ers, but there was yards to be had. We expect a solid game from\r\n        Dallas, but not enough to close the deficit for Dmichs. Team Ross by\r\n        8.4.\r\n    </em>\r\n</p>\r\n<p>\r\n    What we saw: While Alexander Mattison filled in admirably for Dalvin Cook\r\n    against an atrocious Seahawks defense, there was not much else to like\r\n    about either of this teams this last week. For ARoss, Lamar somewhat\r\n    surprisingly struggled to get going against the Lions, Davis continued to\r\n    surrender a large chunk of work to Patterson, AJB suffered an early injury,\r\n    and Noah Fant was barely utilized. For Dmichs, Travis Kelce and Dak looked\r\n    good. But that’s about all you can say for a team that is quickly pushing\r\n    NN for the worst team so far. Odell looked good in his return, and\r\n    Hollywood has the potential to be a WR1 if he could catch. So while there\r\n    is certainly hope for both teams, there was not much to write home about in\r\n    this matchup.\r\n</p>\r\n<p>\r\n    <strong><em>Nooni vs Tompa Bay:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Tompa Bay by 7.6\r\n</p>\r\n<p>\r\n    Reality: Tompa Bay by 1.86\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        At this point in the season, we are not sure what to make of these two\r\n        clubs. Bank exploded for 146 in the loss this last week, while Nooni\r\n        bounced back with a much needed win. While Kamara should be greatly\r\n        improved this week after being a non-factor against Carolina, Tyler\r\n        Lockett likely will concede yards and touches to DK Metcalf this week,\r\n        while Mike Evans will likely draw Jalen Ramsey this week. In what we\r\n        expect to be a rather low scoring game, it is the play of Robert Woods\r\n        and Calvin Ridley that gets Bank the victory this week by 7.6.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: History. The longest field goal in NFL history ultimately made\r\n    the difference in this one, with those 5 points catapulting Bank to\r\n    victory, when not even 3 points would have won it for him. Brady continued\r\n    to play at a high level, while Aaron Jones turned in another solid\r\n    performance. The rest of the team is riddled with question marks, and\r\n    currently shows the signs of the 146 outburst being the exception rather\r\n    than the norm. For Nooni, solid efforts from Stafford, Kamara, and Evans\r\n    were wasted as no other player mustered over 5.1 points this week. Chuba\r\n    Hubbard has the potential to become a solid RB2 for a couple of weeks here\r\n    though, which could be the spark Nooni needs.\r\n</p>\r\n<p>\r\n    <strong><em>Team ACL Tear vs GRIDDY GANG:</em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Team ACL Tear by 3.7\r\n</p>\r\n<p>\r\n    Reality: Team ACL Tear by 0.42\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        The undisputed two best teams so far this season, we are treated to an\r\n        exciting early season matchup that should bring the points. There is a\r\n        lot to like on both sides of this matchup, with Russell Wilson and\r\n        Kyler Murray both drawing favorable matchups. The difference in this\r\n        matchup this week ends up being at the RB spot, which brings a bit of a\r\n        surprise this week. After King Henry’s explosion last week, look for a\r\n        talented Colts defense to hone in on stopping the run, forcing\r\n        Tannehill to throw and AJB to step up his play. Darrell Henderson’s\r\n        injury lingers, and extremely favorable matchups for the pass catching\r\n        Ekeler against the Chiefs and Ty’Son Williams against the Lions should\r\n        bring good production for Lopey, depending on how Baltimore cycles the\r\n        RBs. The WRs will be fun to watch in this one, but should end up near a\r\n        wash. In the highest scoring matchup of this week, we like Team ACL\r\n        Tear to win by 3.7.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: While the points did not come as expected, this matchup did\r\n    bring the cardio as both teams got in a good sweat on MNF. A screen pass to\r\n    CeeDee Lamb ultimately secured the victory for JL, as he is off to an\r\n    impressive 3-0 start despite subpar play from his wide receivers this week.\r\n    After one week his trade with NN to acquire CEH is looking brilliant, as\r\n    Clyde garnered 19 touches this week for 109 yards and a TD (although he\r\n    fumbled once again). Kyler found the endzone with his legs once again\r\n    despite only rushing for 19 yards, and Austin Ekeler continues to impress\r\n    after shooting up draft boards this offseason. For Jase, the complete\r\n    disappearance of the Seattle offense in the second half was too much to\r\n    overcome as Russell Wilson turned in a below-average performance. One would\r\n    have expected Terry McLaurin to be more involved with Washington trailing\r\n    all day, but nonetheless this team still performed well in the absence of\r\n    Darrell Henderson Jr, and we expect them to get back on track next week.\r\n</p>\r\n<p>\r\n    <strong><em>Mike Williams WR1 vs NN: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: Mike Williams WR1 by 12.2\r\n</p>\r\n<p>\r\n    Reality: Mike Williams WR1 by 53.56\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        Brad comes into this one in deep need of a win, while NN just picked up\r\n        his first win despite only scoring 83 points. While Gibson and Hunt\r\n        have been inconsistent at best so far this season, we expect the Sunday\r\n        night matchup of Green Bay and San Francisco to be a high scoring one,\r\n        suggesting good things for Davante Adams and George Kittle. Mike\r\n        Williams should also get plenty of work against the Chiefs as one would\r\n        expect the Chargers to be trailing early and often. Tannehill and Mixon\r\n        both have tough defenses this week, while CEH continues to exhibit\r\n        early season struggles. If Najee and Kupp can repeat similar\r\n        performances to last week NN will be right there in this one, but as of\r\n        right now that feels too unlikely to count on to that degree. Brad gets\r\n        his first win by 12.2.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Some things certainly shifted before this matchup took place,\r\n    most notably the trade of CEH, but nothing could have helped NN on this\r\n    day. Explosive performances from Mike Williams and Davante Adams paced this\r\n    team, coupled with solid days from Mahomes, Gibson, Kittle, and the Denver\r\n    D/ST. Kareem Hunt popped off on the bench because Brad seems to think\r\n    Kenyan Drake is a viable fantasy option ever and worth $60 FAAB, but\r\n    nonetheless Brad rolled easily in this one. For NN, he could not shake the\r\n    moniker of worst team so far, as Kupp continues to be the team, although\r\n    Najee Harris’ performance was encouraging (The Jart Report sees his heavy\r\n    pass work as an aberration though given the injuries suffered to the\r\n    Steelers WR corps). Not much has gone right yet for NN, but the Jart Report\r\n    is proud to note that while NN is averaging almost 30 points less per game\r\n    than Jart, they have the same record.\r\n</p>\r\n<p>\r\n    <strong><em>I Got a Half Chubb vs United Nations: </em></strong>\r\n</p>\r\n<p>\r\n    Prediction: United Nations by 14.2\r\n</p>\r\n<p>\r\n    Reality: United Nations by 19.9\r\n</p>\r\n<p>\r\n    What we said:\r\n    <em>\r\n        A fun matchup for this week, two 1-1 teams with different stories so\r\n        far this year face off. CJ has outscored MW by 46 points through 2\r\n        weeks, but tougher matchups for CJ leave these clubs both at .500.\r\n        While CJ has been the better team this year, MW comes into this one\r\n        with some extremely enticing matchups. Herbert against Kansas City,\r\n        Caff against Houston, and Javonte Williams against the Jets could\r\n        provide a lot of points for a team that has struggled to find them this\r\n        year. Look for Herbert to get back on track in a shootout, Caff to\r\n        translate his absurd touch amount into 2-3 TDs this week, and Javonte\r\n        to begin to take over the backfield in Denver. The health of Diontae\r\n        Johnson is a lingering question mark for CJ this week, and there are\r\n        some tough matchups this week for a team that has found success early.\r\n        While we expect CJ to have the better season, we have MW by 14.2 this\r\n        week.\r\n    </em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    What we saw: Besides the injury to McCaffrey, this one went pretty much\r\n    exactly as predicted. I’m just built different guys. That’s all.\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>Yards to TD Ratio</h3>\r\n</p>\r\n<p>\r\n    <strong>Yards to TD ratio </strong>\r\n    is back. We will be looking at the 2 RB, 2 WR, 1 TE, and FLEX position only\r\n    (ignoring QBs), and will be calculated by taking total yards and dividing\r\n    by touchdowns scored.\r\n</p>\r\n<p>\r\n    <strong>United Nations: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 551 yards / 1 TD = 551 (1st)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 486 yards / 2 TD = 243 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 453 yards / 1 TD = <strong>453 (2nd)</strong>\r\n</p>\r\n<p>\r\n    <strong>I Got a Half Chubb:</strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 450 yards / 8 TDs = 56.25 (12th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 432 yards / 3 TDs = 144 (6th)</em>\r\n</p>\r\n<p>\r\n    This Week: 392 yards / 1 TD = <strong>392 (3rd)</strong>\r\n</p>\r\n<p>\r\n    <strong>Real Brothers: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 528 yards / 1 TD = 528 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 371 yards / 2 TD = 185.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 485 yards / 4 TDs = <strong>121.3 (10th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Horses: </strong>\r\n</p>\r\n<p>\r\n    <strong><em> </em></strong>\r\n    <em>Week One: 376 yards / 3 TDs = 125.33 (9th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 334 yards / 4 TDs = 83.5 (9th)</em>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    This Week: 412 yards / 5 TDs = <strong>82.4 (12th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Ross: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 514 yards / 3 TDs = 171.33 (6th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 395 yards / 1 TD = 395 (2nd)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 383 yards / 1 TD = <strong>383 (4th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team Dmichs: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 542 yards / 9 TDs = 60.22 (11th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 345 yards / 3 TDs = 115 (8th)</em>\r\n</p>\r\n<p>\r\n    This Week: 368 yards / 0 TDs =<strong> Infinity (1st)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team NN: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 427 yards / 2 TDs = 213.5 (4th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 422 yards / 3 TDs = 140.67 (7th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 395 yards / 2 TDs = <strong>197.5 (8th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Mike Williams WR1: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 371 yards / 1 TD = 371 (3rd)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 408 yards / 1 TD = 408 (1st)</em>\r\n</p>\r\n<p>\r\n    This Week: 552 yards / 5 TDs = <strong>110.4 (11th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Nooni: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 270 yards / 2 TDs = 135 (8th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 399 yards / 5 TDs = 79.8 (10th)</em>\r\n</p>\r\n<p>\r\n    This Week: 320 yards / 1 TD = <strong>320 (6th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Tompa Bay: </strong>\r\n</p>\r\n<p>\r\n    <strong> </strong>\r\n    <em>Week One: 339 yards / 2 TDs = 169.5 (7th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 405 yards / 6 TDs = 67.5 (12th)</em>\r\n</p>\r\n<p>\r\n    <em> </em>\r\n    This Week: 327 yards / 1 TD = <strong>327 (5th)</strong>\r\n</p>\r\n<p>\r\n    <strong>Team ACL Tear: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 428 yards / 5 TDs = 85.6 (10th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 502 yards / 3 TDs = 167.33 (5th)</em>\r\n</p>\r\n<p>\r\n    This Week: 450 yards / 2 TDs = <strong>225 (7th)</strong>\r\n</p>\r\n<p>\r\n    <strong>GRIDDY GANG: </strong>\r\n</p>\r\n<p>\r\n    <em>Week One: 410 yards / 2 TDs = 205 (5th)</em>\r\n</p>\r\n<p>\r\n    <em>Week Two: 605 yards / 8 TDs = 75.63 (11th)</em>\r\n</p>\r\n<p>\r\n    This Week: 440 yards / 3 TDs = <strong>146.7 (9th)</strong>\r\n</p>\r\n<p>\r\n    I’m wrestling with the longevity of this stat as it seems to generally just\r\n    confirm that we could have guessed - teams that score more TDs (and thus\r\n    have lower ratios) score more points. But for now I enjoy it for its\r\n    tracking throughout the season, and for comparison for each matchup. Ratios\r\n    were much higher this week, reflected in the lower scores across the board.\r\n    Meanwhile, MW continues to pace the league in inability to find the endzone\r\n    (4 TDs total) and Folbe continues to find the endzone at an absurd rate (12\r\n    TDs total). Closer ratios in matchups this week also certainly helps\r\n    explain why we saw so many close games!\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>Lineup Efficiency</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Brad (164.4) → <strong>89.5%</strong> (Last week 85.8%)\r\n    </li>\r\n    <li>\r\n        Folbe (152.62) → <strong>89.1%</strong> (Last week 95.7%)\r\n    </li>\r\n    <li>\r\n        Jart (144.74) → <strong>93.6%</strong> (Last week 94.9%)\r\n    </li>\r\n    <li>\r\n        MW (124.84) → <strong>85.8%</strong> (Last week 100%)\r\n    </li>\r\n    <li>\r\n        Aross (121.08) → <strong>84.3%</strong> (Last week 94.4%)\r\n    </li>\r\n    <li>\r\n        JL (120.94) → <strong>86.0%</strong> (Last week: 83.4%)\r\n    </li>\r\n    <li>\r\n        NN (115.34) → <strong>81.1%</strong> (Last week 76.6%)\r\n    </li>\r\n    <li>\r\n        Nooni (108.52) → <strong>78.8%</strong> (Last week 98.8%)\r\n    </li>\r\n    <li>\r\n        Bank (103.98) → <strong>84.0%</strong> (Last week 91.7%)\r\n    </li>\r\n    <li>\r\n        Jason (103.62) → <strong>100%</strong> (Last week 100%)\r\n    </li>\r\n    <li>\r\n        CJ (102.34) → <strong>85.2%</strong> (Last week 88.5%)\r\n    </li>\r\n    <li>\r\n        Dmichs (79.92) → <strong>95.6%</strong> (Last week: 82.7%)\r\n    </li>\r\n</ol>\r\n<p>\r\n    After being 12th in most points possible each of the first two weeks, Folbe\r\n    shot up to 2nd this week, much to the joy of the Jart Report. Also, how is\r\n    NN consistently this bad at choosing lineups? It’s baffling. Jase once\r\n    again plays his best lineup, but given that only one of his bench players\r\n    scored more than 4 points, the lack of depth is a potential concern to\r\n    watch. Jart shoulda known, bench Tyreek Hill for Nyheim Hines. What a fool.\r\n    And for Dmichs, just a disgustingly bad performance all around.\r\n</p>\r\n<p>\r\n    <h3>Transaction Analysis</h3>\r\n</p>\r\n<p>\r\n    In this segment we will look at the transactions from this week and rate\r\n    the best and worst one in the opinion of the Jart Report.\r\n</p>\r\n<p>\r\n    <strong>Best Transaction: </strong>\r\n    Jonah Lopas, Emmanuel Sanders, $0. While perhaps this performance was\r\n    nothing more than a flash in the pan as the whole Bills offense popped off\r\n    (including league favorite Zack Moss), Emmanuel Sanders had 23.9 points\r\n    after JL paid nothing for him. Does it fill the void left from dropping\r\n    Mike Williams? Not quite yet.\r\n</p>\r\n<p>\r\n    Honorable Mention: Jart, Cordarelle Patterson, $19.\r\n</p>\r\n<p>\r\n    <strong>Worst Transaction:</strong>\r\n    This feels like a three way tie between $22 for Rondale Moore, $8 for KJ\r\n    Osborn, and acquiring Quintez Cephus. So basically, do better MW.\r\n</p>\r\n<p>\r\n    Honorable mention: Nooni, Raiders D/ST, $6.\r\n</p>\r\n<p>\r\n    <strong>New Segment: Record by PF Finish</strong>\r\n</p>\r\n<p>\r\n    This one seems pretty self explanatory, but we at the Jart Report want to\r\n    start tracking the record on the season of each PF finish spot. If you’re\r\n    confused, it’ll make sense soon:\r\n</p>\r\n<p>\r\n    1st: 3-0\r\n</p>\r\n<p>\r\n    2nd: 2-1\r\n</p>\r\n<p>\r\n    3rd: 1-2\r\n</p>\r\n<p>\r\n    4th: 2-1\r\n</p>\r\n<p>\r\n    5th: 3-0\r\n</p>\r\n<p>\r\n    6th: 1-2\r\n</p>\r\n<p>\r\n    7th: 3-0\r\n</p>\r\n<p>\r\n    8th: 1-2\r\n</p>\r\n<p>\r\n    9th: 1-2\r\n</p>\r\n<p>\r\n    10th: 0-3\r\n</p>\r\n<p>\r\n    11th: 1-2\r\n</p>\r\n<p>\r\n    12th: 0-3\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Personally, the most entertaining thing here for me is that the team who\r\n    finished 2nd in PF each week has played the #3, #1, and #3 scorer in those\r\n    weeks. RIP Jart, who is 0-2 as the #3 scorer, having faced the #2 each of\r\n    those weeks. And I guess just shoot for 7th in PF each week, because\r\n    although those teams would be 0-3 in Top 6, they’re 3-0 this season. We at\r\n    the Jart Report still love matchups though, they are the heartbeat of\r\n    fantasy football.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <h3>New Segment: Most Encouraging &amp; Concerning</h3>\r\n</p>\r\n<p>\r\n    In this segment, we will look at every team, and list the thing we are most\r\n    encouraged by for them moving forward, and the thing we are most concerned\r\n    about as the season unfolds.\r\n</p>\r\n<p>\r\n    <strong>Team Ross:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Opportunity for explosion.</strong> With Lamar,\r\n    Dalvin Cook, and Keenan Allen, there is a lot of opportunity for this team\r\n    to put up big point numbers if the stars align.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>WR play.</strong> Outside of Keenan Allen (who\r\n    even himself is being outpaced by Mike Williams so far), the combination of\r\n    injuries and uneven performances from AJB and AB leave a question. Can\r\n    Sammy Watkins help fill those role as well? Potentially, but we’ll need to\r\n    see it first.\r\n</p>\r\n<p>\r\n    <strong>Team Dmichs:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Travis Kelce.</strong> Really the lone consistent\r\n    bright spot so far.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>RB play.</strong> This team is down bad. Jonathan\r\n    Taylor hasn’t scored, Singletary has been extremely ineffective, and Josh\r\n    Jacobs is battling injury after a very ineffective first week himself.\r\n    Something needs to change at the RB spot.\r\n</p>\r\n<p>\r\n    <strong>Team NN:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Cooper Kupp.</strong> Najee Harris has the\r\n    potential to be listed here in the future if he can maintain his pass\r\n    catching prowess, but so far Cooper Kupp has been doing everything he can\r\n    to keep NN afloat, averaging 26 PPG.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>About everything else.</strong> There’s potential\r\n    at most spots here including RB, but QB and TE questions are certainly\r\n    present, and the Pittsburgh D/ST has not lived up to their performance from\r\n    last season so far.\r\n</p>\r\n<p>\r\n    <strong>Team Horses: </strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Breakouts.</strong> Josh Allen and Ezekiel\r\n    Elliott both scored more in Week Three than they had in the first two weeks\r\n    combined, and these level of performances will keep Folbe from being near\r\n    the bottom of the league as he had been going into Week Three.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>FLEX.</strong> While Tee Higgins likely returns\r\n    nicely into the WR2 role for this team, the FLEX spot continues to be a\r\n    major question mark with Jerry Jeudy out.\r\n</p>\r\n<p>\r\n    <strong>Real Brothers:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Consistency.</strong> This team scored 135.54\r\n    points without any player scoring more than 20.54 points this season. Six\r\n    players chipped in at least 16.2, and even the kicker has been the #2 in\r\n    Fantasy so far this season. Coupled with encouraging bench play, this team\r\n    seems to be built to last and compete weekly.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>Lack of explosion.</strong> Tyreek and Hurts so\r\n    far have been the only players that have shown they can explode for 30\r\n    point outings, something needed to compete at the top. Tyreek can’t even\r\n    score 8 these days, and without big point totals, this team won’t compete\r\n    for a championship.\r\n</p>\r\n<p>\r\n    <strong>Mike Williams WR1: </strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>WR play.</strong> Mike Williams and Davante Adams\r\n    look like the top WR duo in the league right now, although Davante Adams\r\n    seems much more likely to maintain such production. A well rounded team\r\n    coming off a major performance is certainly encouraging.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>RB2/FLEX.</strong> Kenyan Drake and Kareem Hunt\r\n    both offer high volatility in tough to predict timeshare roles. Tyler\r\n    Boyd’s role will decrease with Tee back and Ja’Marr Chase playing at such a\r\n    high level, and Kenny Golladay has yet to get much going.\r\n</p>\r\n<p>\r\n    <strong>I Got A Half Chubb:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Weeks One &amp; Two.</strong> While this last\r\n    week was certainly a struggle, this team has shown it can put up points,\r\n    and has the names to make noise. Getting Diontae Johnson back will be\r\n    helpful.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>RB2.</strong> After a strong week one, RIP DMONT\r\n    has struggled to find success. Melvin Gordon has provided production so\r\n    far, but most thinking has been that he will continue to concede his role\r\n    to Javonte Williams over time.\r\n</p>\r\n<p>\r\n    <strong>United Nations:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>James Robinson’s Week Three.</strong> This was\r\n    the week the 25th overall pick needed after looking like a major bust\r\n    through the first two weeks. Jacksonville is terrible once again, and this\r\n    seems to benefit the tailback that will need to shoulder the load with\r\n    McCaffrey out.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>Firepower without McCaffrey.</strong> Not sure\r\n    this team can score enough points without its star player, especially when\r\n    already averaging under 100 PPG.\r\n</p>\r\n<p>\r\n    <strong>Tompa Bay:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Tom Brady.</strong> For the 44 year old to be QB1\r\n    through 3 weeks is quite impressive, thanks in large part to some shootouts\r\n    and the receiving corps certainly, but nonetheless great production on what\r\n    is looking to be a draft steal.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>Yardage.</strong> Not only did Bank’s players\r\n    struggle to score TDs this last week, they didn’t have many yards either.\r\n    Offensive inclusion is a potential question mark for some of these\r\n    starters.\r\n</p>\r\n<p>\r\n    <strong>Nooni:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>Stafford &amp; Kamara.</strong> This has every\r\n    making of being a solid 1-2 punch for Nooni’s team, as both look set to\r\n    produce consistent solid efforts week in and week out.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>RB2 once McCaffrey returns.</strong> While Chuba\r\n    should provide solid RB2 numbers in McCaffrey’s absence, he will return to\r\n    fantasy irrelevance after that, and Damien Harris has not shown that he can\r\n    be an RB2.\r\n</p>\r\n<p>\r\n    <strong>GRIDDY GANG:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>The Griddy King is heating up.</strong> After a\r\n    slower start, Justin Jefferson is starting to find his groove, which will\r\n    help this team maintain consistent production and compete at the top of the\r\n    league.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>Depth.</strong> Right now, not a big concern. But\r\n    a bench that combined to score under 13 points is not a great sign come bye\r\n    weeks and potential injuries down the road.\r\n</p>\r\n<p>\r\n    <strong>Team ACL Tear:</strong>\r\n</p>\r\n<p>\r\n    Most Encouraging: <strong>CEH bounceback.</strong> In what could prove to\r\n    be the most lopsided non-collusion trade we’ve seen, CEH looked like a\r\n    major part of the Chiefs offense this week, and could prove to be a great\r\n    RB2 for a team that badly needed one.\r\n</p>\r\n<p>\r\n    Most Concerning: <strong>TE production.</strong> This might sound crazy\r\n    since Gronk is currently TE2, but realistically his TD luck will not\r\n    continue, and he’s battling injury issues already.\r\n</p>\r\n<p>\r\n    <h3>Power Rankings</h3>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        JL (3-0)\r\n    </li>\r\n    <li>\r\n        Jason (2-1)\r\n    </li>\r\n    <li>\r\n        Aross (3-0)\r\n    </li>\r\n    <li>\r\n        MW (2-1)\r\n    </li>\r\n    <li>\r\n        Jart (1-2)\r\n    </li>\r\n    <li>\r\n        Brad (1-2)\r\n    </li>\r\n    <li>\r\n        CJ (1-2)\r\n    </li>\r\n    <li>\r\n        Bank (1-2)\r\n    </li>\r\n    <li>\r\n        Folbe (1-2)\r\n    </li>\r\n    <li>\r\n        Nooni (1-2)\r\n    </li>\r\n    <li>\r\n        Dmichs (1-2)\r\n    </li>\r\n    <li>\r\n        NN (1-2)\r\n    </li>\r\n</ol>\r\n<p>\r\n    No debating.\r\n</p>\r\n<p>\r\n    <h3>On To Week Four!</h3>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    It is now time to preview this week’s matchups!\r\n</p>\r\n<p>\r\n    <strong><em>Mike Williams WR1 vs Team Dmichs: </em></strong>\r\n    A matchup that would have been decided by over 70 points last week, these\r\n    teams come in with very different levels of momentum. All signs point to\r\n    Brad winning easily, but we at the Jart Report do not see this one going\r\n    down that way. We expect Dak and Amari to reestablish their Week One\r\n    connection against a solid but not unbeatable Carolina defense, while\r\n    Jonathan Taylor has the potential for a big day against a Miami defense\r\n    that was just torched by Payton Barber, while Devin Singletary and Odell\r\n    Beckham Jr. both have very favorable matchups. Travis Kelce should cancel\r\n    out much of Mahomes, and the Jart Report is skeptical on Elijah Mitchell\r\nand Kareem Hunt. In what we expect to be a fairly high scoring matchup,    <em>we like Dmichs by 7.2.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Tompa Bay vs N N: </em></strong>\r\n    While we will keep a watchful eye on what NN does in the QB department this\r\n    week (Jart Report’s best guess is Baker Mayfield), the Jart Report sees a\r\n    lot more to like on the Tompa Bay side. While both teams are in need of a\r\n    win after rough starts to the season (outside of Week 2 for Bank), we\r\n    expect some regression from Cooper Kupp this week as teams begin to really\r\n    key in on making someone else (Robert Woods) beat them through the air. Joe\r\n    Mixon should have a good night on TNF against the lowly Jaguars, but\r\n    expectations are somewhat tampered for Marvin Jones Jr and Courtland Sutton\r\n    this week. Tom Brady should have a monster game against his old team, while\r\n    Chase Edmonds, Calvin Ridley, and Julio Jones all draw favorable matchups.\r\nThis likely won’t be the highest scoring matchup of the week, but we like    <em>Tompa Bay by 9.8.</em>\r\n</p>\r\n<p>\r\n    <strong><em>I Got A Half Chubb vs Team Horses: </em></strong>\r\n    Two teams currently trending in different directions after Week Three, CJ\r\n    will be looking to get back on track while Folbe looks to keep up the high\r\n    scoring momentum. Josh Allen is faced with a highly enticing matchup\r\n    against the Texans, while DK draws a SF defense that was just torched by\r\n    Davante Adams. For CJ, Chubb and Dmont draw favorable games against\r\n    Minnesota and Detroit respectively. While the RB production should be good,\r\n    we are weary about the potential tough matchups at QB and TE, while we are\r\n    in a wait and see approach on how Diontae Johnson returns from injury.\r\n    While we could see this game going either way, continued high level\r\nperformance from some key players propel Folbe, as we have    <em>Team Horses by 11.6.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Team ACL Tear vs Nooni: </em></strong>\r\n    This is our prediction for blowout of the week. We do like what Nooni is\r\n    working towards here and the team receives a big boost from McCaffrey’s\r\n    injury, and we expect bounceback days from Allen Robinson and Tyler\r\n    LockettE. For JL, Kyler Murray looks to find the endzone through the air\r\n    this week after failing to do so last week, while Diggs and Deebo both draw\r\n    favorable matchups. I bet you thought I was gonna say this was gonna be a\r\n    blowout win for Lopey. But in what will probably ruin the integrity of the\r\n    Jart Report and make us look like idiots come next week, we are calling a\r\n    breakout week from Nooni and some struggles from JL. In a pick we want to\r\n    hide from, <em>we like Nooni by 17.1.</em>\r\n</p>\r\n<p>\r\n    <strong><em></em></strong>\r\n</p>\r\n<p>\r\n    <strong><em>GRIDDY GANG vs United Nations: </em></strong>\r\n    These are two very different 2-1 teams. As in one deserves to be 2-1 and\r\n    the other doesn’t. In the absence of Christian McCaffrey, there is simply\r\n    too much firepower on GRIDDY GANG to be overcome. A massive day from\r\n    Derrick Henry is certainly expected against the Jets, while the Griddy\r\n    receiving duo should all provide solid days to complement. DJ Moore and\r\n    James Robinson will be the guys to watch on MW’s team, to see if they can\r\ncontinue to build off of last week’s success.    <em>We like GRIDDY GANG by 13.3.</em>\r\n</p>\r\n<p>\r\n    <strong><em>Real Brothers vs Team Ross: </em></strong>\r\n    In one of the more unique matchups, we come into this one with the 1-2 team\r\n    averaging almost 13 PPG more than the 3-0 team. For Aross, Dalvin Cook is\r\n    expected to be back, which honestly does not make much of a difference and\r\n    Alexander Mattison has proven he can put up the same numbers in\r\n    replacement. After struggling with Detroit some last week, Lamar draws a\r\n    tough matchup in Denver’s D. Mike Davis and Myles Gaskin will both look to\r\n    get going this week, with Davis drawing the more favorable matchup. Antonio\r\n    Brown has been rumored to be receiving the start this week, so we will\r\n    certainly be keeping an eye on that story as it develops. For Jart, Jalen\r\n    Hurts and Miles Sanders draw Kansas City in what looks to be a big\r\n    bounceback week after struggling against the Cowboys. Ja’Marr Chase draws\r\n    the always awful Jaguars to kick off the week on TNF, while Brandin Cooks\r\n    will likely be receiving throws early and often with the Texans as massive\r\n    underdogs. The thing to watch most here is D’Andre Swift’s usage is what\r\n    will likely be a low scoring and close game throughout, as well as if\r\n    Tyreek Hill can get back to producing. We expect both of these things to\r\n    happen, and <em>we like Real Brothers by 12.9 this week.</em>\r\n</p>\r\n<p>\r\n    <em></em>\r\n</p>\r\n<p>\r\n    <h3>New Segment: Best Player at Each Position</h3>\r\n</p>\r\n<p>\r\n    In this segment we will predict who will have the best fantasy performance\r\n    this week at each position, along with who they are rostered by (if they\r\n    are currently rostered).\r\n</p>\r\n<p>\r\n    QB: Russell Wilson, Jase\r\n</p>\r\n<p>\r\n    RB: Derrick Henry, Jase\r\n</p>\r\n<p>\r\n    WR: Calvin Ridley, Bank\r\n</p>\r\n<p>\r\n    TE: Travis Kelce, Dmichs\r\n</p>\r\n<p>\r\n    D/ST: Bengals D/ST, Folbe\r\n</p>\r\n<p>\r\n    K: Robbie Gould, FA\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>"}