{"title": "Lucky Number Six", "season": 2021, "week": "1", "report": "<div>\r\n    <p>\r\n        Welcome back to the Jart Report after a thrilling week one! Despite the\r\n        personal loss to Jonah, we here are still committed to providing you\r\n        with the best analysis of a busy opening weekend.\r\n    </p>\r\n    <p>\r\n        <h3>Week One Recap</h3>\r\n    </p>\r\n    <p>\r\n        To start, we are going to be looking back at how week one unfolded\r\n        versus the predictions that the Jart Team put together. While one never\r\n        knows what to expect in week one and thus must be careful not to take\r\n        too much away, the team was pleased with their predictions vs reality.\r\n        We will go matchup by matchup and look at what we learned.\r\n    </p>\r\n    <p>\r\n        <strong><em>Team Ross </em>vs. <em>NN</em>:</strong>\r\n    </p>\r\n    <p>\r\n        <em>Prediction: Team Ross by 15</em>\r\n    </p>\r\n    <p>\r\n        <em> Reality: Team Ross by 28.52</em>\r\n    </p>\r\n    <p>\r\n        What we said:\r\n        <em>\r\n            In what I expect to be the biggest blowout of Week One, Team Ross\r\n            walks out with clearer and more proven firepower. AJB has something\r\n            to prove against his former manager, and NN’s team is more built\r\n            for Week 10 than it is Week 1.\r\n        </em>\r\n    </p>\r\n    <p>\r\n        What we saw: Team Ross brought a consistent effort across the board,\r\n        with 5 players providing at least 12.9 points and no player scoring\r\n        less than 6. While no number blows you away, this team looks built for\r\n        consistent production. Team NN left a lot to be desired, with Joe Mixon\r\n        and Cooper Kupp responsible for over half of the team’s points in week\r\n        one. Aiyuk is certainly not humming right now, as this team saw\r\n        encouraging bench production, but will need to find consistency to\r\n        avoid a slow start this season. Look for this team to acquire a WR in\r\n        the waiver wire this week to bolster their depth.\r\n    </p>\r\n    <p>\r\n        <strong><em>Team Horses vs. United Nations:</em></strong>\r\n    </p>\r\n    <p>\r\n        <strong><em> </em></strong>\r\n        <em>Prediction: Team Horses by 7</em>\r\n    </p>\r\n    <p>\r\n        <em> Reality: United Nations by 10.68</em>\r\n    </p>\r\n    <p>\r\n        <strong><em></em></strong>\r\n    </p>\r\n    <p>\r\n        What we said:\r\n        <em>\r\n            The undisputed best two teams from last season (shut up Bank),\r\n            these new look squads look just as poised to make noise this\r\n            season. While one can feel confident knowing what MW’s team will\r\n            produce, Folbe’s team provides some question marks with low floors\r\n            and high ceilings that gives this matchup great intrigue. As MW\r\n            said himself though, he doesn’t draft for Week One. And we expect\r\n            Folbe to give him all he handle off the bat.\r\n        </em>\r\n    </p>\r\n    <p>\r\n        What we saw: In a matchup closer than the final score indicated, these\r\n        two teams gave us a close but disappointing matchup. Christian\r\n        McCaffrey and Darren Waller were the only two stars who showed up in\r\n        the opening week, and their allegiance to MW was enough to win their\r\n        measuring contest with Team Horses. While never one to back down from a\r\n        sword fight, manager Gart Folbe and his team led by Josh Allen and DK\r\n        Metcalf are back to the drawing board, seeking better production from\r\n        league favorite Ezekiel Elliott. These are two teams I expect to still\r\n        be near the tops of the league this year, but they did not show up week\r\n        one. Credit MW for getting the win on an off week.\r\n    </p>\r\n    <p>\r\n        <strong><em></em></strong>\r\n    </p>\r\n    <p>\r\n        <strong><em>_ Dmichs vs praying every sunday:</em></strong>\r\n    </p>\r\n    <p>\r\n        <em>Prediction: praying every sunday by 3</em>\r\n    </p>\r\n    <p>\r\n        <em> Reality: _ Dmichs by 67.78</em>\r\n    </p>\r\n    <p>\r\n        What we said:\r\n        <em>\r\n            Nooni’s team seems best suited for early season matchups as\r\n            Mostert’s role will likely only shrink throughout the season,\r\n            whereas Dmichs looks like a team who will improve throughout the\r\n            season. While I expect _Dmichs to have the better season, Nooni\r\n            pulls off the week one win here.\r\n        </em>\r\n    </p>\r\n    <p>\r\n        What we saw: Nooni’s gonna need to start praying a lot more than just\r\n        on Sundays, especially with the loss of Raheem Mostert and no clear\r\n        viable replacement besides Damien Harris. While Nooni’s team did not\r\n        turn in a horrible effort (10th in PF), they stood no chance against a\r\n        _ Dmichs team that similar to last year has come out firing on all\r\n        cylinders. The Dak-Amari stack was in full force from the get go on\r\n        Thursday, and while this will likely not continue as the Cowboys\r\n        incorporate Zeke more against weaker run defense teams, what stood out\r\n        most were major contributions from Josh Jacobs, Marquise “Hollywood”\r\n        Brown, and Corey Davis. With two former estranged sons making up that\r\n        trio, it was perhaps an unexpected showing, but one that spells great\r\n        things for this squad if they can keep it up. Travis Kelce continues to\r\n        show that 12th overall is just too late for him to be taken, and this\r\n        team certainly looks built for a championship.\r\n    </p>\r\n    <p>\r\n        <strong><em>brad silverman vs GRIDDY GANG:</em></strong>\r\n    </p>\r\n    <p>\r\n        <em>Prediction: GRIDDY GANG by 11</em>\r\n    </p>\r\n    <p>\r\n        <em> Reality: GRIDDY GANG by 5.62<strong></strong></em>\r\n    </p>\r\n    <p>\r\n        <strong><em></em></strong>\r\n    </p>\r\n    <p>\r\n        What we said:\r\n        <em>\r\n            In what the Jart Report expects to be the matchup of the week, two\r\n            high upside teams square off. Whereas some question marks surround\r\n            Golladay and Hunt, GRIDDY GANG looks solid from top down. While\r\n            both teams will score a lot of points, we have the GRIDDY GANG\r\n            winning by 11.\r\n        </em>\r\n    </p>\r\n    <p>\r\n        What we saw: This matchup lived up to its billing. While it was not the\r\n        high scoring affair we at the Jart Report expected, this matchup came\r\n        down to a second half TD from Darrell Henderson, as both teams fought\r\n        through disappointing efforts from star players Derrick Henry, Davante\r\n        Adams, Justin Jefferson, Terry McLaurin, and George Kittle. As Russ\r\n        cooked and Pat continued to show why he’s the first QB off the board\r\n        every year even without consistently running, GRIDDY GANG picked up a\r\n        much needed win to set a different tone for this season. We leave this\r\n        week one matchup feeling much more confident about GRIDDY GANG, as the\r\n        best only seems to be ahead for this Jason Silverstone led club.\r\n        Question marks surround just how consistent Kareem Hunt can be as the\r\n        #2 back in Cleveland, and Green Bay certainly seems to have some\r\n        serious issues to resolve.\r\n    </p>\r\n    <p>\r\n        <strong><em></em></strong>\r\n    </p>\r\n    <p>\r\n        <strong><em>I Got A Half Chubb vs Tompa Bay:</em></strong>\r\n    </p>\r\n    <p>\r\n        <em>Prediction: I Got a Half Chubb by 6</em>\r\n    </p>\r\n    <p>\r\n        <em> Reality: I Got a Half Chubb by 21.76<strong></strong></em>\r\n    </p>\r\n    <p>\r\n        <strong><em></em></strong>\r\n    </p>\r\n    <p>\r\n        What we said:\r\n        <em>\r\n            A matchup we will gain a lot of clarity on after Thursday night\r\n            when Bank sends out Brady and the Bucs D/ST, both teams trot out a\r\n            lot of intriguing players. 5-10 years ago, a matchup with Aaron\r\n            Rodgers, Tom Brady, DeAndre Hopkins, Adam Thielen, and Julio Jones\r\n            woulda been the championship. Now, we are left wondering what we\r\n            will get. Less question marks surround CJ, and thus the Jart Report\r\n            has I Got A Half Chubb by 6 in a matchup with lots of swings.\r\n        </em>\r\n    </p>\r\n    <p>\r\n        What we saw: Of the aging stars, Tom Brady, DeAndre Hopkins, and Adam\r\n        Thielen certainly still looked the part. Elite level production by all\r\n        three set the tone for these teams, while Aaron Rodgers and Julio Jones\r\n        both left a plethora of reasons for great concern for these managers.\r\n        With Chubb and RIP Dmont providing quality performances, you have to\r\n        feel good about what you see from CJ’s skill position players. Aaron\r\n        Rodgers and Mark Andrews are both certainly expected to improve greatly\r\n        moving forward, and thus this team showed it can be quite dangerous\r\n        when finding the end zone consistently.\r\n    </p>\r\n    <p>\r\n        <strong><em></em></strong>\r\n    </p>\r\n    <p>\r\n        <strong><em>Real Brothers vs Team ACL Tear:</em></strong>\r\n    </p>\r\n    <p>\r\n        <em>Prediction: Team ACL Tear by 8</em>\r\n    </p>\r\n    <p>\r\n        <em> Reality: Team ACL Tear by 15.8</em>\r\n    </p>\r\n    <p>\r\n        <em></em>\r\n    </p>\r\n    <p>\r\n        What we said:\r\n        <em>\r\n            Week One is certainly the week to face Jart, with question marks on\r\n            D’Andre Swift and Saquon Barkley’s health. Tyreek and Diggs will be\r\n            a fun battle to watch, while Jalen Hurts tries to replicate Kyler\r\n            Murray’s magic from last season. A matchup that could be in the 80s\r\n            or in the 120s, we expect this one to be close. We at the Jart\r\n            Report have Sutton My Face by 8.\r\n        </em>\r\n    </p>\r\n    <p>\r\n        <em></em>\r\n    </p>\r\n    <p>\r\n        What we saw: In probably the most entertaining matchup of the weekend\r\n        giving its closeness and high scoring, it was the health of D’Andre\r\n        Swift and Saquon Barkley that proved to be the difference in this one.\r\n        With a late benching of Swift and confidence behind Barkley, Jart\r\n        continues to show why he should just draft teams and not manage them,\r\n        as a later roster shift while standing in line to order at Runza cost\r\n        Jart the Week One win. High quality performances were put in across the\r\n        board by both teams, including two star QBs, and both teams look like\r\n        they’re primed to make noise this eason. We expect both of these teams\r\n        to be in the playoff, although the Jart Report continues to worry about\r\n        Kyler Murray’s fantasy effectiveness long term against better offenses\r\n        if his running continues to be reduced (only 20 yards). While Aiyuk\r\n        might not be humming, Deebo Samuel finally looks ready to step into the\r\n        WR1 position that The Family had hoped he would last year. If he is\r\n        able to do so consistently, the trio of Stefon Diggs, Ceedee Lamb, and\r\n        Samuel is one to watch.\r\n    </p>\r\n    <p>\r\n        <h3>Noteworthy Stat of the Week</h3>\r\n    </p>\r\n    <p>\r\n        While Dmichs already tried to steal our thunder on this one, we talk a\r\n        lot in this league about TD luck, and thus we wanted to take the time\r\n        to look at a new statistic, <strong>Yards to TD ratio</strong>. For\r\n        this we will be looking at the 2 RB, 2 WR, 1 TE, and FLEX position only\r\n        (ignoring QBs), and will be calculated by taking total yards and\r\n        dividing by touchdowns scored.\r\n    </p>\r\n    <p>\r\n        Team Ross: 514 yards / 3 TDs = <strong>171.33 (6th)</strong>\r\n    </p>\r\n    <p>\r\n        NN: 427 yards / 2 TDs = <strong>213.5 (4th)</strong>\r\n    </p>\r\n    <p>\r\n        <strong></strong>\r\n    </p>\r\n    <p>\r\n        Team Horses: 376 yards / 3 TDs = <strong>125.33 (9th)</strong>\r\n    </p>\r\n    <p>\r\n        United Nations: 551 yards / 1 TD = <strong>551 (1st)</strong>\r\n    </p>\r\n    <p>\r\n        <strong></strong>\r\n    </p>\r\n    <p>\r\n        Dmichs: 542 yards / 9 TDs = <strong>60.22 (11th)</strong>\r\n    </p>\r\n    <p>\r\n        praying every sunday: 270 yards / 2 TDs = <strong>135 (8th)</strong>\r\n    </p>\r\n    <p>\r\n        <strong></strong>\r\n    </p>\r\n    <p>\r\n        brad silverman: 371 yards / 1 TD = <strong>371 (3rd)</strong>\r\n    </p>\r\n    <p>\r\n        GRIDDY GANG: 410 yards / 2 TDs = <strong>205 (5th)</strong>\r\n    </p>\r\n    <p>\r\n        <strong></strong>\r\n    </p>\r\n    <p>\r\n        I Got a Half Chubb: 450 yards / 8 TDs = <strong>56.25 (12th)</strong>\r\n    </p>\r\n    <p>\r\n        Tompa Bay: 339 yards / 2 TDs = <strong>169.5 (7th)</strong>\r\n    </p>\r\n    <p>\r\n        <strong></strong>\r\n    </p>\r\n    <p>\r\n        Real Brothers: 528 yards / 1 TD = <strong>528 (2nd)</strong>\r\n    </p>\r\n    <p>\r\n        Team ACL Tear: 428 yards / 5 TDs = <strong>85.6 (10th)</strong>\r\n    </p>\r\n    <p>\r\n        This stat could mean literally nothing, but I was intrigued to find out\r\n        what it would equal, and how this number will change for each team. But\r\n        for now, I am going to assume that the higher the ratio number, the\r\n        more unlucky your team got, and thus the more they should have scored.\r\nThe most eye-catching differences are in <em>Team Horses</em> vs<em>United Nations</em> and <em>Real Brothers</em> vs        <em>Team ACL Tear</em>, as MW won despite being extremely unlucky, and\r\n        Real Brothers took the loss without the firepower of additional TDs. We\r\n        trust yards to be more consistent than TDs, so look for the teams with\r\n        lower ratios to score less next week, and teams with higher to put\r\n        together better performances.\r\n    </p>\r\n    <p>\r\n        With this said, we will conclude our Week One recap with a Power\r\n        Rankings, that will be based solely off the team's best possible scores\r\n        from Week One.\r\n    </p>\r\n    <ol start=\"1\" type=\"1\">\r\n        <li>\r\n            JL (160.86) → Lineup was <strong>84.15%</strong> of max\r\n        </li>\r\n        <li>\r\n            Dmichs (159.62) → Lineup was <strong>99.37%</strong> of max\r\n        </li>\r\n        <li>\r\n            Jart (152.26) → Lineup was <strong>78.52%</strong> of max\r\n        </li>\r\n        <li>\r\n            CJ (138.28) → Lineup was <strong>81.95%</strong> of max\r\n        </li>\r\n        <li>\r\n            Brad (120.58) → Lineup was <strong>78.27%</strong> of max\r\n        </li>\r\n        <li>\r\n            NN (118.18) → Lineup was <strong>73.09%</strong> of max\r\n        </li>\r\n        <li>\r\n            MW (117.64) → Lineup was<strong> 82.86%</strong> of max\r\n        </li>\r\n        <li>\r\n            Aross (116.3) → Lineup was <strong>98.80%</strong> of max\r\n        </li>\r\n        <li>\r\n            Bank (108.36) → Lineup was <strong>84.50%</strong> of max\r\n        </li>\r\n        <li>\r\n            praying every sunday (105.4) → Lineup was <strong>86.19%</strong>\r\n            of max\r\n        </li>\r\n        <li>\r\n            Jason (104.06) → Lineup was <strong>96.10%</strong> of max\r\n        </li>\r\n        <li>\r\n            Folbe (94.2) → Lineup was <strong>92.14%</strong> of max\r\n        </li>\r\n    </ol>\r\n    <p>\r\n        Based off of this, Dmichs was the best manager, and NN was the worst.\r\n        Folbe also just sucked. Best ball lineups, NN winning instead of Aross\r\n        and Brad beating Jason were the two differences.\r\n    </p>\r\n    <p>\r\n        <h3>On To Week Two!</h3>\r\n    </p>\r\n    <p>\r\n        <strong></strong>\r\n    </p>\r\n    <p>\r\n        It is now time to preview this week’s matchups!\r\n    </p>\r\n    <p>\r\n        <strong><em>Team Horses vs Team Ross:</em></strong>\r\n        Folbe comes into this one reeling against a solid squad for Aross.\r\n        There is still so much uncertainty for both of these terms as to what\r\n        their floors and ceilings are this season. Team Horses certainly should\r\n        see a big bounce back after a limp first week, but the loss of Jerry\r\n        Jeudy is noteworthy. DK Metcalf vs AJ Brown will be a fun matchup to\r\n        watch as the Ole Miss stars square off against each other in both\r\n        fantasy and real life. Ultimately, the Jart Report expects Lamar to\r\n        have a massive outing against Kansas City in what should be a very high\r\n        scoring game, and coupled with a better showing from Dalvin Cook, Aross\r\n        continues his winning ways. <em>Team Ross by 13.</em>\r\n    </p>\r\n    <p>\r\n        <strong><em>Team NN vs Team Dmichs: </em></strong>\r\n        A lot of people are saying NN should probably just not even show up\r\n        this week. They’re right, Dmichs by a million. While the Dak-Amari\r\n        connection will likely produce closer to 40 points than 60 this week\r\n        and Dmichs TD luck comes back down to earth, there is still more to\r\n        like about this team at this stage. Until Najee gets it going the\r\n        question marks remain, and can Mixon maintain production? Until we see\r\n        it, we’re taking <em>Dmichs by 7.</em>\r\n    </p>\r\n    <p>\r\n        <strong><em>praying every sunday vs brad silverman:</em></strong>\r\n        In the matchup of teams that don’t know how to use capital letters,\r\n        there just seems to be too much pointing towards Brad picking up a much\r\n        needed win. Mahomes in a Sunday night shootout, Adams coming back from\r\n        a rough Week One to face Detroit’s already banged up secondary on MNF,\r\n        and other key contributors with encouraging matchups should provide a\r\n        solid performance from a team that left points on the bench last week.\r\nWith LockettE due for some down weeks, we like        <em>brad silverman by 23.</em>\r\n    </p>\r\n    <p>\r\n        <strong><em>Team ACL Tear vs I Got a Half Chubb:</em></strong>\r\n        In our matchup of the week, these two teams both had the potential to\r\n        put up massive week one scores, and both picked up key wins to kick off\r\n        their seasons. Optimism is certainly higher around CJ than Jonah, with\r\n        serious RB2 questions and lingering concerns about the consistency of\r\n        the TE position (Gronk is so slow). It is no secret the Jart Report is\r\n        quite anxious about Kyler Murray’s production this year, and\r\n        Minnesota’s retooled secondary should prove a tougher matchup than the\r\n        clown show in Tennessee. An elite performance from Rodgers is\r\nguaranteed against the Lions, and thus we like        <em>I Got a Half Chubb to win by 14.</em>\r\n    </p>\r\n    <p>\r\n        <strong><em>GRIDDY GANG vs Tompa Bay: </em></strong>\r\n        One of these owners loves his team, the other is already blaming ESPN\r\n        for tricking him into their 2nd round pick. While Aaron Jones and\r\n        Calvin Ridley should produce better numbers this week, the Jart Report\r\n        is certainly not sold on this team. With better days expected from\r\n        Horse, JJeffs, Scary Terry, and Bobby Onions, GRIDDY GANG should roll\r\n        as the nation starts to pay closer attention to what Jason has going\r\n        on. <em>We like GRIDDY GANG by 4.</em>\r\n    </p>\r\n    <p>\r\n        <strong><em>United Nations vs Real Brothers: </em></strong>\r\n        It’s hard to pick against the defending champ. But this week, we will\r\n        be doing just that. While Caff is a lock to score 30+ any time he plays\r\n        Jart, a better chosen lineup for Jart shows the kind of firepower he\r\n        can bring this season. While Saquon won’t be seeing the lineup for a\r\n        while, if Jamarr Chase can indeed catch footballs, there is a lot of\r\n        potential for this team. We like Jalen Hurts to outscore Justin Herbert\r\n        once again this week, and for Swift to once again clean up in pass\r\n        catching duties with the Lions trailing. Vulnerable secondaries in\r\n        Baltimore, Cleveland, and Tampa Bay should spell good things for\r\n        Tyreek, Cooks, and Pitts. The play of James Robinson and Javonte\r\n        Williams will certainly be worth watching for these young backs, but\r\nbased off Week one, Jart seems primed for the dub. We like        <em>Real Brothers by 12.</em>\r\n    </p>\r\n    <br/>\r\n</div>"}