{"title": "Heavy is the Head", "season": 2021, "week": "17", "report": "<p>\r\n    Welcome back to the Jart Report after a week seventeen that has left us\r\n    with only one team remaining, league-long season leader Jonah Lopas. He\r\n    wears the crown now.\r\n</p>\r\n<h3>\r\n    Jart’s Mailbag\r\n</h3>\r\n<p>\r\n    <strong>How many kids will each league member have?</strong>\r\n</p>\r\n<p>\r\n    I am a firm believer that people generally either want the same amount of\r\n    kids as they were a part of, or one additional. Admittedly I don’t know how\r\n    many siblings you all have, so that philosophy does not help me too much\r\n    here.\r\n</p>\r\n<p>\r\n    Brad: 2\r\n</p>\r\n<p>\r\n    Alex: 3\r\n</p>\r\n<p>\r\n    Jonah: 1\r\n</p>\r\n<p>\r\n    Daniel: 1\r\n</p>\r\n<p>\r\n    Danny: 3\r\n</p>\r\n<p>\r\n    Garrett: 2\r\n</p>\r\n<p>\r\n    Jason: 2\r\n</p>\r\n<p>\r\n    Merrick W: 4\r\n</p>\r\n<p>\r\n    Merrick B: 2\r\n</p>\r\n<p>\r\n    Noah: 3\r\n</p>\r\n<p>\r\n    CJ: 2\r\n</p>\r\n<p>\r\n    Jart: 3\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Have to choose 1 person in here to never talk to again in ur life, who\r\n        is it and why?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Big Oven Lebron In The Playoffs. We don’t need words at this point, we can\r\n    communicate solely through fantasy football trades.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        If you could hang out with any family member for a day from your team\r\n        (this year or former) who would it be, what would you do, and why did\r\n        you pick them?\r\n    </strong>\r\n</p>\r\n<p>\r\n    Ja’Marr Chase, to teach me how to griddy and then smoke some cigars with\r\nJoey B. But also so that I can yell at him for scoring 0.8 against CJ.    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        24 hour 8 minute road trip (From LA to Lafayette) with someone in this\r\n        league. Who would you least and most want in the car with you?\r\n    </strong>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        In 12th place, with 33 points, a highest finish of 2nd and lowest of\r\n        11th, we have the team that also finished in 12th in fantasy this year.\r\n        Taking Ls left and right, it’s <strong>Danny Banooni</strong>!\r\n    </li>\r\n    <li>\r\n        In 11th place, with 40 points, a highest finish of 1 (so that CJ can\r\n        get in those cheeks), and a lowest finish of 11, it’s one of the few\r\n        men to have multiple rings. Will he have 4 kids? Only if hotels expand\r\n        their room sizes! It’s <strong>Merrick Weingarten</strong>!\r\n    </li>\r\n    <li>\r\n        In 10th place, with 49 points, a highest finish of 2nd and lowest\r\n        finish of 11, if you need an emergency colonoscopy on your trip, you’ll\r\n        be glad you brought this guy along! While he may be good at examining\r\n        your butt, would is he can’t always keep his under control. So bring\r\n        some nose plugs to be safe! It’s <strong>Merrick Bank</strong>!\r\n    </li>\r\n    <li>\r\n        In 9th place, with 50 points, a highest finish of 2nd and lowest finish\r\n        of 10th, it’s everyone’s favorite author! A real wild card, no one\r\n        knows what they would get in this car ride! Would they be forced to\r\n        pray the whole time and sing worship music? Based on yalls ratings,\r\n        that seems to be what you think! It’s <strong>Jarrett Black</strong>!\r\n    </li>\r\n    <li>\r\n        In 8th place, with 64 points, a highest finish of 1st and a lowest\r\n        finish of 10th, it’s one half of the host of our beloved podcast the\r\n        J&amp;J show. If you want to hear about how injuries derail a season,\r\n        bring this guy along. For a chill ride and some good times, look no\r\n        further. The king himself, <strong>Jason Silverstone</strong>!\r\n    </li>\r\n    <li>\r\n        In 7th place, with 66 points, a highest finish of 2nd and a lowest\r\n        finish of 9th, it’s the other half of the J&amp;J show! This man won\r\n        the league and is the resident king of poker. So he doesn’t even need\r\n        yall in his car. It’s <strong>Jonah Lopas</strong>!\r\n    </li>\r\n    <li>\r\n        In 6th place, with 68 points, a highest finish of 1st (love u buddy)\r\n        and a lowest finish of 11th, it’s our league runner up! This dude will\r\n        love to clown with ya on your roadtrip and make some truly wild\r\n        comments throughout. Stop and get some deep dish on the way, it’s the\r\n        King of Chicago himself, <strong>CJ Drogosch</strong>!\r\n    </li>\r\n    <li>\r\n        In 5th place, with a score of 78 points, a highest finish of 2nd and a\r\n        lowest finish of 10th, it’s the resident man of mystery! Some say he\r\n        had met most ppl maybe twice lol, but that doesn’t stop em from wanting\r\n        to get in a car with him! That could be an advantage! This man loves a\r\n        good cowboys stack, so stay away from Dallas and you’ll have a good\r\n        time! It’s <strong>Daniel Michaels</strong>!\r\n    </li>\r\n    <li>\r\n        In 4th place, with a score of 82 points, a highest finish of 1st and a\r\n        lowest finish of 8th, it’s the glue that holds this whole league\r\n        together! This man apparently wants to spend every minute of his life\r\n        alone unless its briefly with his girlfriend, so he doesn’t seem like\r\n        the guy to take! But it’ll be a good time and a lot of talk about the\r\ntranscendent talent that is Cooper Kupp. It’s        <strong>Noah Nathan</strong>!\r\n    </li>\r\n    <li>\r\n        In 3rd place, with a score of 83 points, a highest finish of 1st and a\r\n        lowest finish of 11th, it’s the CEO of Fantasy Dickball himself! Some\r\n        thought he would reach second on this list, but that is not the case! A\r\n        fearless leader who will help usher in the age of the auction dynasty,\r\n        it is none other than <strong>Alex Ross</strong>!\r\n    </li>\r\n    <li>\r\n        In 2nd place, with a score of 85 points, a highest finish of 1st and a\r\n        lowest finish of DQ, it is the man whose drunk videos saturate the\r\n        league groupchat in the offseason! His fantasy team may absolutely\r\n        blow, but that won’t stop him from thinking its good and telling you\r\n        about it! For a good time, call <strong>Brad Silverman</strong>!\r\n    </li>\r\n    <li>\r\n        In 1st place, with a score of 94 points, a highest finish of 1st and a\r\n        lowest finish of 7th, it’s The Programmer! Make a league a website and\r\n        they’ll take you along! Whether you’re going to play some trampoline\r\n        dodgeball or a roadtrip for him to profess his undying love for Jhuree\r\nHong, you are guaranteed a good time with this man. It’s        <strong>Garrett Folbe</strong>!\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong>Is Noah an island boy?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Yes.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>What’s wrong with your car?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Thanks for asking! I knew I needed to get an oil change so that was gonna\r\n    be a scheduled appointment anyways, but when I started driving home from\r\n    Minneapolis my check engine light came on. The diagnostic report said it\r\n    wasn’t anything imminently serious, but here we are now sitting at the\r\n    dealership so we’ll see. I’ll provide an update once I get it back.\r\n</p>\r\n<p>\r\n    Update: Too much car lingo, but it is an issue with extreme cold (which\r\n    makes sense, I was in Minnesota in December). They’re ordering some parts\r\n    to fix it, and they’ll need my car for a couple days but it will all be\r\n    covered by warranty. So it is what it is.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Red or Blue?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    If I’m talking to 10 of you, red. If I’m talking to Bank, go blue.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Rank the league on who would survive in the woods alone longest?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Daniel Banooni. Seems like he’s ready for it.\r\n    </li>\r\n    <li>\r\n        Garrett Folbe. Unclear where anyone stands and he asked the question so\r\n        he gets 2.\r\n    </li>\r\n    <li>\r\n        Jarrett Black. I am an Eagle Scout so that’ll help, but at the same\r\n        time I hate the woods.\r\n    </li>\r\n    <li>\r\n        Daniel Michaels. He spent some time in Montana right? I don’t know.\r\n    </li>\r\n    <li>\r\n        Jason Silverstone. Feel like he’s scrappy and would get the job done.\r\n    </li>\r\n    <li>\r\n        Jonah Lopas. Got good practice out there in California if he wants it.\r\n    </li>\r\n    <li>\r\n        Alex Ross. No real reason I just gotta start putting people somewhere.\r\n    </li>\r\n    <li>\r\n        CJ Drogosch. Probably should be lower.\r\n    </li>\r\n    <li>\r\n        Brad Silverman. Seems like a safe spot.\r\n    </li>\r\n    <li>\r\n        Noah Nathan. Sleeping on the ground gonna take out that back.\r\n    </li>\r\n    <li>\r\n        Merrick Bank. Not enough football in the woods. Go blue.\r\n    </li>\r\n    <li>\r\n        Merrick Weingarten. Maybe I’m wrong, but I just don’t see it.\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong>Odds for each player to leave this offseason?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    I don’t even need to spend my time with this one - no one is leaving. This\r\n    was the best season we have ever had, everyone is locked in, and bright\r\n    things are ahead. We’ll be running this 12 for as long as we are all still\r\n    able.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Would you rather fight 10 chicken sized gorillas or a 1 gorilla sized\r\n        chicken?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Definitely 10 chicken sized gorillas. Really it’s the gorilla’s pure size\r\n    and weight that make them dangerous. Consider the chicken if it were\r\n    gorilla sized. This is a terrifying animal that can survive even if you cut\r\n    their heads off. That’s an impossible obstacle to overcome, whereas ten\r\n    chicken sized gorillas can be defeated.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Over under 50000 text messages sent between tomorrow and start of the\r\n        2023 regular season in the group chat?\r\n    </strong>\r\n</p>\r\n<p>\r\n    Over. We have 8 months before the regular season starts, meaning roughly\r\n    240 days. To reach 50000 text messages, we should need to send around 210 a\r\n    day. I would be shocked if we don’t do those numbers, even though things do\r\n    cool off some in the offseason.\r\n</p>\r\n<p>\r\n    <strong>If we had a spelling bee who would come in what place?</strong>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Merrick Bank\r\n    </li>\r\n    <li>\r\n        Garrett Folbe\r\n    </li>\r\n    <li>\r\n        Jarrett Black\r\n    </li>\r\n    <li>\r\n        Noah Nathan\r\n    </li>\r\n    <li>\r\n        Daniel Banooni\r\n    </li>\r\n    <li>\r\n        Merrick Weingarten\r\n    </li>\r\n    <li>\r\n        Jason Silverstone\r\n    </li>\r\n    <li>\r\n        CJ Drogosch\r\n    </li>\r\n    <li>\r\n        Alex Ross\r\n    </li>\r\n    <li>\r\n        Daniel Michaels\r\n    </li>\r\n    <li>\r\n        Jonah Lopas\r\n    </li>\r\n    <li>\r\n        Brad Silverman\r\n    </li>\r\n</ol>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        I’m extremely against going full Roto because it takes away all the fun\r\n        of head to head matchups, we literally wouldn’t need a schedule if we\r\n        went full roto. Do you feel the same?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Yes. I am ok with roto impacting up to two playoff spots, but nothing\r\n    beyond that. Fantasy Football is a H2H game, and we can never move away\r\n    from that. Otherwise we will have lost the joy of matchups and locking in\r\n    on your opponents.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Can you pitch me a little more on auction?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Throughout the season we hear of situations such as with Diontae Johnson,\r\n    where Noah wanted him but CJ “sniped him”. We just don’t have that issue\r\n    anymore with an auction draft. Auction lets you call your shot. If you feel\r\n    really good about a guy that is supposed to go later? Great, spend a little\r\n    less there and go big on some early guys you really like. You would have\r\n    more control over your roster than ever. Especially as we move through\r\n    rounds in snake, people will come up at say the 32nd pick but want someone\r\n    who they could get at 38, but they just don’t have the ability to do that,\r\n    and so they have to reach some. With an auction, they can be rewarded some\r\n    for paying less for the 38th guy, and have more to spend elsewhere. I hear\r\n    a lot of talk about how the auction draft is too long, but then also how\r\n    the draft is the best part of the season. I don’t know how anyone can\r\n    really make a decision until we try it. Seems like next year is a great\r\n    year to test it out as we have such a solid core and league right now\r\n    committed to creating the ultimate experience. We won’t know until we try!\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Can we do an off-season Jart Report?</strong>\r\n</p>\r\n<p>\r\n    Yes, of course! Interviews will be beginning shortly on team recaps (I\r\n    would like to video chat with each of you individually if possible), as\r\n    well as some other things I may cook up. Suggestions are always welcome,\r\n    unless you had me last in your car rankings. Then I don’t want to hear from\r\n    you (none of you had me last, so I want to hear from all of you).\r\n</p>\r\n<h3>\r\n    Draft Pick Trade Results\r\n</h3>\r\n<p>\r\n    While these weren’t considered in best trade or fleece since there was so\r\n    much unknown with them at the time of the trade, we will look at how the\r\n    draft pick trades turned out.\r\n</p>\r\n<p>\r\n    <strong>Trade #1: Noah Nathan and Jarrett Black</strong>\r\n</p>\r\n<p>\r\n    Noah Nathan Received:\r\n</p>\r\n<p>\r\n    22nd overall pick - Clyde Edwards-Helaire\r\n</p>\r\n<p>\r\n    46th overall pick - Cooper Kupp\r\n</p>\r\n<p>\r\n    75th overall pick - Sony Michel\r\n</p>\r\n<p>\r\n    99th overall pick - Jakobi Meyers\r\n</p>\r\n<p>\r\n    Jarrett Black Received:\r\n</p>\r\n<p>\r\n    33rd overall pick - Miles Sanders\r\n</p>\r\n<p>\r\n    40th overall pick - D’Andre Swift\r\n</p>\r\n<p>\r\n    64th overall pick - Ja’Marr Chase\r\n</p>\r\n<p>\r\n    81st overall pick - Jalen Hurts\r\n</p>\r\n<p>\r\n    <strong>Winner:</strong>\r\n    Jarrett Black. Hard to beat Cooper Kupp, but Swift-Chase-Hurts does it.\r\n</p>\r\n<p>\r\n    <strong>Trade #2: Daniel Banooni and Jarrett Black</strong>\r\n</p>\r\n<p>\r\n    Daniel Banooni Received:\r\n</p>\r\n<p>\r\n    3rd overall pick - Alvin Kamara\r\n</p>\r\n<p>\r\n    27th overall pick - Allen Robinson\r\n</p>\r\n<p>\r\n    70th overall pick - Raheem Mostert\r\n</p>\r\n<p>\r\n    142nd overall pick - Russell Gage\r\n</p>\r\n<p>\r\n    Jarrett Black Received:\r\n</p>\r\n<p>\r\n    11th overall pick - Saquon Barkley\r\n</p>\r\n<p>\r\n    14th overall pick - Tyreek Hill\r\n</p>\r\n<p>\r\n    62nd overall pick - Brandin Cooks\r\n</p>\r\n<p>\r\n    134th overall pick - Steelers D/ST\r\n</p>\r\n<p>\r\n    <strong>Winner: </strong>\r\n    Jarrett Black. Neither team incredibly benefitted, but Kamara and Mostert\r\n    struggled with injuries, Allen Robinson did nothing, and Gage didn’t\r\n    produce until he was gone. Saquon was a disappointment with injuries,\r\n    Tyreek was boom/bust, but Brandin Cooks was flipped for Davante Adams.\r\n</p>\r\n<p>\r\n    <strong>Trade #3: Alex Ross and Daniel Michaels</strong>\r\n</p>\r\n<p>\r\n    Alex Ross Received:\r\n</p>\r\n<p>\r\n    61st overall pick - Lamar Jackson\r\n</p>\r\n<p>\r\n    84th overall pick - Antonio Brown\r\n</p>\r\n<p>\r\n    Daniel Michaels Received:\r\n</p>\r\n<p>\r\n    71st overall pick - Odell Beckham Jr.\r\n</p>\r\n<p>\r\n    74th overall pick - Juju Smith-Schuster\r\n</p>\r\n<p>\r\n    Winner: Alex Ross. A lot of real interesting players are included here.\r\n    Juju missed most of the season, Odell and AB both had quite the sagas, and\r\n    Lamar played pretty well but missed a number of games with injury. Lamar\r\n    wins the deal though.\r\n</p>\r\n<p>\r\n    <strong>Trade #4: Merrick Bank and Brad Silverman</strong>\r\n</p>\r\n<p>\r\n    Merrick Bank Received:\r\n</p>\r\n<p>\r\n    82nd overall pick - Tom Brady\r\n</p>\r\n<p>\r\n    87th overall pick - Devonta Smith\r\n</p>\r\n<p>\r\n    Brad Silverman Received:\r\n</p>\r\n<p>\r\n    80th overall pick - Tyler Boyd\r\n</p>\r\n<p>\r\n    89th overall pick - Kenyan Drake\r\n</p>\r\n<p>\r\n    Winner: Merrick Bank. Tom Brady was a top QB, and Devonta Smith was a solid\r\n    contributor. Tyler Boyd was inconsistent and Kenyan Drake wasn’t good until\r\n    Brad dropped him and Kenyan spent some time back with his Family.\r\n</p>\r\n<h3>\r\n    Season Awards\r\n</h3>\r\n<p>\r\n    With the fantasy season officially coming to an end, it is time to look\r\n    back on the season and hand out the awards for a whole slew of different\r\n    things.\r\n</p>\r\n<p>\r\n    <strong>Draft Pick of the Year:</strong>\r\n    Noah Nathan, Cooper Kupp, 46th overall\r\n</p>\r\n<p>\r\n    <strong>Worst Draft Pick of the Year:</strong>\r\n    Daniel Banooni, Allen Robinson, 27th overall\r\n</p>\r\n<p>\r\n    <strong>Trade Of the Year:</strong>\r\n    Brad Silverman-Jarrett Black. Patterson + Cooks for Davante Adams\r\n</p>\r\n<p>\r\n    <strong>Trade Fleece of the Year:</strong>\r\n    Jonah Lopas-Noah Nathan. CEH for Sutton + Ty’Son Williams\r\n</p>\r\n<p>\r\n    <strong>Waiver Claim of the Year: </strong>\r\n    Jarrett Black, Cordarelle Patterson, $19\r\n</p>\r\n<p>\r\n    <strong>Worst Waiver Claim of the Year:</strong>\r\n    Daniel Banooni, Damien Williams, $94\r\n</p>\r\n<p>\r\n    <strong>Matchup of the Year:</strong>\r\n    Garrett Folbe-Jarrett Black, Week 3, Garrett 136.92-135.54\r\n</p>\r\n<p>\r\n    <strong>Worst Matchup of the Year: </strong>\r\n    Jason Silverstone-Daniel Banooni, Week 9, Jason 89.78-48.64\r\n</p>\r\n<p>\r\n    <strong>Family of the Year: </strong>\r\n    Jarrett Black. Every year. This award is for me. Not sorry\r\n</p>\r\n<p>\r\n    <strong>Acquisition King:</strong>\r\n    Noah Nathan, 63 players claimed (18 player lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>Acquisition Queen: </strong>\r\n    Jason Silverstone, 17 players claimed (1 player lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>Trade King(s):</strong>\r\n    Daniel Banooni and Noah Nathan, 6 trades (2 trade lead over 3rd place)\r\n</p>\r\n<p>\r\n    <strong>Trade Queen: </strong>\r\n    Merrick Weingarten and CJ Drogosch, 0 trades (1 trade lead over 10th place)\r\n</p>\r\n<p>\r\n    <strong>IR King:</strong>\r\n    Jarrett Black, 19 players on IR (2 player lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>IR Queen(s):</strong>\r\n    CJ Drogosch and Garrett Folbe, 4 players on IR (1 player lead over 10th\r\n    place)\r\n</p>\r\n<p>\r\n    <strong>Kicker King:</strong>\r\n    Alex Ross (84 points, 3.5 point lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>Kicker Queen: </strong>\r\n    Daniel Banooni (55 points, 1 point lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>Defense King:</strong>\r\n    Jonah Lopas (160 points, 41 point lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>Defense Queen:</strong>\r\n    Daniel Michaels (60 points, 9 point lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>Efficiency King:</strong>\r\n    Jarrett Black (85.64%, 2.16% lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>Efficiency Queen:</strong>\r\n    Garrett Folbe (93.13%, 0.96% lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>Yards to TD Ratio King:</strong>\r\n    Merrick Weingarten (224.73, 45.28 lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>Yards to TD Ratio Queen:</strong>\r\n    Jonah Lopas (101.10, 12.17 lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>PF King:</strong>\r\n    Daniel Banooni (1310.38 PF, 54.74 lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>PF Queen:</strong>\r\n    Jonah Lopas (1675.9 PF, 135.88 lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>PA King:</strong>\r\n    Daniel Banooni (1572.18 PA, 0.16 PA lead over 2nd place)\r\n</p>\r\n<p>\r\n    <strong>PA Queen:</strong>\r\n    Alex Ross (1297.82 PA, 52.04 PA lead over 11th place)\r\n</p>\r\n<p>\r\n    <strong>Best Mailbag Questions:</strong>\r\n    Garrett Folbe\r\n</p>\r\n<p>\r\n    <strong>Self Proclaimed Best Mailbag Questions:</strong>\r\n    Brad Silverman\r\n</p>\r\n<p>\r\n    <strong>Best Hot Takes:</strong>\r\n    CJ Drogosch\r\n</p>\r\n<p>\r\n    <strong>Best Matchup Previews:</strong>\r\n    Jonah Lopas\r\n</p>\r\n<p>\r\n    <strong>Oddsmaker of the Year:</strong>\r\n    Jonah Lopas of Lopas Sportsbook\r\n</p>\r\n<p>\r\n    <strong>Most Awards:</strong>\r\n    Daniel Banooni, 7 (now 8)\r\n</p>\r\n<p>\r\n    <strong>Final Power Rankings:</strong>\r\n    <strong></strong>\r\n</p>\r\n<ol start=\"1\" type=\"1\">\r\n    <li>\r\n        Jonah Lopas\r\n    </li>\r\n    <li>\r\n        CJ Drogosch\r\n    </li>\r\n    <li>\r\n        Alex Ross\r\n    </li>\r\n    <li>\r\n        Daniel Michaels\r\n    </li>\r\n    <li>\r\n        Jarrett Black\r\n    </li>\r\n    <li>\r\n        Noah Nathan\r\n    </li>\r\n    <li>\r\n        Garrett Folbe\r\n    </li>\r\n    <li>\r\n        Jason Silverstone\r\n    </li>\r\n    <li>\r\n        Merrick Bank\r\n    </li>\r\n    <li>\r\n        Brad Silverman\r\n    </li>\r\n    <li>\r\n        Merrick Weingarten\r\n    </li>\r\n    <li>\r\n        Daniel Banooni\r\n    </li>\r\n</ol>\r\n<p>\r\n    No debating.\r\n</p>"}