{"title": "Coming Up Broke", "season": 2021, "week": "15", "report": "<p>\r\n    Welcome back to the Jart Report after a week fifteen that brought us two\r\n    incredible playoff matchups that came down to the wire. Despite Brad’s\r\n    attack at the expected quality of these reports following the elimination\r\n    of The Family, we remain committed to bringing you the best coverage in all\r\n    of fantasy football.\r\n</p>\r\n<h3>\r\n    Week 15 Recap\r\n</h3>\r\n<p>\r\n    <strong>I’ve Got a Half Chubb vs Real Brothers</strong>\r\n</p>\r\n<p>\r\n    Prediction: CJ 122.22 - 112.24\r\n</p>\r\n<p>\r\n    Reality: CJ 115.42 - 106.64\r\n</p>\r\n<p>\r\n    Perfect management by CJ and Christian Kirk’s garbage time 29 yard TD while\r\n    trailing the Lions by 20+ proves the difference here. It seems only fitting\r\n    that in a year characterized by poor management choices and sticking with\r\n    Family RBs that probably shouldn’t even have been on the team in the first\r\n    place (Saquon, Miles), it was the benching of Miles Sanders this week that\r\n    also cost The Family a chance to advance to the semi-finals. After taking\r\n    Kyle Pitts at 51st Overall over Mark Andrews, Jart watched Andrews drop\r\n    66.8 on him in the two matchups against CJ, a fitting result for his worst\r\n    draft pick.\r\n</p>\r\n<p>\r\n    While there were a lot of elements at play, it was the late afternoon\r\n    window that secured CJ the victory, with Aaron Rodgers and Mark Andrews\r\n    outsourcing Ja’Marr Chase, Kyle Pitts, and Davante Adams 54.42 to 23.9.\r\n    With only 44/268 yards and 1/3 TDs going to Adams from Rodgers, CJ pulled\r\n    off the rare QB win in an elite QB-WR face off. Second half production from\r\n    Chubb and steady contributions from RIP Dmont and Diontae Johnson were\r\n    enough to hold off an attempted torrid comeback from proven NFL QB Jalen\r\n    Hurts. A fun one from two teams that can be pleased with the efforts they\r\n    put forth, unless it’s Michael Pittman or Ja’Marr Chase.\r\n</p>\r\n<p>\r\n    <strong>What The League Thought:</strong>\r\n</p>\r\n<p>\r\n    -CJ rocked\r\n</p>\r\n<p>\r\n    -Folbe and MW and Bank suck at fantasy a lot\r\n</p>\r\n<p>\r\n    -Another tough year for Jart. A good team that just can’t seem to make the\r\n    jump to glory because of tough roster decisions. Jim Caldwell esque some\r\n    would say\r\n</p>\r\n<p>\r\n    -CJ managed a perfect game\r\n</p>\r\n<p>\r\n    -Mark Andrews is that ____\r\n</p>\r\n<p>\r\n    -Would have really preferred Jarrett to win, Cj shouldn’t be in the league\r\n</p>\r\n<p>\r\n    <strong>CJ:</strong>\r\n    Love playing my guy in the playoffs\r\n</p>\r\n<p>\r\n    <strong>Jart:</strong>\r\n    Tough loss, but if I had to lose to someone glad it was CJ. BOL rest of the\r\n    way.\r\n</p>\r\n<p>\r\n    <strong>Aiyuk Kidding Me vs CalAmari Cooper</strong>\r\n</p>\r\n<p>\r\n    Prediction: Dmichs 116.52 - 116.34\r\n</p>\r\n<p>\r\n    Reality: Dmichs 114.48 - 97.66\r\n</p>\r\n<p>\r\n    In the beginning of the season, NN’s squad was truly known as Cooper Kupp\r\n    and then everyone else. In the first round of the playoffs, they got back\r\n    to playing that way. No one else scored above 15.5, and the final scorer\r\n    makes this matchup closer than it felt for most of the week following\r\n    Travis Kelce and Jonathan Taylor’s explosive games on Thursday and Saturday\r\n    respectively in combining for 59.1 points.\r\n</p>\r\n<p>\r\n    There was not much else to right home about for Dmichs’ team as the next\r\n    highest scorer was the defense (the sooner Dmichs moves on from Dak the\r\n    better, although he has a great matchup next week), but they got the job\r\n    done and that’s all that matters this time of year. There are obviously\r\n    some COVID concerns moving forward, but for right now it’s all celebration.\r\n</p>\r\n<p>\r\n    <strong>What the League Thought:</strong>\r\n</p>\r\n<p>\r\n    -Dmichs rocked\r\n</p>\r\n<p>\r\n    -NN deserved what he got\r\n</p>\r\n<p>\r\n    -Nn never had a shot\r\n</p>\r\n<p>\r\n    -Travis Kelce is that ____\r\n</p>\r\n<p>\r\n    -Dmichs in 2 years is already establishing himself as a top 4 manager in\r\n    this league\r\n</p>\r\n<p>\r\n    <strong>Dmichs:</strong>\r\n    Crazy that NN even made the playoffs, his team was so a** beginning of the\r\n    season, good game.\r\n</p>\r\n<p>\r\n    <strong>NN:</strong>\r\n    Folbe and MW and Bank suck at fantasy a lot\r\n</p>\r\n<h3>\r\n    League Takes\r\n</h3>\r\n<p>\r\n    <strong>Agree:</strong>\r\n</p>\r\n<p>\r\n    -Our league rocks\r\n</p>\r\n<p>\r\n    -JT is the 🐐\r\n</p>\r\n<p>\r\n    -Brad should go to med school\r\n</p>\r\n<p>\r\n    -Jalen Hurts is the GOAT\r\n</p>\r\n<p>\r\n    -D’Andre Swift was a much bigger loss for Jart than people remember\r\n</p>\r\n<p>\r\n    <strong>Neutral:</strong>\r\n</p>\r\n<p>\r\n    -Everyone who didn’t make the playoffs or wasnt top 6 in roto (same group\r\n    of guys) cant say sh*t abt anyone who did make them\r\n</p>\r\n<p>\r\n    <strong>Disagree:</strong>\r\n</p>\r\n<p>\r\n    -Best 4 teams are NOT left\r\n</p>\r\n<h3>\r\n    Jart’s Mailbag\r\n</h3>\r\n<p>\r\n    <strong>What are you doing after your loss?</strong>\r\n</p>\r\n<p>\r\n    Hitting the Sparkling Cider bottle again, working on my sermon for this\r\n    Sunday, and rooting for CJ to grab his first ring.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        How am I supposed to care about football without fantasy implications?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    You’re not. If I didn’t play fantasy I would never watch the NFL. Just lock\r\n    in on Alabama.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Will you lose over or under 25 hours of sleep over the off-season about\r\n        the Rashaad Penny over Miles Sanders start?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Definitely under. I slept great last night, and honestly I'm not that torn\r\n    up about it. Would’ve been fun to win but I legitimately enjoy writing the\r\n    report each week more, and I still get to do that! Proud of Miles though\r\n    for coming through, love how he’s grinded and hope he gets rewarded with a\r\n    touchdown soon.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Who should be the commissioner of the league next year (if you could\r\n        just pick)?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Who is our commissioner currently, is it Merrill or Aross? Honestly I don’t\r\n    think it matters much, we seem to be a solid democracy these days that just\r\n    loves to yell at our commissioners. I think it should be Nooni because he\r\n    seems like a good impartial party.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Is it gonna snow for Christmas?</strong>\r\n</p>\r\n<p>\r\n    Somewhere, definitely. I’ll break it up into three categories:\r\n</p>\r\n<p>\r\n    3911 Shellmarr Ln: Yes, and a little bit of it should stick.\r\n</p>\r\n<p>\r\n    Chicago: Looking like yes but it probably won’t stick.\r\n</p>\r\n<p>\r\n    Lincoln: No sir, gonna be too warm and no precipitation expected.\r\n</p>\r\n<p>\r\n    <strong>\r\n        Jonah and Alex are the only two members alive with previous titles. Can\r\n        CJ or Dmichs get it done?\r\n    </strong>\r\n</p>\r\n<p>\r\n    They certainly can. I don’t think it’s out of the question that we see a\r\n    CJ-Dmichs championship, ensuring that that would be the case. If I had to\r\n    choose someone to win right now it would certainly be JL, but I like CJ to\r\n    be in the finals. So JL is my first choice, but CJ and Dmichs are 2 and 3\r\n    (no particular order at the time of this writing).\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Now that your season is over how will you be spending your Sundays?\r\n    </strong>\r\n</p>\r\n<p>\r\n    I still have four leagues left to sweat the playoffs for! I usually go\r\n    grocery shopping during the first half of the early window games, and I\r\n    will likely continue that. Until all my teams are out I will keep watching,\r\n    but I will probably just have it on my laptop while I play PS5 or\r\n    something. Either way, there are still a lot of family members out there\r\n    still playing in greener pastures currently. We are rooting for you Deebo,\r\n    Beta Metcalf, Davie J, RIP DMONT, and Hollywood!\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Should the league implement a mask mandate in the group chat?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    In order to ensure we stay under 1k deaths, this does seem like the most\r\n    logical move. It’s this kind of forward thinking that seems absurd at the\r\n    time but we’ll look back on and say thank you Merrick Bank for this\r\n    suggestion.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        League member most likely to quit the corporate world and start their\r\n        own business?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    I’ll take CJ, with something in the sports world. I think he’ll end up\r\n    coaching baseball in some capacity some day, and with that start up a\r\n    sports business that he loves. My dark horse candidate is Nooni, who I\r\n    think will be done with the grind and ready to do something new.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>What’s your least favorite fast food restaurant?</strong>\r\n</p>\r\n<p>\r\n    Um if we’re talking restaurants that I am at sometimes, it would probably\r\n    be Runza. It’s a Nebraskan thing, and well it is just not as good as\r\n    anywhere else in my opinion but a lot of my friends who were born and\r\n    raised here swear by it. I do hate Burger King though besides chicken\r\n    fries.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Which league member got screwed the hardest this year? </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    I think this one probably comes down to Jason or myself. Jason lost the\r\n    single most important player in Derrick Henry, and also dealt with Alvin\r\n    Kamara missing considerable time as well. Russell Wilson missed\r\n    considerable time (although he hadn’t been amazing), and so Jason getting\r\n    to 7-7 with all of that was quite the feat. For me, losing Saquon Barkley,\r\n    D’Andre Swift, and Miles Sanders were all big losses that left my RB depth\r\n    very small very quickly. Davante Adams missed a game due to covid as well.\r\n    Overall though, I think Jason was more screwed over by injuries, but I also\r\n    had the highest roto SOS by a considerable margin. So I think it’s one of\r\n    the two of us, you can decide what you categorize screwed as.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Would you want your future kid(s) to attend Nebraska or UofM?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    I think this will probably come down to where I am living at that point in\r\n    time (see next question). Given that I will likely never make very much\r\n    money, if they can get in-state tuition, we taking it. I think over time\r\n    where one attends undergrad really won’t make a massive deal, and so I’d\r\n    probably lean Nebraska even though it obviously is not as good of a school\r\n    academically. Since my kids will be raised Nebraska fans I’d want them to\r\n    get to experience being at the school they grew up loving for four years.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Where will each member live by age 30? Age 80?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    I feel ill-equipped to answer this question because I don’t know anyone’s\r\n    imminent travel plans or career aspirations. So I will say that everyone is\r\n    staying in the state they are currently, with the exception of Folbe\r\n    heading to California to work for Anduril and MW is in New York. I will be\r\n    living somewhere else in all likelihood but I have no idea where yet.\r\n</p>\r\n<p>\r\n    By age 80, I like MW, Folbe, Brad, and Bank to be living in Florida. Alex\r\n    and Dmichs in California, JL in Vegas, Jart in Nebraska, NN, Jase, and CJ\r\n    in Michigan, Nooni in a foreign country.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Life expectancy of each league member?</strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    I am not about to actually do this, so I will instead do how many years off\r\n    their life they lost from the stress of fantasy football this season, from\r\n    least to most years lost:\r\n</p>\r\n<p>\r\n    12. JL\r\n</p>\r\n<p>\r\n    11. Aross\r\n</p>\r\n<p>\r\n    10. Nooni\r\n</p>\r\n<p>\r\n    9. MW\r\n</p>\r\n<p>\r\n    8. CJ\r\n</p>\r\n<p>\r\n    7. Jason\r\n</p>\r\n<p>\r\n    6. Dmichs\r\n</p>\r\n<p>\r\n    5. Bank\r\n</p>\r\n<p>\r\n    4. NN\r\n</p>\r\n<p>\r\n    3. Folbe\r\n</p>\r\n<p>\r\n    2. Jart\r\n</p>\r\n<p>\r\n    1. Brad\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>What age will each league member get married?</strong>\r\n</p>\r\n<p>\r\n    I have absolutely zero idea, so my official stance is that no one is ever\r\n    getting married, eleven of us are already married to the game and Brad is\r\n    married to the grind, or at least talking about the grind.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        If you had to use one word to describe the remaining teams, what would\r\n        it be?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Jonah: Consistent\r\n</p>\r\n<p>\r\n    Alex: Opportunistic\r\n</p>\r\n<p>\r\n    CJ: Gritty\r\n</p>\r\n<p>\r\n    Dmichs: Elite\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>\r\n        Now that your season has ended, what Family member are you most proud\r\n        of, which one are you most indifferent to, and which one are you most\r\n        disappointed in?\r\n    </strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    Proud: Jalen Hurts. Dude fought back from his high ankle sprain and played\r\n    an almost flawless game, putting the Eagles into the playoffs as of this\r\n    week.\r\n</p>\r\n<p>\r\n    Indifferent: Kyle Pitts. He’s a lot better than his production showed, but\r\n    got doubled often due to Calvin Ridley being out. Was tough to watch him\r\n    all year.\r\n</p>\r\n<p>\r\n    Disappointed: Ja’Marr Chase. After an incredible first half of the season,\r\n    Chase was atrocious outside of a Week 14 where I did not need his\r\n    production. 1 catch for 3 yards in the playoffs?\r\n</p>\r\n<p>\r\n    <strong>Is Michigan-Georgia going to be played? </strong>\r\n</p>\r\n<p>\r\n    Yes. Way too much money in it for it not to happen, I genuinely think they\r\n    will delay if need be.\r\n</p>\r\n<p>\r\n    <strong>What is the league missing?</strong>\r\n</p>\r\n<p>\r\n    Structure that creates some sort of carry-over between seasons. While\r\n    relegation isn’t necessarily an option, and dynasty seems to be too\r\n    polarizing of a topic currently, a keeper or two or being able to trade\r\n    future draft picks (or perhaps draft $$) would create some sense of\r\n    continuation. We could certainly walk through restrictions on these to\r\n    avoid issues, but the existence of one or both of these would allow for\r\n    more of a true owner feel, something I think the league would benefit from.\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    On To The Semi-Finals!\r\n</h3>\r\n<p>\r\n    <strong>The Lopas Sportsbook Official Futures Odds:</strong>\r\n</p>\r\n<p>\r\n    JL +300 → +265\r\n</p>\r\n<p>\r\n    Aross +400 → +420\r\n</p>\r\n<p>\r\n    <s>\r\n        Jart +450\r\n    </s>\r\n</p>\r\n<p>\r\n    <s>\r\n        NN +500\r\n    </s>\r\n</p>\r\n<p>\r\n    Dmichs +550 → +400\r\n</p>\r\n<p>\r\n    CJ +650 → +350\r\n</p>\r\n<p>\r\n    <strong>What We Said Last Week on the Odds:</strong>\r\n    Obviously, the worst value here is Jart, who has played erratic football,\r\n    and needs to win three games to win the league. Considering Aross has\r\n    essentially the same odds and only needs to win two, we like his value much\r\n    better. If we were a betting man, we’d take JL, but we like the value on\r\n    Dmichs as well. Expect the winner of JL-Dmichs to win the league.\r\n</p>\r\n<p>\r\n    <strong>Our Thoughts This Week on the Odds:</strong>\r\n    The book continues to fade Aross despite his solid positioning currently,\r\n    so as long as he continues to find ways to win we love his value. We still\r\n    expect the winner of Dmichs-JL to win the league though, so put half your\r\n    savings on one and half on the other!\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<h3>\r\n    The Matchups\r\n</h3>\r\n<p>\r\n    <strong>(2) Aross vs (3) CJ:</strong>\r\n</p>\r\n<p>\r\n    The Lopas Sportsbook Official Odds: CJ -8, -180\r\n</p>\r\n<p>\r\n    <strong>Projected Starting Lineups:</strong>\r\n</p>\r\n<p>\r\n    <strong>CJ:</strong>\r\n</p>\r\n<p>\r\n    Aaron Rodgers (ESPN 19.6, Jart 17.74)\r\n</p>\r\n<p>\r\n    Nick Chubb (ESPN 12.5, Jart 11.2)\r\n</p>\r\n<p>\r\n    David Montgomery (ESPN 13.2, Jart 17.6)\r\n</p>\r\n<p>\r\n    Adam Thielen (ESPN 12.5, Jart 14.4)\r\n</p>\r\n<p>\r\n    Diontae Johnson (ESPN 13.6, Jart 12.2)\r\n</p>\r\n<p>\r\n    Mark Andrews (ESPN 13.5, Jart 11.6)\r\n</p>\r\n<p>\r\n    Michael Pittman (ESPN 11.1, Jart 18.5)\r\n</p>\r\n<p>\r\n    Bills D/ST (ESPN 6.0, Jart 5.0)\r\n</p>\r\n<p>\r\n    Ryan Succop (ESPN 4.4, Jart 4.0)\r\n</p>\r\n<p>\r\n    <strong>Jart Projected Points:</strong>\r\n    112.24<strong></strong>\r\n</p>\r\n<p>\r\n    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Aross:</strong>\r\n</p>\r\n<p>\r\n    Lamar Jackson (ESPN 20.2, Jart 14.4)\r\n</p>\r\n<p>\r\n    Dalvin Cook (ESPN 16.5, Jart 22.2)\r\n</p>\r\n<p>\r\n    Aaron Jones (ESPN 13.2, Jart 18.2)\r\n</p>\r\n<p>\r\n    Tee Higgins (ESPN 10.8, Jart 6.2)\r\n</p>\r\n<p>\r\n    DK Metcalf (ESPN 11.1, Jart 9.8)\r\n</p>\r\n<p>\r\n    Noah Fant (ESPN 6.3, Jart 5.4)\r\n</p>\r\n<p>\r\n    AJ Brown (ESPN 11.7, Jart 10.3)\r\n</p>\r\n<p>\r\n    Bucs D/ST (ESPN 7.2, Jart 11.0)\r\n</p>\r\n<p>\r\n    Greg Joseph (ESPN 5.0, Jart 6.5)\r\n</p>\r\n<p>\r\n    <strong>Jart Projected Points: 104.00</strong>\r\n</p>\r\n<p>\r\n    <strong>What The League Is Saying:</strong>\r\n</p>\r\n<p>\r\n    -Aross will rock\r\n</p>\r\n<p>\r\n    -Folbe and MW and Bank suck at fantasy a lot\r\n</p>\r\n<p>\r\n    -Will be interesting to see if aross’ team shows how fraudulent it is\r\n</p>\r\n<p>\r\n    -CJ deserves to win but aross will win 85-82\r\n</p>\r\n<p>\r\n    <strong>CJ:</strong>\r\n    Bring it on Alex Ross\r\n</p>\r\n<p>\r\n    <strong>Aross:</strong>\r\n    No comment\r\n</p>\r\n<p>\r\n    <strong>(1) JL vs (5) Dmichs:</strong>\r\n</p>\r\n<p>\r\n    The Lopas Sportsbook Official Odds: JL- With Kelce: -2.5, 130. Without\r\n    Kelce: -9, -200\r\n</p>\r\n<p>\r\n    <strong>Projected Starting Lineups:</strong>\r\n</p>\r\n<p>\r\n    <strong>JL:</strong>\r\n</p>\r\n<p>\r\n    Kyler Murray (ESPN 19.7, Jart 24.7)\r\n</p>\r\n<p>\r\n    Austin Ekeler (ESPN 18.2, Jart 8.8)\r\n</p>\r\n<p>\r\n    Joe Mixon (ESPN 15.7, Jart 7.6)\r\n</p>\r\n<p>\r\n    Ceedee Lamb (ESPN 13.9, Jart 22.4)\r\n</p>\r\n<p>\r\n    Deebo Samuel (ESPN 15.9, Jart 26.7)\r\n</p>\r\n<p>\r\n    Rob Gronkowski (ESPN 12.5, Jart 18.4)\r\n</p>\r\n<p>\r\n    Russell Gage (ESPN 9.7, Jart 14.5)\r\n</p>\r\n<p>\r\n    Chargers D/ST (ESPN 7.1, Jart 12.0)\r\n</p>\r\n<p>\r\n    Robbie Gould (ESPN 4.4, Jart 7.0)\r\n</p>\r\n<p>\r\n    <strong>Jart Projected Points:</strong>\r\n    142.10<strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Dmichs:</strong>\r\n</p>\r\n<p>\r\n    Dak Prescott (ESPN 19.2, Jart 25.4)\r\n</p>\r\n<p>\r\n    Jonathan Taylor (ESPN 19.7, Jart 32.2)\r\n</p>\r\n<p>\r\n    Josh Jacobs (ESPN 13.0, Jart 11.4)\r\n</p>\r\n<p>\r\n    Amari Cooper (ESPN 10.5, Jart 13.4)\r\n</p>\r\n<p>\r\n    Marquise Brown (ESPN 12.2, Jart 17.6)\r\n</p>\r\n<p>\r\n    Travis Kelce (ESPN 13.2, Jart 9.2)\r\n</p>\r\n<p>\r\n    Ronald Jones II (ESPN 12.7, Jart 7.8)\r\n</p>\r\n<p>\r\n    Packers D/ST (ESPN 6.4, Jart 4.0)\r\n</p>\r\n<p>\r\n    Matt Prater (ESPN 5.0, Jart 7.5)\r\n</p>\r\n<p>\r\n    <strong>Jart Projected Points: 128.50</strong>\r\n</p>\r\n<p>\r\n    <strong>What The League Is Saying:</strong>\r\n</p>\r\n<p>\r\n    -Dmichs will rock again\r\n</p>\r\n<p>\r\n    -Very intrigued by this one\r\n</p>\r\n<p>\r\n    -Folbe and MW and Bank suck at fantasy a lot\r\n</p>\r\n<p>\r\n    -Dmichs W\r\n</p>\r\n<p>\r\n    -Lotta covid and injuries piling up in that JL matchup, will keep an eye on\r\n    it\r\n</p>\r\n<p>\r\n    -Alex is going to *poop*pump cj, because he’s a b*tch who went Hollywood on\r\n    us for 4 months\r\n</p>\r\n<p>\r\n    <strong>JL:</strong>\r\n    Dmikes boys are nice I’m concerned\r\n</p>\r\n<p>\r\n    <strong>Dmichs:</strong>\r\n    JL will be tough, especially since he’s long due for a boom week. If I beat\r\n    JL without Ekeler and Mixon playing then it won’t feel great, but we\r\n    celebrate all wins\r\n</p>\r\n<h3>\r\nBest Player at Each Position (Playoffs)\r\n</h3>\r\n<p>\r\n    QB: Dak Prescott, Dmichs\r\n</p>\r\n<p>\r\n    RB: Jonathan Taylor, Dmichs\r\n</p>\r\n<p>\r\n    WR: Deebo Samuel, JL\r\n</p>\r\n<p>\r\n    TE: Rob Gronkowski, JL\r\n</p>\r\n<p>\r\n    D/ST: Chargers D/ST, JL\r\n</p>\r\n<p>\r\n    K: Matt Prater, Dmichs\r\n</p>\r\n<h3>\r\n    Family Award (A Tribute)\r\n</h3>\r\n<p>\r\n    Despite their elimination, The Family award will be given to Jart’s Family\r\n    this week. We want to take this space to provide a tribute to every player\r\n    that was on the roster this season.\r\n</p>\r\n<p>\r\n    <strong>QBs:</strong>\r\n</p>\r\n<p>\r\n    <strong>Jalen Hurts:</strong>\r\nThe GOAT. You’re coming back next year if I can afford you in the auction.    <strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Tua Tagovailoa:</strong>\r\n    I don’t know how I feel about you, but you have no place on my roster.\r\n</p>\r\n<p>\r\n    <strong>Taylor Heinicke:</strong>\r\n    You seem cool, but also very mediocre at QB.\r\n</p>\r\n<p>\r\n    <strong>Tyrod Taylor:</strong>\r\n    Well you never played for me, hope you enjoyed hanging out with the fam on\r\n    Sunday for a week.\r\n</p>\r\n<p>\r\n    <strong>Joe Burrow:</strong>\r\n    Your stack with Chase was goated Week 14. So much fun. But you’re white so\r\n    we’ll be seein ya.\r\n</p>\r\n<p>\r\n    <strong>RBs:</strong>\r\n</p>\r\n<p>\r\n    <strong>Craig Reynolds: </strong>\r\n    You’re the best player on my team.<strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Saquon Barkley: </strong>\r\n    I love you, and there is no one I’m more bummed about getting hurt on a\r\n    freak injury just when you were back at full strength and popping. I’ll\r\n    grab you for cheap next season.\r\n</p>\r\n<p>\r\n    <strong>D’Andre Swift:</strong>\r\n    People love to sleep on you, but not me. Let’s ride again, heal up champ.\r\n</p>\r\n<p>\r\n    <strong>Miles Sanders: </strong>\r\n    Find the endzone and then call me. Sorry for benching you.\r\n</p>\r\n<p>\r\n    <strong>Kenyan Drake:</strong>\r\n    Heal up king. We’ll ride again one day.\r\n</p>\r\n<p>\r\n    <strong>Mark Ingram II:</strong>\r\n    Nothing but love for the Day One. Keep grinding big fella real ones know\r\n    you’re better than Alvin.\r\n</p>\r\n<p>\r\n    <strong>Rashaad Penny:</strong>\r\n    Your first stint on my team was garbage, your second stint cost me a win\r\n    this week. I never want to hear from you again.\r\n</p>\r\n<p>\r\n    <strong>Damien Williams</strong>\r\n    : My dropping of you played a part in ruining Nooni’s season. Good work.\r\n</p>\r\n<p>\r\n    <strong>Cordarelle Patterson</strong>\r\n    : Oh baby. What a player. Such a pleasure to have you on The Family, and\r\n    nice to know that you would’ve let me down in the playoffs as well with 3.3\r\n    points.\r\n</p>\r\n<p>\r\n    <strong>Nyheim Hines</strong>\r\n    : I thought you’d be sick and take over the starting job from Taylor. That\r\n    was perhaps a little bit off in reflection.\r\n</p>\r\n<p>\r\n    <strong>Jerick McKinnon:</strong>\r\n    Took a chance on you when CEH went down, didn’t work out.\r\n</p>\r\n<p>\r\n    <strong>Sony Michel:</strong>\r\n    Nice to see you doing big things now. You’ll get a starting job one day.\r\n</p>\r\n<p>\r\n    <strong>David Johnson:</strong>\r\n    You’re not very good anymore, but I still love you.\r\n</p>\r\n<p>\r\n    <strong>Jeremy McNichols: </strong>\r\n    Oof.\r\n</p>\r\n<p>\r\n    <strong>Kenneth Gainwell:</strong>\r\n    I’ll never forget when I started you and you only touched the ball once but\r\n    it was a 3 yard TD. You suck.\r\n</p>\r\n<p>\r\n    <strong>Eno Benjamin:</strong>\r\n    Was worth a shot. Conner went full bellcow though.\r\n</p>\r\n<p>\r\n    <strong>Ameer Abdullah:</strong>\r\n    You scored! So proud.\r\n</p>\r\n<p>\r\n    <strong>Samaje Perine:</strong>\r\n    You’ll make JL happy.\r\n</p>\r\n<p>\r\n    <strong>JaMycal Hasty:</strong>\r\n    You lasted two days.\r\n</p>\r\n<p>\r\n    <strong>WRs:</strong>\r\n</p>\r\n<p>\r\n    <strong>Davante Adams: </strong>\r\n    It was pretty fun to have you, although you weren’t incredible.\r\n    Disappointing playoff performance, I’m over ya.\r\n</p>\r\n<p>\r\n    <strong>Tyreek Hill: </strong>\r\n    I know Andy Reid hates you, but I don’t. Hope you test negative soon.\r\n</p>\r\n<p>\r\n    <strong>Ja’Marr Chase: </strong>\r\n    Catch the ball. Get open. Be better.\r\n</p>\r\n<p>\r\n    <strong>Parris Campbell:</strong>\r\n    I really started you over D’Andre Swift week one. You were gone by Week\r\n    Two, and I never missed you.\r\n</p>\r\n<p>\r\n    <strong>Kadarius Toney:</strong>\r\n    If you could’ve stayed healthy you woulda taken Ja’Marr Chase’s spot.\r\n</p>\r\n<p>\r\n    <strong>Mecole Hardman</strong>\r\n    : Nothing but love &lt;3.\r\n</p>\r\n<p>\r\n    <strong>Amon-Ra St. Brown: </strong>\r\n    Had you before it was cool. We’ll see you down the road.\r\n</p>\r\n<p>\r\n    <strong>Christian Kirk:</strong>\r\n    Judas.\r\n</p>\r\n<p>\r\n    <strong>William Fuller V:</strong>\r\n    Thought you’d be cool post-suspension. Instead you were just injured all\r\n    the time. We may bring you back next year for a true audition.\r\n</p>\r\n<p>\r\n    <strong>Trequan Smith:</strong>\r\n    You and Jameis just yelled at each other the whole time.\r\n</p>\r\n<p>\r\n    <strong>Brandon Aiyuk:</strong>\r\n    Are you good? Are you bad? I don’t even know.\r\n</p>\r\n<p>\r\n    <strong>TEs:</strong>\r\n</p>\r\n<p>\r\n    <strong>Kyle Pitts: </strong>\r\n    You’re so talented. Calvin kinda screwed you over. Matt Ryan ain’t it. Keep\r\n    grinding, you’re gonna be elite.\r\n</p>\r\n<p>\r\n    <strong>Juwan Johnson:</strong>\r\n    I thought you were gonna be sweet. You were not.\r\n</p>\r\n<p>\r\n    <strong>Hunter Henry:</strong>\r\n    I should’ve never let you go. Kyle sucked.\r\n</p>\r\n<p>\r\n    <strong>Ks:</strong>\r\n</p>\r\n<p>\r\n    <strong>Tyler Bass:</strong>\r\n    You’re built different, and I respect that about you.<strong></strong>\r\n</p>\r\n<p>\r\n    <strong>Brandon McManus: </strong>\r\n    The King of Instagram, you didn’t make it past your bye week, but we had\r\n    some good times.\r\n</p>\r\n<p>\r\n    <strong>Greg Zurlein:</strong>\r\n    Gregory the Leggory, always a pleasure. I’m sure we’ll cross paths again.\r\n</p>\r\n<p>\r\n    <strong>Randy Bullock:</strong>\r\n    Stay fat Randy, forever a legend.\r\n</p>"}